{
  "date": "2026-02-02",
  "paper_count": 7,
  "papers": [
    {
      "id": "2601.22815v1",
      "title": "The SPIRou Legacy Survey: Detection of a nearby world orbiting in the habitable zone of Gl725B achieved by correcting strong telluric contamination in near-infrared radial velocities with WAPITI",
      "abstract": "M dwarfs are prime targets in the search for exoplanets because of their prevalence and because low-mass planets can be better detected with radial velocity (RV) methods. In particular, the near-infrared (NIR) spectral domain offers an increased RV sensitivity and potentially reduced stellar activity signals. Howevern precise NIR RV measurements can be strongly affected by telluric absorption lines from the Earth's atmosphere. We searched for planets orbiting Gl 725 B, a nearby late-M dwarf at 3.5 pc, using high-precision SPIRou RV observations. We assessed the impact of telluric contamination and evaluated the performance of the weighted principal component analysis reconstruction method (WAPITI), designed to mitigate these systematics and improve planet detectability. Using synthetic and observational SPIRou data, we simulated telluric effects on RVs under varying barycentric Earth radial velocity (BERV) conditions and applied WAPITI to correct line-by-line RVs. The method was tested through injection-recovery experiments and applied to real SPIRou observations of Gl 725 B. WAPITI efficiently corrects telluric contamination in simulated and real datasets, enhancing the detectability and accuracy of planetary signals. We identify a two-planet system around Gl 725 B composed of a candidate inner planet (Gl 725 Bb) with a period of 4.765 ± 0.004 days and semi-amplitude 1.4 ± 0.3 m.s^-1, and a confirmed outer planet (Gl 725 Bc) with a period of 37.90 ± 0.17 days and semi-amplitude 1.7 ± 0.3 m.s^-1. Their minimum masses are 1.5 ± 0.4 and 3.5 ± 0.7 M_⊕, respectively, and the outer planet lies in the habitable zone. Using a multi-dimensional Gaussian process framework to model stellar activity, we also recover a stellar rotation period of 105.1 ± 3.3 days.",
      "authors": [
        "M. Ould-Elhkim",
        "C. Moutou",
        "J. -F. Donati",
        "P. Cortés-Zuleta",
        "X. Delfosse",
        "É. Artigau",
        "C. Cadieux",
        "P. Charpentier",
        "A. Carmona",
        "I. Boisse",
        "C. Reylé",
        "E. Gaidos",
        "R. Cloutier",
        "G. Hébrard",
        "L. Arnold",
        "J. -D. do Nascimento",
        "N. J. Cook",
        "R. Doyon"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-30",
      "updated": "2026-01-30",
      "pdf_link": "https://arxiv.org/pdf/2601.22815v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.22815v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 20,
      "summary": "**Why It Matters**\n\nFinding planets that could potentially host life is one of the most exciting frontiers in astronomy today. Scientists are particularly interested in discovering worlds that orbit in the \"habitable zone\" – the sweet spot around a star where liquid water could exist on a planet's surface. Red dwarf stars, which are smaller and cooler than our Sun, are excellent targets for this search because they're incredibly common in our galaxy and any planets orbiting them are easier to detect. However, studying these distant worlds comes with a major challenge: Earth's own atmosphere interferes with our measurements, like trying to listen to a whisper while standing next to a noisy highway.\n\n**What They Did**\n\nResearchers used a sophisticated telescope instrument called SPIRou to hunt for planets around a nearby red dwarf star called Gl 725 B, located just 3.5 parsecs away (about 11 light-years – practically next door in cosmic terms). They employed a technique that watches for tiny wobbles in the star's motion, caused by orbiting planets tugging on it gravitationally. Think of it like watching a person walking an invisible dog – you can tell the dog is there by how the person gets pulled back and forth. The team's major innovation was developing a new method called WAPITI to filter out the contaminating effects of Earth's atmosphere, which had been masking the subtle planetary signals they were trying to detect.\n\n**Key Findings**\n\nThe researchers discovered not just one, but two planets orbiting Gl 725 B! The inner planet, dubbed Gl 725 Bb, whips around its star every 4.8 days and has about 1.5 times Earth's mass. The outer planet, Gl 725 Bc, takes 38 days to complete its orbit and weighs in at 3.5 times Earth's mass – making it what astronomers call a \"super-Earth.\" Most excitingly, this larger planet sits squarely in the habitable zone where temperatures could allow liquid water to exist.\n\n**Looking Forward**\n\nThis discovery demonstrates that new analytical techniques can uncover hidden worlds that previous methods missed. As we refine these tools and apply them to more red dwarf stars, we're likely to find many more potentially habitable planets lurking in our cosmic neighborhood, bringing us closer to answering whether Earth-like worlds are common in the universe.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Finding planets that could potentially host life is one of the most exciting frontiers in astronomy today. Scientists are particularly interested in discovering worlds that orbit in the \"habitable zone\" – the sweet spot around a star where liquid water could exist on a planet's surface. Red dwarf stars, which are smaller and cooler than our Sun, are excellent targets for this search because they're incredibly common in our galaxy and any planets orbiting them are easier to detect. However, studying these distant worlds comes with a major challenge: Earth's own atmosphere interferes with our measurements, like trying to listen to a whisper while standing next to a noisy highway.</p>\n<h4>What They Did</h4>\n<p>Researchers used a sophisticated telescope instrument called SPIRou to hunt for planets around a nearby red dwarf star called Gl 725 B, located just 3.5 parsecs away (about 11 light-years – practically next door in cosmic terms). They employed a technique that watches for tiny wobbles in the star's motion, caused by orbiting planets tugging on it gravitationally. Think of it like watching a person walking an invisible dog – you can tell the dog is there by how the person gets pulled back and forth. The team's major innovation was developing a new method called WAPITI to filter out the contaminating effects of Earth's atmosphere, which had been masking the subtle planetary signals they were trying to detect.</p>\n<h4>Key Findings</h4>\n<p>The researchers discovered not just one, but two planets orbiting Gl 725 B! The inner planet, dubbed Gl 725 Bb, whips around its star every 4.8 days and has about 1.5 times Earth's mass. The outer planet, Gl 725 Bc, takes 38 days to complete its orbit and weighs in at 3.5 times Earth's mass – making it what astronomers call a \"super-Earth.\" Most excitingly, this larger planet sits squarely in the habitable zone where temperatures could allow liquid water to exist.</p>\n<h4>Looking Forward</h4>\n<p>This discovery demonstrates that new analytical techniques can uncover hidden worlds that previous methods missed. As we refine these tools and apply them to more red dwarf stars, we're likely to find many more potentially habitable planets lurking in our cosmic neighborhood, bringing us closer to answering whether Earth-like worlds are common in the universe.</p>",
      "tweet_hook": {
        "hook": "🌍 New habitable zone planet discovered around nearby red dwarf star!",
        "claim": "SPIRou telescope detects exoplanet in habitable zone of Gl725B by overcoming atmospheric interference that plagued previous observations",
        "evidence": "Used WAPITI technique to correct strong telluric contamination in near-infrared measurements of this late-M dwarf star",
        "question": "Could this nearby world be our next target in the search for extraterrestrial life?"
      },
      "figure_url": "https://arxiv.org/html/2601.22815v1/x1.png"
    },
    {
      "id": "2601.23176v1",
      "title": "HEP digital micromirror devices for precision solar spectroscopy",
      "abstract": "We present the motivation and early tests for a novel solar instrument that will harness the new High Efficiency Pixel (HEP) Texas Instruments DLP801RE Digital Micromirror Device (DMD) as a reconfigurable spatial light modulator. This design enables real-time, dynamic configuration of the field of view for targeted spectroscopy of magnetically active regions and full-disk observations. Optical efficiency was validated through simulations and laser testing. Destructive window removal allowed for detailed structural analysis, confirming the elimination of central vias present in previous models. We measured a contrast ratio of 250:1, currently limited by the evaluation board's duty cycle rather than the DMD itself. Furthermore, we successfully simulated artificial planetary transits, recovering depths ranging from gas giants to a 40 ppm rocky planet transit. These results demonstrate the HEP DMD's potential for high-precision solar and exoplanetary science applications.",
      "authors": [
        "Christian Robles",
        "Suvrath Mahadevan"
      ],
      "categories": [
        "astro-ph.IM"
      ],
      "published": "2026-01-30",
      "updated": "2026-01-30",
      "pdf_link": "https://arxiv.org/pdf/2601.23176v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.23176v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\n\nImagine trying to spot a firefly buzzing around a lighthouse from miles away—that's essentially what astronomers face when searching for planets orbiting distant stars. This research introduces a revolutionary new tool that could make detecting these \"exoplanets\" far more precise, potentially helping us find Earth-like worlds that might harbor life. The technology also promises to dramatically improve how we study our own Sun, giving scientists better ways to monitor the magnetic storms and solar flares that can disrupt satellites and power grids on Earth.\n\n**What They Did**\n\nThe researchers tested a cutting-edge device called a Digital Micromirror Device, which contains millions of tiny mirrors—each smaller than a human hair—that can flip back and forth thousands of times per second. Think of it like having millions of microscopic disco balls that you can control individually. By programming these mirrors to reflect light in specific patterns, scientists can essentially \"sculpt\" the light coming from stars or the Sun, allowing them to focus on exactly the regions they want to study. The team ran the device through various tests, including simulating what it would look like when planets pass in front of their host stars.\n\n**Key Findings**\n\nThe new mirror device performed exceptionally well, achieving a contrast ratio of 250 to 1—meaning it can distinguish between bright and dim areas with remarkable precision. Most impressively, the researchers successfully simulated detecting planets as small as rocky worlds like Earth, including signals as faint as 40 parts per million. To put that in perspective, that's like detecting a single drop of food coloring in 25,000 liters of water.\n\n**Looking Forward**\n\nThis technology could revolutionize exoplanet hunting by making telescopes far more sensitive to small, Earth-sized planets. It might also transform solar astronomy, allowing scientists to track dangerous space weather in real-time and better protect our technology-dependent civilization from solar storms.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to spot a firefly buzzing around a lighthouse from miles away—that's essentially what astronomers face when searching for planets orbiting distant stars. This research introduces a revolutionary new tool that could make detecting these \"exoplanets\" far more precise, potentially helping us find Earth-like worlds that might harbor life. The technology also promises to dramatically improve how we study our own Sun, giving scientists better ways to monitor the magnetic storms and solar flares that can disrupt satellites and power grids on Earth.</p>\n<h4>What They Did</h4>\n<p>The researchers tested a cutting-edge device called a Digital Micromirror Device, which contains millions of tiny mirrors—each smaller than a human hair—that can flip back and forth thousands of times per second. Think of it like having millions of microscopic disco balls that you can control individually. By programming these mirrors to reflect light in specific patterns, scientists can essentially \"sculpt\" the light coming from stars or the Sun, allowing them to focus on exactly the regions they want to study. The team ran the device through various tests, including simulating what it would look like when planets pass in front of their host stars.</p>\n<h4>Key Findings</h4>\n<p>The new mirror device performed exceptionally well, achieving a contrast ratio of 250 to 1—meaning it can distinguish between bright and dim areas with remarkable precision. Most impressively, the researchers successfully simulated detecting planets as small as rocky worlds like Earth, including signals as faint as 40 parts per million. To put that in perspective, that's like detecting a single drop of food coloring in 25,000 liters of water.</p>\n<h4>Looking Forward</h4>\n<p>This technology could revolutionize exoplanet hunting by making telescopes far more sensitive to small, Earth-sized planets. It might also transform solar astronomy, allowing scientists to track dangerous space weather in real-time and better protect our technology-dependent civilization from solar storms.</p>",
      "tweet_hook": {
        "hook": "🔬 Solar telescope gets a digital upgrade with millions of tiny mirrors! ☀️",
        "claim": "New HEP digital micromirror device enables real-time, dynamic solar spectroscopy with reconfigurable field of view for targeted observations of magnetic regions.",
        "evidence": "Texas Instruments DLP801RE DMD acts as spatial light modulator, validated through simulations and laser testing with enhanced optical efficiency.",
        "question": "Could millions of programmable mirrors revolutionize how we study solar magnetic activity?"
      },
      "figure_url": "https://arxiv.org/html/2601.23176v1/dmd_first.png"
    },
    {
      "id": "2601.23235v1",
      "title": "The Effect of Tidal Heating and Volatile Budgets on the Outgassed Atmosphere of 55 Cancri e",
      "abstract": "55 Cancri e is a ~8 Gyr rocky world (1.95 R_⊕, 8.8 M_⊕) orbiting a K-type star. JWST observations suggest a carbon-dominated atmosphere (CO_2/CO) over a global magma ocean (>3000 K). We suggest that any CO_2-dominated atmosphere, with trace H_2O/O_2, likely arises from outgassing of its initial volatile reservoir. As solidification drives the magma ocean and atmosphere away from solution-equilibrium, tidal and greenhouse heating can prolong outgassing. Early atmosphere outgassing reflects rapid degassing of the volatile-saturated melt during post-formation cooling. Without tidal heating, an initial 5 wt% water mass fraction (F_H_2O) or 3 wt% CO_2 mass fraction (F_CO_2) can sustain outgassing for at least ~10 Myr. With both at 10 wt%, greenhouse warming alone can prolong outgassing up to ~30 Myr. Our model shows that tidal heating can reduce the volatile threshold required to maintain a high surface temperature (~3200 K at e = 0.005) and delay outgassing of additional volatiles to the present-day. However, higher tidal heating presents a tradeoff between prolonging tenuous outgassing and enlarging the overall size of the secondary atmosphere. Tidally-enhanced outgassing may produce minor pressure variations that could contribute to the observed phase-curve variability. Additionally, our model shows that tidal heating strongly controls outgassing in the planet's young-to-midlife stage, then shifts toward a volatile inventory dependence at mature ages. Using 55 Cnc e, we present a framework to prioritize atmosphere detections on rocky ultra short period (USP) magma ocean planets, linking age-dependent tidal heating and volatile inventory to the formation and size of secondary atmospheres.",
      "authors": [
        "Barron K. Nguyen",
        "Laura K. Schaefer",
        "Fei Dai",
        "Héctor E. Delgado-Díaz"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-30",
      "updated": "2026-01-30",
      "pdf_link": "https://arxiv.org/pdf/2601.23235v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.23235v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 25,
      "summary": "**Why It Matters**\n\nImagine a world so close to its star that its entire surface is molten rock, constantly squeezed and stretched by gravitational forces. This isn't science fiction—it's 55 Cancri e, a real planet about 40 light-years from Earth. The James Webb Space Telescope recently detected what appears to be an atmosphere around this hellish world, which shouldn't be possible given the extreme conditions. Understanding how planets like this can maintain atmospheres helps us piece together the story of how worlds form and evolve throughout the universe, including potentially habitable ones.\n\n**What They Did**\n\nResearchers created computer models to simulate how 55 Cancri e might have developed and maintained its atmosphere over billions of years. They focused on two key processes: tidal heating (the planet getting squeezed like a stress ball as it orbits extremely close to its star) and outgassing (gases escaping from molten rock, like steam rising from hot lava). The team tested different scenarios with varying amounts of water and carbon dioxide initially trapped in the planet's rocks, then calculated how these gases would be released over time under different heating conditions.\n\n**Key Findings**\n\nThe research reveals that tidal heating acts like a cosmic thermostat, keeping the planet hot enough to continuously release gases from its molten surface. Even modest amounts of water or carbon dioxide—just 3-5% of the planet's mass—can sustain this process for at least 10 million years. When both gases are present at higher concentrations (10% of the planet's mass), outgassing can continue for 30 million years or more. The study also found that stronger tidal heating creates a trade-off: it can maintain the extreme surface temperatures needed for outgassing, but it also affects how thick the atmosphere becomes.\n\n**Looking Forward**\n\nThis research provides astronomers with a roadmap for finding atmospheres around other extreme worlds. By understanding the relationship between a planet's age, its orbital mechanics, and its original composition, scientists can better predict which of the thousands of known rocky planets might harbor detectable atmospheres—bringing us closer to understanding planetary evolution across the galaxy.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine a world so close to its star that its entire surface is molten rock, constantly squeezed and stretched by gravitational forces. This isn't science fiction—it's 55 Cancri e, a real planet about 40 light-years from Earth. The James Webb Space Telescope recently detected what appears to be an atmosphere around this hellish world, which shouldn't be possible given the extreme conditions. Understanding how planets like this can maintain atmospheres helps us piece together the story of how worlds form and evolve throughout the universe, including potentially habitable ones.</p>\n<h4>What They Did</h4>\n<p>Researchers created computer models to simulate how 55 Cancri e might have developed and maintained its atmosphere over billions of years. They focused on two key processes: tidal heating (the planet getting squeezed like a stress ball as it orbits extremely close to its star) and outgassing (gases escaping from molten rock, like steam rising from hot lava). The team tested different scenarios with varying amounts of water and carbon dioxide initially trapped in the planet's rocks, then calculated how these gases would be released over time under different heating conditions.</p>\n<h4>Key Findings</h4>\n<p>The research reveals that tidal heating acts like a cosmic thermostat, keeping the planet hot enough to continuously release gases from its molten surface. Even modest amounts of water or carbon dioxide—just 3-5% of the planet's mass—can sustain this process for at least 10 million years. When both gases are present at higher concentrations (10% of the planet's mass), outgassing can continue for 30 million years or more. The study also found that stronger tidal heating creates a trade-off: it can maintain the extreme surface temperatures needed for outgassing, but it also affects how thick the atmosphere becomes.</p>\n<h4>Looking Forward</h4>\n<p>This research provides astronomers with a roadmap for finding atmospheres around other extreme worlds. By understanding the relationship between a planet's age, its orbital mechanics, and its original composition, scientists can better predict which of the thousands of known rocky planets might harbor detectable atmospheres—bringing us closer to understanding planetary evolution across the galaxy.</p>",
      "tweet_hook": {
        "hook": "JWST reveals 55 Cancri e has a carbon atmosphere over a 3000K magma ocean! 🔥",
        "claim": "This 8-billion-year-old rocky world maintains its CO₂ atmosphere through continuous outgassing from its volatile-rich interior, sustained by tidal heating",
        "evidence": "The planet's magma ocean exceeds 3000K, with tidal forces from its close orbit preventing atmospheric loss over geological timescales",
        "question": "Could other tidally-heated exoplanets harbor similar carbon-rich atmospheres?"
      },
      "figure_url": "https://arxiv.org/html/2601.23235v1/x1.png"
    },
    {
      "id": "2601.23069v1",
      "title": "Quantifying the C/O ratio in the planet-forming environments around very-low-mass stars",
      "abstract": "The material in planet-forming disks determines the composition of planets; hence, it is crucial to understand the physical and chemical processes that set the abundance and distribution of key volatiles. James Webb Space Telescope observations of disks around very-low-mass (~0.1~M☉) stars (VLMS) have revealed their hydrocarbon-rich inner regions (e.g., C_2H_2), with column densities significantly higher than predicted. We employ chemical kinetics models using the physical structure of the inner disk around an M~Dwarf star with an X-ray luminosity of L_X~10^29~erg~s^-1. We adopt initial abundances that mimic the effects of carbon enhancement and oxygen depletion (C/O from 0.44 to 87.47) and quantify how the abundances and distributions of key volatiles respond. The column density and number of molecules (N) of hydrocarbons and oxygen-bearing species are highly sensitive to the C/O ratio, with the largest increases in hydrocarbons occurring when carbon increases by a factor of 2, and/or oxygen decreases by a factor of 10, relative to solar. In the IR-emitting region (T_gas>200~K), a range of C/O ratios can reproduce the observed N and ratios relative to CO_2. The disk-integrated molecular ratio with respect to CO_2 is highly sensitive to the underlying C/O ratio. However, our results apply only to a source with a single X-ray luminosity value at the middle of that observed for VLMS; hence, a degeneracy between the stellar L_X and the C/O ratio cannot be discarded. Nonetheless, our findings support that an enhanced C/O is required to drive the hydrocarbon-rich chemistry observed in the inner disks around VLMS.",
      "authors": [
        "Javiera K. Díaz-Berríos",
        "Catherine Walsh",
        "Ewine F. van Dishoeck"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-30",
      "updated": "2026-01-30",
      "pdf_link": "https://arxiv.org/pdf/2601.23069v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.23069v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 12,
      "summary": "**Why It Matters**\n\nImagine trying to predict what kind of house you could build based only on the materials available in your neighborhood hardware store. That's essentially what astronomers face when studying planets around other stars—the \"building blocks\" available in a star's surrounding disk of gas and dust determine what kinds of planets can form. This research focuses on the smallest stars in our galaxy, called very-low-mass stars, which are about one-tenth the mass of our Sun. These cosmic lightweights are incredibly common, making up roughly 75% of all stars, yet we're only beginning to understand the planetary systems they host. Since these stars could harbor billions of potentially habitable worlds, understanding their planet-forming environments is crucial for knowing how common Earth-like planets might be in the universe.\n\n**What They Did**\n\nThe researchers used computer models to simulate the chemistry happening in the swirling disks of gas and dust around very-low-mass stars. Think of these disks like cosmic pizza dough—hot and spinning, with different ingredients mixed throughout. The team specifically looked at the inner regions of these disks, where rocky planets like Earth typically form. They ran their models with different recipes, varying the amounts of carbon and oxygen (two key ingredients for planets) to see how this affected the types of molecules that could form. Their simulations were designed to match recent observations from the James Webb Space Telescope, which has been peering into these distant stellar nurseries with unprecedented clarity.\n\n**Key Findings**\n\nThe models revealed that these planet-forming disks are surprisingly rich in hydrocarbon molecules—carbon-based compounds like acetylene. To match what telescopes actually observe, the disks need to have much more carbon relative to oxygen than previously expected. In some cases, the carbon-to-oxygen ratio needed to be increased by up to 200 times compared to our solar system. When the researchers doubled the amount of carbon or reduced oxygen by a factor of ten, they saw dramatic increases in hydrocarbon production, creating the chemical signatures astronomers observe.\n\n**Looking Forward**\n\nThese findings suggest that planets forming around very-low-mass stars may have fundamentally different compositions than planets in our solar system. With carbon-rich building blocks, these worlds might develop unique atmospheres and surface chemistry that could affect their potential for hosting life. As the James Webb Space Telescope continues observing these systems, astronomers will refine their understanding of how common these carbon-rich environments are, ultimately helping us predict what kinds of planets fill our galaxy.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to predict what kind of house you could build based only on the materials available in your neighborhood hardware store. That's essentially what astronomers face when studying planets around other stars—the \"building blocks\" available in a star's surrounding disk of gas and dust determine what kinds of planets can form. This research focuses on the smallest stars in our galaxy, called very-low-mass stars, which are about one-tenth the mass of our Sun. These cosmic lightweights are incredibly common, making up roughly 75% of all stars, yet we're only beginning to understand the planetary systems they host. Since these stars could harbor billions of potentially habitable worlds, understanding their planet-forming environments is crucial for knowing how common Earth-like planets might be in the universe.</p>\n<h4>What They Did</h4>\n<p>The researchers used computer models to simulate the chemistry happening in the swirling disks of gas and dust around very-low-mass stars. Think of these disks like cosmic pizza dough—hot and spinning, with different ingredients mixed throughout. The team specifically looked at the inner regions of these disks, where rocky planets like Earth typically form. They ran their models with different recipes, varying the amounts of carbon and oxygen (two key ingredients for planets) to see how this affected the types of molecules that could form. Their simulations were designed to match recent observations from the James Webb Space Telescope, which has been peering into these distant stellar nurseries with unprecedented clarity.</p>\n<h4>Key Findings</h4>\n<p>The models revealed that these planet-forming disks are surprisingly rich in hydrocarbon molecules—carbon-based compounds like acetylene. To match what telescopes actually observe, the disks need to have much more carbon relative to oxygen than previously expected. In some cases, the carbon-to-oxygen ratio needed to be increased by up to 200 times compared to our solar system. When the researchers doubled the amount of carbon or reduced oxygen by a factor of ten, they saw dramatic increases in hydrocarbon production, creating the chemical signatures astronomers observe.</p>\n<h4>Looking Forward</h4>\n<p>These findings suggest that planets forming around very-low-mass stars may have fundamentally different compositions than planets in our solar system. With carbon-rich building blocks, these worlds might develop unique atmospheres and surface chemistry that could affect their potential for hosting life. As the James Webb Space Telescope continues observing these systems, astronomers will refine their understanding of how common these carbon-rich environments are, ultimately helping us predict what kinds of planets fill our galaxy.</p>",
      "tweet_hook": {
        "hook": "🪐 JWST just revealed something shocking about planet formation around tiny stars",
        "claim": "Planet-forming disks around very-low-mass stars contain WAY more hydrocarbons than scientists predicted - completely rewriting our models of how rocky worlds get their chemistry",
        "evidence": "C/O ratios and hydrocarbon column densities (like C₂H₂) are significantly higher than theoretical predictions in these 0.1 solar mass systems",
        "question": "Could Earth-like planets around red dwarfs have totally different atmospheric chemistry?"
      },
      "figure_url": "https://images.unsplash.com/photo-1462331940025-496dfbfc7564?w=800&q=80"
    },
    {
      "id": "2601.22606v1",
      "title": "Sculpting of Martian brain terrain reveals the drying of ancient Mars",
      "abstract": "The Martian brain terrain (MBT), characterized by its unique brain-like morphology, is a potential geological archive for finding hints of paleoclimatic conditions during its formation period. The morphological similarity of MBT to self-organized patterned ground on Earth suggests a shared formation mechanism. However, the lack of quantitative descriptions and robust physical modeling of self-organized stone transport jointly limits the study of the thermal and aqueous conditions governing MBT's formation. Here we established a specialized quantitative system for extracting the morphological features of MBT, taking a typical region located in the northern Arabia Terra as an example, and then employed a numerical model to investigate its formation mechanisms. Our simulation results accurately replicate the observed morphology of MBT, matching its key geometric metrics with deviations <10\\%. Crucially, however, we find that the self-organized transport can solely produce relief <0.5 m, insufficient to explain the formation of MBT with average relief of 3.29 ± 0.65 m. We attribute this discrepancy to sculpting driven by late-stage sublimation, constraining cumulative subsurface ice loss in this region to ~ 3 meters over the past ~ 3 Ma. These findings demonstrate that MBT's formation is a multi-stage process: initial patterning driven by freeze-thaw cycles (implying liquid water) followed by vertical sculpting via sublimation (requiring a dry environment). This evolution provides physical evidence for the transition of the ancient Martian climate from a wetter period to a colder hyper-arid state.",
      "authors": [
        "Shenyi Zhang",
        "Lei Zhang",
        "Yutian Ke",
        "Jinhai Zhang"
      ],
      "categories": [
        "physics.geo-ph"
      ],
      "published": "2026-01-30",
      "updated": "2026-01-30",
      "pdf_link": "https://arxiv.org/pdf/2601.22606v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.22606v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 8,
      "summary": "**Why It Matters**\n\nMars holds the keys to understanding how planets evolve and whether life could exist beyond Earth. Hidden in its landscape are clues about ancient climates that might have supported life billions of years ago. Scientists have long debated whether Mars was once warm and wet enough for life to emerge, or if it was always the frozen desert we see today. New research examining strange, brain-like patterns on the Martian surface provides the most direct evidence yet that Mars underwent a dramatic climate transformation—transitioning from a world with liquid water to the hyper-arid planet we know today.\n\n**What They Did**\n\nResearchers focused on peculiar formations called \"Martian brain terrain\"—areas of the planet's surface that look remarkably like the wrinkled texture of a human brain when viewed from space. These formations are found in Mars's northern Arabia Terra region. The team created detailed digital maps of these patterns using satellite imagery, measuring their dimensions and comparing them to similar self-organizing patterns found on Earth, like the stone circles that form naturally in Arctic regions through freeze-thaw cycles. They then ran computer simulations to recreate how these brain-like patterns might have formed, testing different environmental conditions to see which scenarios matched what they observed on Mars.\n\n**Key Findings**\n\nThe simulations revealed that Mars's brain terrain formed through a two-stage process spanning millions of years. Initially, freeze-thaw cycles created the basic brain-like patterns—but this process alone could only create features less than half a meter tall. The actual Martian formations average over 3 meters in height. The missing height came from a second stage: the slow evaporation of underground ice over roughly 3 million years, which carved the patterns deeper and made them more pronounced. This sequence proves Mars transitioned from having liquid water to becoming completely dry.\n\n**Looking Forward**\n\nThis research provides a new tool for reading Mars's climate history written in stone. Understanding how Mars lost its water helps scientists predict the fate of potentially habitable exoplanets and refines our search for worlds that could support life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Mars holds the keys to understanding how planets evolve and whether life could exist beyond Earth. Hidden in its landscape are clues about ancient climates that might have supported life billions of years ago. Scientists have long debated whether Mars was once warm and wet enough for life to emerge, or if it was always the frozen desert we see today. New research examining strange, brain-like patterns on the Martian surface provides the most direct evidence yet that Mars underwent a dramatic climate transformation—transitioning from a world with liquid water to the hyper-arid planet we know today.</p>\n<h4>What They Did</h4>\n<p>Researchers focused on peculiar formations called \"Martian brain terrain\"—areas of the planet's surface that look remarkably like the wrinkled texture of a human brain when viewed from space. These formations are found in Mars's northern Arabia Terra region. The team created detailed digital maps of these patterns using satellite imagery, measuring their dimensions and comparing them to similar self-organizing patterns found on Earth, like the stone circles that form naturally in Arctic regions through freeze-thaw cycles. They then ran computer simulations to recreate how these brain-like patterns might have formed, testing different environmental conditions to see which scenarios matched what they observed on Mars.</p>\n<h4>Key Findings</h4>\n<p>The simulations revealed that Mars's brain terrain formed through a two-stage process spanning millions of years. Initially, freeze-thaw cycles created the basic brain-like patterns—but this process alone could only create features less than half a meter tall. The actual Martian formations average over 3 meters in height. The missing height came from a second stage: the slow evaporation of underground ice over roughly 3 million years, which carved the patterns deeper and made them more pronounced. This sequence proves Mars transitioned from having liquid water to becoming completely dry.</p>\n<h4>Looking Forward</h4>\n<p>This research provides a new tool for reading Mars's climate history written in stone. Understanding how Mars lost its water helps scientists predict the fate of potentially habitable exoplanets and refines our search for worlds that could support life.</p>",
      "tweet_hook": {
        "hook": "Mars has 'brain terrain' that reveals how the planet dried up billions of years ago 🧠🔴",
        "claim": "Martian brain terrain's unique morphology acts as a geological archive, revealing paleoclimatic conditions during ancient Mars' transition from wet to dry.",
        "evidence": "The brain-like patterns mirror self-organized patterned ground on Earth, suggesting similar formation mechanisms involving water and thermal cycles.",
        "question": "What secrets about ancient Martian climate are hidden in these mysterious brain-like patterns?"
      },
      "figure_url": "https://images.unsplash.com/photo-1462331940025-496dfbfc7564?w=800&q=80"
    },
    {
      "id": "2601.23152v1",
      "title": "Inhibiting Conduction by He Mixing in Interiors of Jupiter and Saturn",
      "abstract": "Accurate knowledge of the electrical and thermal conductivities and structural properties of hydrogen-helium mixtures under thermodynamic conditions within and beyond the immiscibility range is very important to predict the thermal evolution and internal structure of gas giant planets like Jupiter and Saturn. Here, we propose a novel method to determine the immiscibility boundary accurately without the need for free energy calculations, while providing consistent insights into structural and transport properties of mixtures. We show with direct large-scale ab initio simulations that the insulator-metal transition (IMT) of the hydrogen subsystem is strongly affected by an admixture with a small fraction of helium and occurs at temperatures significantly higher than those of pure hydrogen. At pressures below 150 GPa, the IMT boundary is not related anymore to the H2 subsystem dissociation, the system remains insulating even after the full dissociation of H2 molecules and its transition to an H-He mixture. The offset of the IMT in the H-He mixture relative to the dissociation region in the hydrogen subsystem and the significant reduction of static electrical and thermal conductivity by a factor between two and a few thousand relative to pure hydrogen found in mixtures have consequences for Jupiter and Saturn's thermal evolution, internal structure, and dynamo action, affecting a large fraction of the interior of both planets.",
      "authors": [
        "Valentin V. Karasiev",
        "S. X. Hu",
        "Joshua P. Hinz",
        "R. M. N. Goshadze",
        "Shuai Zhang",
        "Armin Bergermann",
        "Ronald Redmer"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-30",
      "updated": "2026-01-30",
      "pdf_link": "https://arxiv.org/pdf/2601.23152v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.23152v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\n\nGiant planets like Jupiter and Saturn have fascinated humanity for centuries, but we're still uncovering fundamental secrets about how they work on the inside. These cosmic giants aren't just beautiful objects in our night sky—they're natural laboratories that help us understand planetary formation and evolution throughout the universe. Jupiter and Saturn are made mostly of hydrogen and helium, the same elements that fuel stars, but under crushing pressures that create exotic states of matter we can barely imagine. Understanding what happens deep inside these planets doesn't just solve mysteries in our own solar system; it helps us predict what thousands of newly discovered exoplanets might be like and how they evolved over billions of years.\n\n**What They Did**\n\nThe researchers used powerful computer simulations to recreate the extreme conditions inside Jupiter and Saturn, where pressures reach millions of times Earth's atmospheric pressure and temperatures soar to thousands of degrees. Think of it like having a virtual laboratory that can squeeze and heat materials under conditions impossible to achieve on Earth. They specifically studied what happens when hydrogen and helium—the main ingredients of these planets—get mixed together under these brutal conditions. The team ran massive calculations that tracked how individual atoms behave, essentially watching matter transform from one state to another as if viewing it through an incredibly powerful microscope.\n\n**Key Findings**\n\nThe results were surprising: adding even small amounts of helium dramatically changes how hydrogen behaves under pressure. In pure hydrogen, the material becomes metallic (able to conduct electricity) at relatively low temperatures. But mix in some helium, and hydrogen stays insulating until much higher temperatures—sometimes requiring conditions thousands of times more extreme. This mixing reduces the materials' ability to conduct heat and electricity by factors ranging from two to several thousand times compared to pure hydrogen. It's like adding an ingredient that acts as an insulator, dramatically slowing down how energy moves through the planet's interior.\n\n**Looking Forward**\n\nThese discoveries could revolutionize our understanding of how gas giant planets cool down over time and generate their magnetic fields. Since many exoplanets are likely similar to Jupiter and Saturn, this research helps us predict their internal structures and evolution. It might explain why some gas giants are hotter or have different magnetic properties than expected, giving astronomers better tools for characterizing the thousands of worlds we're discovering around other stars.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Giant planets like Jupiter and Saturn have fascinated humanity for centuries, but we're still uncovering fundamental secrets about how they work on the inside. These cosmic giants aren't just beautiful objects in our night sky—they're natural laboratories that help us understand planetary formation and evolution throughout the universe. Jupiter and Saturn are made mostly of hydrogen and helium, the same elements that fuel stars, but under crushing pressures that create exotic states of matter we can barely imagine. Understanding what happens deep inside these planets doesn't just solve mysteries in our own solar system; it helps us predict what thousands of newly discovered exoplanets might be like and how they evolved over billions of years.</p>\n<h4>What They Did</h4>\n<p>The researchers used powerful computer simulations to recreate the extreme conditions inside Jupiter and Saturn, where pressures reach millions of times Earth's atmospheric pressure and temperatures soar to thousands of degrees. Think of it like having a virtual laboratory that can squeeze and heat materials under conditions impossible to achieve on Earth. They specifically studied what happens when hydrogen and helium—the main ingredients of these planets—get mixed together under these brutal conditions. The team ran massive calculations that tracked how individual atoms behave, essentially watching matter transform from one state to another as if viewing it through an incredibly powerful microscope.</p>\n<h4>Key Findings</h4>\n<p>The results were surprising: adding even small amounts of helium dramatically changes how hydrogen behaves under pressure. In pure hydrogen, the material becomes metallic (able to conduct electricity) at relatively low temperatures. But mix in some helium, and hydrogen stays insulating until much higher temperatures—sometimes requiring conditions thousands of times more extreme. This mixing reduces the materials' ability to conduct heat and electricity by factors ranging from two to several thousand times compared to pure hydrogen. It's like adding an ingredient that acts as an insulator, dramatically slowing down how energy moves through the planet's interior.</p>\n<h4>Looking Forward</h4>\n<p>These discoveries could revolutionize our understanding of how gas giant planets cool down over time and generate their magnetic fields. Since many exoplanets are likely similar to Jupiter and Saturn, this research helps us predict their internal structures and evolution. It might explain why some gas giants are hotter or have different magnetic properties than expected, giving astronomers better tools for characterizing the thousands of worlds we're discovering around other stars.</p>",
      "tweet_hook": {
        "hook": "🪐 Jupiter & Saturn's helium is acting like cosmic insulation, blocking heat transfer!",
        "claim": "New research reveals how helium mixing dramatically reduces thermal conductivity in gas giant interiors, reshaping our understanding of planetary evolution.",
        "evidence": "Scientists developed a breakthrough method to map the immiscibility boundary of hydrogen-helium mixtures without complex free energy calculations.",
        "question": "Could this explain why gas giants cool slower than we thought? 🤔"
      },
      "figure_url": "https://arxiv.org/html/2601.23152v1/x1.png"
    },
    {
      "id": "2601.22223v1",
      "title": "Warps survive beyond fly-by encounters in protoplanetary disks. RW Aur A as a case study",
      "abstract": "Stellar fly-bys can have multiple dynamical effects on protoplanetary disks, including warping and the excitation of spiral arms. Since observations indicate that warps are common, we aim to investigate these effects for different fly-by trajectories. We further link our models to observations by applying them to the RW Aur system, which is a fly-by candidate with a relatively well constrained trajectory. We investigate the disk dynamics in grid-based hydrodynamical simulations, which allow for a lower disk viscosity than commonly used SPH models. We post-process our simulations of the RW Aur system with radiative transfer models to create synthetic images of the dust continuum and gas kinematics. Fly-bys inclined with respect to the original disk plane can excite warps of a few degrees: the exact outcome depends on the specific geometry of the encounter. Specifically, we find that the position of the periastron with respect to the initial disk plane plays a role for the resulting warp strength. Within our parameter set, the strongest warp is excited for a retrograde fly-by with a periastron that is not in the same plane as the disk. Our models show that the warp can persist even after the perturber can no longer be clearly linked to the system, implying that past fly-bys are a possible origin of observed warps. Excited spirals arms, on the other hand, are much more short-lived than the warp. The RW Aur system presents a perfect opportunity to apply these results: we find that a warp of about 5° can be excited, and that the strong spiral arms have already disappeared at the current time of observation 300 years after periastron). This compares well with existing continuum observations, and our synthetic kinematic evaluations hint at remnant structures in the gas density that may be detectable.",
      "authors": [
        "C. N. Kimmig",
        "P. Weber",
        "G. P. Rosotti",
        "S. Facchini",
        "C. P. Dullemond"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-29",
      "updated": "2026-01-29",
      "pdf_link": "https://arxiv.org/pdf/2601.22223v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.22223v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\n\nImagine you're watching a cosmic collision in slow motion—except instead of planets crashing together, it's entire star systems having close encounters that reshape the birthplaces of future worlds. This research helps us understand how young planetary systems get twisted and warped when another star swoops too close, potentially affecting where and how planets form. Since astronomers are discovering that these warped, tilted disks around young stars are surprisingly common throughout our galaxy, understanding what causes them could reveal crucial details about how planetary systems—including our own—came to be arranged the way they are today.\n\n**What They Did**\n\nThe research team used powerful computer simulations to recreate what happens when one star flies close to another star surrounded by a spinning disk of gas and dust—the raw material for future planets. Think of it like modeling what occurs when you stir a calm pond with a stick, but in three dimensions and over thousands of years. They focused on a real star system called RW Aur, where astronomers suspect such a close encounter happened about 300 years ago. The scientists ran their cosmic collision through virtual scenarios, then created synthetic images to compare with actual telescope observations, essentially asking: \"If this really happened, what would we see today?\"\n\n**Key Findings**\n\nThe simulations revealed that stellar fly-bys can bend and warp these planet-forming disks by several degrees—and surprisingly, these warps persist long after the intruding star has moved away. The strongest warping (about 5 degrees) occurs when the visiting star approaches from behind and slightly above or below the disk, like a motorcycle jumping over a spinning record at an angle. While the encounter also creates beautiful spiral arm patterns, these fade away relatively quickly, but the warp remains as a lasting signature of the ancient cosmic encounter.\n\n**Looking Forward**\n\nThese findings suggest that many of the tilted, warped planet-forming disks we observe today might be fossil evidence of stellar fly-bys from the distant past. This could fundamentally change how we think about planetary system architecture and help explain why some exoplanets orbit their stars at odd angles compared to others in the same system.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine you're watching a cosmic collision in slow motion—except instead of planets crashing together, it's entire star systems having close encounters that reshape the birthplaces of future worlds. This research helps us understand how young planetary systems get twisted and warped when another star swoops too close, potentially affecting where and how planets form. Since astronomers are discovering that these warped, tilted disks around young stars are surprisingly common throughout our galaxy, understanding what causes them could reveal crucial details about how planetary systems—including our own—came to be arranged the way they are today.</p>\n<h4>What They Did</h4>\n<p>The research team used powerful computer simulations to recreate what happens when one star flies close to another star surrounded by a spinning disk of gas and dust—the raw material for future planets. Think of it like modeling what occurs when you stir a calm pond with a stick, but in three dimensions and over thousands of years. They focused on a real star system called RW Aur, where astronomers suspect such a close encounter happened about 300 years ago. The scientists ran their cosmic collision through virtual scenarios, then created synthetic images to compare with actual telescope observations, essentially asking: \"If this really happened, what would we see today?\"</p>\n<h4>Key Findings</h4>\n<p>The simulations revealed that stellar fly-bys can bend and warp these planet-forming disks by several degrees—and surprisingly, these warps persist long after the intruding star has moved away. The strongest warping (about 5 degrees) occurs when the visiting star approaches from behind and slightly above or below the disk, like a motorcycle jumping over a spinning record at an angle. While the encounter also creates beautiful spiral arm patterns, these fade away relatively quickly, but the warp remains as a lasting signature of the ancient cosmic encounter.</p>\n<h4>Looking Forward</h4>\n<p>These findings suggest that many of the tilted, warped planet-forming disks we observe today might be fossil evidence of stellar fly-bys from the distant past. This could fundamentally change how we think about planetary system architecture and help explain why some exoplanets orbit their stars at odd angles compared to others in the same system.</p>",
      "tweet_hook": {
        "hook": "🌌 Stellar fly-bys leave lasting scars on protoplanetary disks—warps that survive long after!",
        "claim": "New simulations show disk warps persist beyond stellar fly-by encounters, with RW Aur A system serving as prime observational evidence of these lasting dynamical effects.",
        "evidence": "Hydrodynamical simulations of different fly-by trajectories reveal warps remain stable post-encounter, matching observations of the RW Aur system.",
        "question": "Could ancient stellar encounters explain the warped disks we see forming planets today? 🪐"
      },
      "figure_url": "https://arxiv.org/html/2601.22223v1/x1.png"
    }
  ]
}