{
  "announcement_date": "2026-02-16",
  "updated_at": "2026-02-16T04:22:14.755141+00:00",
  "category": "astro-ph.EP",
  "paper_count": 7,
  "papers": [
    {
      "id": "2602.12353v1",
      "title": "Bayesian Analysis for Remote Biosignature Identification on exoEarths (BARBIE) IV: Analyzing CO2 Detections in the Near-IR to Determine the Long-Wavelength Cut-off for the Habitable Worlds Observatory Coronagraph",
      "abstract": "We present our analysis of how the detectability of carbon dioxide (CO2) on an Earth-like planet varies with respect to signal-to-noise ratio (SNR), wavelength, and molecular abundance. Using the Bayesian Analysis for Remote Biosignature Identification on exoEarths (BARBIE) methodology, we can inform the optimal long-wavelength cut-off for the future Habitable Worlds Observatory (HWO) coronagraph. We test 25 evenly-spaced 20% bandpasses between 0.8-2.0μm, and simulate data spanning a range of SNRs and molecular abundance to analyze the relationship between wavelength and detectability for different planetary archetypes. We examine abundance levels from varying Earth epochs and a Venus-like archetype to investigate how detectability would change throughout the evolution of a rocky planet. Here, we present our results on the planetary conditions and technological requirements to strongly detect CO2. In addition, we analyze the degeneracy of CO2 with carbon monoxide (CO), methane (CH4), and water (H2O). We determine that any abundance of CO does not achieve strong detections and that CH4 and H2O play a pivotal role in the ability to detect CO2. We conclude that the optimal long-wavelength cut-off for the Habitable Worlds Observatory coronagraph should be 1.68μm.",
      "authors": [
        "Celeste Hagee",
        "Natasha Latouf",
        "Avi M. Mandell",
        "Michael D. Himes",
        "Michael Dane Moore",
        "Geronimo L. Villanueva"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-02-12",
      "updated": "2026-02-12",
      "pdf_link": "https://arxiv.org/pdf/2602.12353v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.12353v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 53,
      "summary": "**Why It Matters**\n\nImagine trying to determine if a distant house has people living in it by analyzing the light coming through its windows. That's essentially what astronomers are attempting with planets orbiting other stars—searching for signs of life by studying the gases in their atmospheres. Carbon dioxide is one of the most important clues we can look for, as it tells us about a planet's climate, geology, and potentially its ability to support life. This research is crucial because NASA is planning to build the Habitable Worlds Observatory, a revolutionary space telescope designed to hunt for Earth-like worlds. Getting the telescope's design right the first time is essential, since this billion-dollar instrument will be our best shot at finding life beyond our solar system.\n\n**What They Did**\n\nThe researchers used computer simulations to test how well we could detect carbon dioxide in the atmospheres of Earth-like planets around other stars. They created virtual observations using different telescope settings, much like a photographer testing various camera filters to get the best shot. Specifically, they tested 25 different \"filters\" that would capture light at wavelengths between 0.8 and 2.0 micrometers—a range that includes near-infrared light just beyond what our eyes can see. They simulated planets with different amounts of carbon dioxide, from levels found on ancient Earth to those on Venus today, and calculated how clear the detection signals would be under various conditions.\n\n**Key Findings**\n\nThe team discovered that the telescope should focus on light up to 1.68 micrometers for optimal carbon dioxide detection—this specific wavelength range provides the best balance of signal strength and clarity. They found that other gases significantly affect carbon dioxide detection: methane and water vapor can either help or hinder the process, while carbon monoxide proved nearly impossible to detect reliably regardless of its abundance levels.\n\n**Looking Forward**\n\nThese findings will directly influence the design of humanity's next great planet-hunting telescope. By knowing exactly which wavelengths of light to prioritize, engineers can optimize the observatory's instruments for the best chance of detecting potentially habitable worlds and signs of life beyond Earth.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to determine if a distant house has people living in it by analyzing the light coming through its windows. That's essentially what astronomers are attempting with planets orbiting other stars—searching for signs of life by studying the gases in their atmospheres. Carbon dioxide is one of the most important clues we can look for, as it tells us about a planet's climate, geology, and potentially its ability to support life. This research is crucial because NASA is planning to build the Habitable Worlds Observatory, a revolutionary space telescope designed to hunt for Earth-like worlds. Getting the telescope's design right the first time is essential, since this billion-dollar instrument will be our best shot at finding life beyond our solar system.</p>\n<h4>What They Did</h4>\n<p>The researchers used computer simulations to test how well we could detect carbon dioxide in the atmospheres of Earth-like planets around other stars. They created virtual observations using different telescope settings, much like a photographer testing various camera filters to get the best shot. Specifically, they tested 25 different \"filters\" that would capture light at wavelengths between 0.8 and 2.0 micrometers—a range that includes near-infrared light just beyond what our eyes can see. They simulated planets with different amounts of carbon dioxide, from levels found on ancient Earth to those on Venus today, and calculated how clear the detection signals would be under various conditions.</p>\n<h4>Key Findings</h4>\n<p>The team discovered that the telescope should focus on light up to 1.68 micrometers for optimal carbon dioxide detection—this specific wavelength range provides the best balance of signal strength and clarity. They found that other gases significantly affect carbon dioxide detection: methane and water vapor can either help or hinder the process, while carbon monoxide proved nearly impossible to detect reliably regardless of its abundance levels.</p>\n<h4>Looking Forward</h4>\n<p>These findings will directly influence the design of humanity's next great planet-hunting telescope. By knowing exactly which wavelengths of light to prioritize, engineers can optimize the observatory's instruments for the best chance of detecting potentially habitable worlds and signs of life beyond Earth.</p>",
      "tweet_hook": {
        "hook": "Scientists just figured out how to spot CO2 on alien Earths from 100+ light-years away! 🌍✨",
        "claim": "New research shows exactly which infrared wavelengths NASA's future space telescope needs to detect carbon dioxide in alien atmospheres - a key sign of potentially habitable worlds.",
        "evidence": "By testing 25 different wavelength ranges between 0.8-2.0μm, they found the optimal settings for the Habitable Worlds Observatory coronagraph.",
        "question": "Could we finally answer: are we alone in the universe? 🔭"
      },
      "figure_url": "https://images.unsplash.com/photo-1614730321146-b6fa6a46bcb4?w=800&q=80"
    },
    {
      "id": "2602.12977v1",
      "title": "TIC-65910228 b / NGTS-38 b, a 180 day transiting warm super-Jupiter",
      "abstract": "We present the discovery of TIC-65910228 b / NGTS-38 b, a giant exoplanet with a radius of 1.081±0.047 R_J and a mass of 4.78₋₀.₃₇⁺⁰.⁴⁰ M_J on a long-period (180.52791±0.00038 day), moderately eccentric (e=0.308±0.011) orbit transiting a bright (V=10.230±0.020 mag) metal rich ([Fe/H]=0.33±0.09, 'dex') F6V-F7V type host star. The planet was initially detected from a single transit in TESS Sector 33. A photometric monitoring campaign of 228 nights with NGTS detected a transit egress of the planet, which together with spectroscopic radial velocity monitoring with CORALIE and HARPS identified an orbital period of 180.5,d. These radial velocity measurements also showed the mass of the companion to be planetary. Additional transit observations coordinated by the TESS follow-up observing program allowed further confirmation and refinement of this period. With its relatively cool equilibrium temperature of 458±11,K, NGTS-38 b joins a small but growing population of well characterised transiting warm-Jupiters and has one of the longest periods of any discovered to date. The target is situated in the LOPS2 field of the upcoming PLATO mission which will allow for greater refinement of the system parameters and potential for the discovery of additional companions too small and/or too long-period to be seen by TESS or NGTS. NGTS-38 b's bright host star and wide orbital separation make it an attractive target for further study, including potential measurement of its spin-orbit alignment or targeted exomoon/ring searches.",
      "authors": [
        "Toby Rodel",
        "Solène Ulmer-Moll",
        "Samuel Gill",
        "Christopher. A. Watson",
        "Yoshi Nike Emilia Eschen",
        "Alix V. Freckelton",
        "Annelies Mortier",
        "Karen A. Collins",
        "Diana Dragomir",
        "Zahra Essack",
        "Brett Skinner",
        "Niamh Mallaghan",
        "Peter J. Wheatley",
        "David R. Anderson",
        "Ioannis Apergis",
        "Khalid Barkaoui",
        "Matthew P. Battley",
        "Daniel Bayliss",
        "François Bouchy",
        "Edward M. Bryant",
        "Matthew R. Burleigh",
        "Benjamin M. J. Cadell",
        "Samuel J. Carlier",
        "Yann Carteret",
        "Sarah L. Casewell",
        "Alastair B. Claringbold",
        "Jean C. Costes",
        "Benjamin D. R. Davies",
        "Lauren Doyle",
        "Phil Evans",
        "Jorge Fernández Fernández",
        "Emile Fontanet",
        "Edward Gillen",
        "Michael R. Goad",
        "George Harvey",
        "Faith Hawthorn",
        "Katlyn L. Hobbs",
        "Melissa Hobson",
        "Giovanni Isopi",
        "James S. Jenkins",
        "Alicia Kendall",
        "David Kipping",
        "Monika Lendl",
        "Franco Mallia",
        "Christopher Mann",
        "James McCormac",
        "Ernst J. W. de Mooij",
        "Maximiliano Moyano",
        "Arianna Nigioni",
        "Mohammad Odeh",
        "Vera Maria Passegger",
        "Suman Saha",
        "Richard P. Schwarz",
        "Amber Sedgley",
        "Avi Shporer",
        "Abderahmane Soubkiou",
        "Stéphane Udry",
        "Dimitri Veras",
        "Jean. P. Vignes",
        "Steven Villanueva",
        "José I. Vinés",
        "Richard West",
        "Thomas G. Wilson",
        "Hannah L. Worters",
        "Mitchell E. Young",
        "Aldo Zapparata"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-02-13",
      "updated": "2026-02-13",
      "pdf_link": "https://arxiv.org/pdf/2602.12977v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.12977v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 19,
      "summary": "**Why It Matters**\n\nMost planets we've discovered orbiting other stars fall into two categories: scorching hot worlds that race around their stars in days, or distant, cold planets that take years to complete an orbit. But there's a fascinating middle ground—warm planets with moderate orbital periods—that could teach us crucial lessons about how planetary systems form and evolve. These \"warm Jupiters\" might represent a missing link in our understanding of planetary migration, helping explain how giant planets end up in such diverse configurations throughout the galaxy.\n\n**What They Did**\n\nThis discovery began when NASA's planet-hunting telescope TESS spotted a single, mysterious dip in starlight—the signature of a planet crossing in front of its star. But with only one transit observed, astronomers faced a puzzle: when would this planet pass by again? The research team launched an ambitious monitoring campaign using ground-based telescopes, essentially playing cosmic detective. They watched the target star for 228 nights using the Next-Generation Transit Survey, while simultaneously measuring tiny wobbles in the star's motion using specialized instruments that can detect movement as small as a person walking on a distant mountaintop.\n\n**Key Findings**\n\nThe planet, designated NGTS-38 b, is truly remarkable. It's a \"super-Jupiter\"—nearly five times more massive than Jupiter but only slightly larger, making it incredibly dense. The planet takes 180 days to orbit its star (compared to Jupiter's 12 years), placing it in the rare category of warm Jupiters. Its orbit is noticeably oval-shaped rather than circular, and the planet experiences temperatures around 185°C (365°F)—hot enough to melt lead, but relatively cool by exoplanet standards. The host star is metal-rich and bright enough to study in detail from Earth.\n\n**Looking Forward**\n\nNGTS-38 b represents a crucial piece in the planetary formation puzzle. Its unique properties make it an excellent target for future studies that could reveal whether it has moons, rings, or unusual atmospheric compositions. The upcoming PLATO space mission will monitor this system continuously, potentially discovering additional planets and refining our understanding of this intriguing world.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Most planets we've discovered orbiting other stars fall into two categories: scorching hot worlds that race around their stars in days, or distant, cold planets that take years to complete an orbit. But there's a fascinating middle ground—warm planets with moderate orbital periods—that could teach us crucial lessons about how planetary systems form and evolve. These \"warm Jupiters\" might represent a missing link in our understanding of planetary migration, helping explain how giant planets end up in such diverse configurations throughout the galaxy.</p>\n<h4>What They Did</h4>\n<p>This discovery began when NASA's planet-hunting telescope TESS spotted a single, mysterious dip in starlight—the signature of a planet crossing in front of its star. But with only one transit observed, astronomers faced a puzzle: when would this planet pass by again? The research team launched an ambitious monitoring campaign using ground-based telescopes, essentially playing cosmic detective. They watched the target star for 228 nights using the Next-Generation Transit Survey, while simultaneously measuring tiny wobbles in the star's motion using specialized instruments that can detect movement as small as a person walking on a distant mountaintop.</p>\n<h4>Key Findings</h4>\n<p>The planet, designated NGTS-38 b, is truly remarkable. It's a \"super-Jupiter\"—nearly five times more massive than Jupiter but only slightly larger, making it incredibly dense. The planet takes 180 days to orbit its star (compared to Jupiter's 12 years), placing it in the rare category of warm Jupiters. Its orbit is noticeably oval-shaped rather than circular, and the planet experiences temperatures around 185°C (365°F)—hot enough to melt lead, but relatively cool by exoplanet standards. The host star is metal-rich and bright enough to study in detail from Earth.</p>\n<h4>Looking Forward</h4>\n<p>NGTS-38 b represents a crucial piece in the planetary formation puzzle. Its unique properties make it an excellent target for future studies that could reveal whether it has moons, rings, or unusual atmospheric compositions. The upcoming PLATO space mission will monitor this system continuously, potentially discovering additional planets and refining our understanding of this intriguing world.</p>",
      "tweet_hook": {
        "hook": "A giant planet takes 6 months to orbit its star - and we almost missed it! 🪐",
        "claim": "Astronomers discovered a massive super-Jupiter that's 5x heavier than Jupiter, taking 180 days to complete one orbit around a bright nearby star.",
        "evidence": "They caught it from just ONE transit event, then spent 228 nights watching to confirm this rare long-period giant planet.",
        "question": "What other cosmic giants are hiding in plain sight, waiting to be discovered? 🔭"
      },
      "figure_url": "https://arxiv.org/html/2602.12977v1/x1.png"
    },
    {
      "id": "2602.12522v1",
      "title": "A Protoplanet Candidate in the PDS 66 Disk Indicated by Silicon Sulfide Isotopologues",
      "abstract": "Despite observational progress in planet formation, the stage in which planetesimals grow into planets remains poorly understood. During this phase, protoplanets may develop gaseous envelopes that are warmer than the surrounding disk gas, potentially providing observable signatures through molecules otherwise depleted in cold regions. In this Letter, we report the detection of the silicon sulfide isotopologues ²⁸SiS\\ J=16-15 and ³⁰SiS\\ J=18-17 in the protoplanetary disk around PDS 66 (MP Mus) at a significance of 5-6σ, using the Atacama Large Millimeter/submillimeter Array. These constitute the second and first detections of ²⁸SiS and ³⁰SiS in a protoplanetary disk, respectively. The emission appears as a compact source at r eq 60 au in the southwestern region of the disk, unresolved with a 0.\\!\\!′′5 beam, and shows a velocity consistent with Keplerian rotation, suggesting a protoplanetary origin. By modeling the line fluxes, we constrain the emitting radius to 0.5-4 au and estimate an SiS mass of 10²²-10²³ g, corresponding to at least 10\\% of the silicon contained in local dust grains. Because complete sublimation of a substantial fraction of dust grains by local processes is difficult to achieve, this result instead implies an accumulation of silicon from a larger region. We propose that a circumplanetary envelope surrounding a low-mass protoplanet, where pebble accretion and subsequent sublimation of grains may enhance gaseus silicon abundance with respect to observable dust grains around it, can account for the observed characteristics.",
      "authors": [
        "Tomohiro C. Yoshida",
        "Felipe Alarcón",
        "Jaehan Bae",
        "Myriam Benisty",
        "Kiyoaki Doi",
        "Stefano Facchini",
        "Charles J. Law",
        "Hideko Nomura",
        "Laura Perez",
        "Giovanni Rosotti",
        "Yuhito Shibaike",
        "Richard Teague",
        "Takashi Tsukagoshi",
        "Yoshihide Yamato"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "published": "2026-02-13",
      "updated": "2026-02-13",
      "pdf_link": "https://arxiv.org/pdf/2602.12522v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.12522v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 15,
      "summary": "**Why It Matters**\n\nScientists have long wondered how tiny space pebbles grow into massive planets like Jupiter or Earth. While we can observe the building blocks of planets—dust and gas swirling around young stars—catching planets in the act of forming has proven incredibly difficult. It's like trying to photograph a child growing up by taking just one snapshot. This research represents a potential breakthrough: astronomers may have found chemical fingerprints of a planet still under construction, giving us a rare glimpse into one of the universe's most fundamental processes.\n\n**What They Did**\n\nThe research team used the Atacama Large Millimeter/submillimeter Array, a collection of radio telescopes in Chile that can detect molecules in space by their unique chemical signatures. They pointed these telescopes at PDS 66, a young star system located about 370 light-years away, and searched for specific molecules containing silicon and sulfur. Think of it like using a very sensitive nose to detect the aroma of baking bread wafting from a kitchen—except they were \"smelling\" molecules around a distant star to understand what's happening there.\n\n**Key Findings**\n\nThe team detected silicon sulfide molecules in a surprisingly small, hot region about 60 times farther from the star than Earth is from our Sun. What makes this discovery remarkable is the sheer quantity: they found enough silicon to account for at least 10% of all the silicon normally locked up in dust grains in that area. Since dust grains don't typically release this much silicon unless something dramatic happens, the researchers believe they're seeing evidence of a forming planet. This protoplanet would be gobbling up space pebbles and heating them so intensely that they vaporize, releasing their silicon into the surrounding gas.\n\n**Looking Forward**\n\nThis detection opens a new window into planet formation. If confirmed, it demonstrates that we can use molecular chemistry as a tool to find planets still in their cosmic cribs. Future observations could reveal how common this process is and help astronomers understand whether our own solar system formed through similar mechanisms billions of years ago.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Scientists have long wondered how tiny space pebbles grow into massive planets like Jupiter or Earth. While we can observe the building blocks of planets—dust and gas swirling around young stars—catching planets in the act of forming has proven incredibly difficult. It's like trying to photograph a child growing up by taking just one snapshot. This research represents a potential breakthrough: astronomers may have found chemical fingerprints of a planet still under construction, giving us a rare glimpse into one of the universe's most fundamental processes.</p>\n<h4>What They Did</h4>\n<p>The research team used the Atacama Large Millimeter/submillimeter Array, a collection of radio telescopes in Chile that can detect molecules in space by their unique chemical signatures. They pointed these telescopes at PDS 66, a young star system located about 370 light-years away, and searched for specific molecules containing silicon and sulfur. Think of it like using a very sensitive nose to detect the aroma of baking bread wafting from a kitchen—except they were \"smelling\" molecules around a distant star to understand what's happening there.</p>\n<h4>Key Findings</h4>\n<p>The team detected silicon sulfide molecules in a surprisingly small, hot region about 60 times farther from the star than Earth is from our Sun. What makes this discovery remarkable is the sheer quantity: they found enough silicon to account for at least 10% of all the silicon normally locked up in dust grains in that area. Since dust grains don't typically release this much silicon unless something dramatic happens, the researchers believe they're seeing evidence of a forming planet. This protoplanet would be gobbling up space pebbles and heating them so intensely that they vaporize, releasing their silicon into the surrounding gas.</p>\n<h4>Looking Forward</h4>\n<p>This detection opens a new window into planet formation. If confirmed, it demonstrates that we can use molecular chemistry as a tool to find planets still in their cosmic cribs. Future observations could reveal how common this process is and help astronomers understand whether our own solar system formed through similar mechanisms billions of years ago.</p>",
      "tweet_hook": {
        "hook": "🪐 Scientists just spotted a baby planet being born in real time!",
        "claim": "Astronomers detected hot gas signatures around PDS 66 that indicate a protoplanet is actively forming and heating up its surroundings as it grows into a full planet.",
        "evidence": "The smoking gun? Rare silicon sulfide molecules that only survive in warm regions - exactly what you'd expect from a forming planet's hot envelope.",
        "question": "Could we be watching the birth of a world that might one day host life? 🌟"
      },
      "figure_url": "https://arxiv.org/html/2602.12522v1/x1.png"
    },
    {
      "id": "2602.12364v1",
      "title": "TSSC comet-centered data products from TESS 3I/ATLAS observations",
      "abstract": "3I/ATLAS is the third known interstellar object to pass through our Solar System. NASA's Transiting Exoplanet Survey Satellite (TESS) made dedicated observations of 3I/ATLAS between 15 -- 22 January 2026 (Sector 1751), capturing high-cadence observations at 200s and 20s cadence. We present two High Level Science Products (HLSPs): (1) comet-centered image time series, corrected for background scattered light and stars; and (2) aperture light curves extracted from the corrected images. We created these data products using the official TESS products and they are publicly available at the Mikulski Archive for Space Telescopes (MAST). TESS's high-precision, near-continuous photometry will provide unique insights into the comet's activity following its closest approach to the Sun. The TESS Science Support Center (TSSC) has created these data products to facilitate scientific analyses by the TESS and Solar System communities.",
      "authors": [
        "Jorge Martinez-Palomera",
        "Amy Tuson",
        "TESS Science Support Center"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "published": "2026-02-12",
      "updated": "2026-02-12",
      "pdf_link": "https://arxiv.org/pdf/2602.12364v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.12364v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 15,
      "summary": "**Why It Matters**\n\nImagine a cosmic visitor from another star system racing through our solar neighborhood—that's exactly what happened with 3I/ATLAS, only the third interstellar object ever discovered passing through our Solar System. These rare cosmic wanderers offer scientists an extraordinary opportunity to study material that formed around distant stars billions of years ago. Unlike asteroids and comets born in our own solar system, interstellar objects carry secrets from alien worlds, potentially revealing how other planetary systems formed and evolved. By studying 3I/ATLAS, we're essentially getting a free sample delivery from deep space—no expensive interstellar mission required.\n\n**What They Did**\n\nNASA's planet-hunting telescope TESS (Transiting Exoplanet Survey Satellite) turned its powerful eye toward this interstellar visitor during a week-long observation campaign in January 2026. Think of TESS as a cosmic photographer taking pictures every 20 to 200 seconds—incredibly fast for space observations. The research team created two specialized data sets: first, a series of images that track the comet's movement across the sky while filtering out interfering starlight and background noise, and second, measurements of how bright the comet appeared over time. They've made these processed observations freely available to scientists worldwide, essentially creating a detailed photo album and brightness diary of this rare visitor.\n\n**Key Findings**\n\nThis paper primarily presents the observational data rather than scientific discoveries, but the achievement itself is remarkable. TESS captured unprecedented high-precision, nearly continuous observations of 3I/ATLAS just after its closest approach to our Sun—the most active period in any comet's journey when solar heating causes dramatic changes in brightness and activity.\n\n**Looking Forward**\n\nWhile TESS specializes in finding exoplanets, this research demonstrates how planet-hunting tools can unlock secrets about interstellar visitors. These detailed observations will help scientists understand how comets from other star systems behave, potentially revealing differences from our local comets and providing clues about the conditions around distant stars where planets might form.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine a cosmic visitor from another star system racing through our solar neighborhood—that's exactly what happened with 3I/ATLAS, only the third interstellar object ever discovered passing through our Solar System. These rare cosmic wanderers offer scientists an extraordinary opportunity to study material that formed around distant stars billions of years ago. Unlike asteroids and comets born in our own solar system, interstellar objects carry secrets from alien worlds, potentially revealing how other planetary systems formed and evolved. By studying 3I/ATLAS, we're essentially getting a free sample delivery from deep space—no expensive interstellar mission required.</p>\n<h4>What They Did</h4>\n<p>NASA's planet-hunting telescope TESS (Transiting Exoplanet Survey Satellite) turned its powerful eye toward this interstellar visitor during a week-long observation campaign in January 2026. Think of TESS as a cosmic photographer taking pictures every 20 to 200 seconds—incredibly fast for space observations. The research team created two specialized data sets: first, a series of images that track the comet's movement across the sky while filtering out interfering starlight and background noise, and second, measurements of how bright the comet appeared over time. They've made these processed observations freely available to scientists worldwide, essentially creating a detailed photo album and brightness diary of this rare visitor.</p>\n<h4>Key Findings</h4>\n<p>This paper primarily presents the observational data rather than scientific discoveries, but the achievement itself is remarkable. TESS captured unprecedented high-precision, nearly continuous observations of 3I/ATLAS just after its closest approach to our Sun—the most active period in any comet's journey when solar heating causes dramatic changes in brightness and activity.</p>\n<h4>Looking Forward</h4>\n<p>While TESS specializes in finding exoplanets, this research demonstrates how planet-hunting tools can unlock secrets about interstellar visitors. These detailed observations will help scientists understand how comets from other star systems behave, potentially revealing differences from our local comets and providing clues about the conditions around distant stars where planets might form.</p>",
      "tweet_hook": {
        "hook": "🚀 A visitor from another star system just got the most detailed space telescope treatment ever!",
        "claim": "NASA's TESS captured unprecedented high-speed observations of interstellar comet 3I/ATLAS - only the 3rd known object to visit us from beyond our solar system",
        "evidence": "Ultra-precise images taken every 20-200 seconds for a full week, creating the clearest view yet of an interstellar traveler",
        "question": "What secrets might this cosmic wanderer reveal about distant star systems? 🌟"
      },
      "figure_url": "https://arxiv.org/html/2602.12364v1/x1.png"
    },
    {
      "id": "2602.13125v1",
      "title": "TIC65910228b: A single-transit discovery of a massive long-period warm Jupiter with TESS",
      "abstract": "Context. Warm Jupiters are excellent case studies for the investigation of giant planet internal structures and formation theories. However, the sample of long-period transiting giants is still small today for a better understanding of this population. Aims. Starting from a single transit found in the Transiting Exoplanet Survey Satellite (TESS) data, we confirm the planetary nature of the signal and measure its orbital parameters, mass, and radius. We put this system in the context of long-period giant transiting planets and analyzed the viability to sustain atmospheric or dynamical follow-up. Methods. We carried out a spectroscopic follow-up using FEROS and PLATOSpec to obtain precise radial velocities. We added a photometric follow-up with HATPI and Observatoire Moana to obtain a more precise estimate of the orbital period. We derived the orbital and physical parameters through a joint analysis of this data. Results. We report the discovery and characterization of TIC65910228b, a transiting warm Jupiter with a mass of 4.554 ± 0.255 M_J and a radius of 1.088 ± 0.061 R_J, orbiting an evolved F-type star every 180.52 days in an eccentric orbit (e = 0.25 ± 0.04). Conclusions. This planet joins a still under-explored population of long-period (P > 100) massive (Mₚ > 4 M_J) transiting giant planets, being one of the few with a mild eccentricity. This target is a nice example of the potential of single-transit events to populate this region of the parameter space.",
      "authors": [
        "Felipe I. Rojas",
        "Rafael Brahm",
        "Matías I. Jones",
        "Márcio Catelan",
        "Jozef Liptak",
        "Lorena Acuña",
        "Jan Eberhardt",
        "Néstor Espinoza",
        "Thomas Henning",
        "Andrés Jordán",
        "Yared Reinarz",
        "Marcelo Tala Pinto",
        "Trifon Trifonov",
        "Michaela Vítková",
        "Luca Antonucci",
        "Gaspar Bakos",
        "Attila Bódi",
        "Gavin Boyle",
        "Zoltán Csubry",
        "Joel Hartman",
        "Jan Janík",
        "Petr Kabáth",
        "Anthony Keyes",
        "Markus Roth",
        "Petr Škoda",
        "Alton Spencer",
        "Vincent Suc",
        "Geert Jan Talens",
        "Jan Vaclavik",
        "Leonardo Vanzi"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-02-13",
      "updated": "2026-02-13",
      "pdf_link": "https://arxiv.org/pdf/2602.13125v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.13125v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 13,
      "summary": "**Why It Matters**\n\nImagine trying to understand how our solar system formed by studying only Earth and Mars. That's essentially the challenge astronomers face when studying giant planets like Jupiter. Most exoplanets we've discovered orbit extremely close to their stars, completing their \"years\" in just days or weeks. But these scorching hot worlds tell us little about planets like Jupiter, which takes 12 Earth years to complete one orbit. This new discovery helps fill a crucial gap in our understanding of how giant planets form and evolve, particularly those that orbit at moderate distances from their stars—close enough to be warm, but not so close that they're roasted.\n\n**What They Did**\n\nThe team started with a single snapshot of a planet crossing in front of its star, captured by NASA's planet-hunting TESS telescope. Think of it like seeing someone walk past a streetlight just once—you know something passed by, but you need more information to figure out what it was. The researchers then used ground-based telescopes around the world to gather additional clues. They measured how the star wobbled due to the planet's gravitational pull (like a dog walker being tugged by their pet) and watched for additional transits to nail down the planet's orbital period. By combining these different types of observations, they could determine the planet's size, mass, and orbital characteristics.\n\n**Key Findings**\n\nMeet TIC65910228b: a behemoth planet that weighs four and a half times more than Jupiter but is surprisingly compact—only slightly larger than Jupiter in size. This makes it incredibly dense, like a bowling ball compared to a basketball. The planet orbits its star every 180 days (roughly six Earth months) in an oval-shaped path, coming closer and farther from its star during each orbit. It circles an evolved star similar to our Sun but older and slightly more massive.\n\n**Looking Forward**\n\nThis discovery demonstrates that single transit detections—previously considered too uncertain to pursue—can yield significant scientific discoveries. As more of these \"one-shot\" planets are confirmed, astronomers will build a better census of long-period giant planets, helping us understand whether our solar system's architecture is common or unusual in the cosmic neighborhood.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to understand how our solar system formed by studying only Earth and Mars. That's essentially the challenge astronomers face when studying giant planets like Jupiter. Most exoplanets we've discovered orbit extremely close to their stars, completing their \"years\" in just days or weeks. But these scorching hot worlds tell us little about planets like Jupiter, which takes 12 Earth years to complete one orbit. This new discovery helps fill a crucial gap in our understanding of how giant planets form and evolve, particularly those that orbit at moderate distances from their stars—close enough to be warm, but not so close that they're roasted.</p>\n<h4>What They Did</h4>\n<p>The team started with a single snapshot of a planet crossing in front of its star, captured by NASA's planet-hunting TESS telescope. Think of it like seeing someone walk past a streetlight just once—you know something passed by, but you need more information to figure out what it was. The researchers then used ground-based telescopes around the world to gather additional clues. They measured how the star wobbled due to the planet's gravitational pull (like a dog walker being tugged by their pet) and watched for additional transits to nail down the planet's orbital period. By combining these different types of observations, they could determine the planet's size, mass, and orbital characteristics.</p>\n<h4>Key Findings</h4>\n<p>Meet TIC65910228b: a behemoth planet that weighs four and a half times more than Jupiter but is surprisingly compact—only slightly larger than Jupiter in size. This makes it incredibly dense, like a bowling ball compared to a basketball. The planet orbits its star every 180 days (roughly six Earth months) in an oval-shaped path, coming closer and farther from its star during each orbit. It circles an evolved star similar to our Sun but older and slightly more massive.</p>\n<h4>Looking Forward</h4>\n<p>This discovery demonstrates that single transit detections—previously considered too uncertain to pursue—can yield significant scientific discoveries. As more of these \"one-shot\" planets are confirmed, astronomers will build a better census of long-period giant planets, helping us understand whether our solar system's architecture is common or unusual in the cosmic neighborhood.</p>",
      "tweet_hook": {
        "hook": "🪐 Scientists just caught a giant planet playing hide-and-seek with Earth!",
        "claim": "Astronomers discovered a massive 'warm Jupiter' from just ONE glimpse as it crossed in front of its star - like spotting a rare bird that only shows up once every few years",
        "evidence": "The planet TIC65910228b is so far from its star that it takes years to complete one orbit, making single-transit detections extremely rare",
        "question": "What other cosmic giants are hiding in plain sight, waiting for their moment to shine?"
      },
      "figure_url": "https://arxiv.org/html/2602.13125v1/figs/tessgaia.png"
    },
    {
      "id": "2602.12307v1",
      "title": "GAMERA-OP: A three-dimensional finite-volume MHD solver for orthogonal curvilinear geometries",
      "abstract": "We present GAMERA-OP (Orthogonal-Plus), a three-dimensional finite-volume magnetohydrodynamics (MHD) solver for orthogonal curvilinear geometries. The solver advances magnetic fields using constrained transport to preserve \\!\\!B=0 to machine precision and employs geometry-consistent high-order reconstruction with an enhanced Partial Donor Cell method (e-PDM) that accounts for geometry curvature. Flexible numerics include various numerical fluxes and time integrators. In axial symmetric coordinates, angular momentum are preserved to round-off, and a ring-averaging treatment near the axis relaxes CFL constraints while maintaining divergence-free magnetic fields. Optional capabilities include the semi-relativistic (Boris) correction, background-field splitting, and an anisotropic MHD formulation. Rewritten in C, the code adopts a modular design that simplifies case setup and facilitates the addition of physics modules and coupling to other first-principles codes. Standard benchmarks across multiple geometries verify the code's high accuracy, low numerical diffusion, and robust handling of coordinate singularities and rotating flows. GAMERA-OP provides a practical, high-order framework for space and astrophysical plasma applications where orthogonal curvilinear coordinates and exact angular-momentum conservation are advantageous.",
      "authors": [
        "Hongyang Luo",
        "Binzheng Zhang",
        "Jiaxing Tian",
        "Jinshu Cai",
        "Junjie Chen",
        "Enhao Feng",
        "Zhiqi Zheng",
        "Sheng Xi",
        "John G. Lyon"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-02-12",
      "updated": "2026-02-12",
      "pdf_link": "https://arxiv.org/pdf/2602.12307v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.12307v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 10,
      "summary": "**Why It Matters**\n\nImagine trying to understand how planets form around distant stars, or how the magnetic fields around these worlds behave—it's like trying to predict weather patterns in a hurricane while sitting thousands of miles away. Scientists studying exoplanets (planets orbiting other stars) face exactly this challenge. They need powerful computer simulations to model the complex magnetic and fluid dynamics happening around these distant worlds. This research introduces a new computational tool that could revolutionize how we study the magnetic environments of exoplanets, potentially helping us understand which worlds might be habitable.\n\n**What They Did**\n\nThe researchers built a sophisticated computer program called GAMERA-OP—think of it as a virtual laboratory for studying plasma (super-hot, electrically charged gas) in space. Just as video games need powerful graphics engines to render realistic 3D worlds, scientists need specialized software to simulate the invisible magnetic fields and swirling gases around planets and stars. Their program is like upgrading from basic 2D drawings to high-definition 3D movies. It can handle curved coordinate systems (imagine mapping weather on a sphere rather than a flat surface) and maintains mathematical precision that previous tools struggled with. The team rewrote the entire program in a more efficient computer language and designed it like LEGO blocks—modular pieces that can be easily combined or modified for different research questions.\n\n**Key Findings**\n\nThe new tool passed all standard accuracy tests while using significantly less computational power than previous methods. It maintains perfect mathematical precision for magnetic field calculations—something that sounds technical but is crucial for realistic simulations. The program excels at handling rotating systems and complex geometries, making it particularly valuable for studying spinning planets and their magnetic fields.\n\n**Looking Forward**\n\nThis advancement could accelerate discoveries about exoplanet atmospheres and magnetic shields—factors that determine whether distant worlds could potentially support life. Better simulations mean better predictions about which exoplanets deserve closer study with future space telescopes.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to understand how planets form around distant stars, or how the magnetic fields around these worlds behave—it's like trying to predict weather patterns in a hurricane while sitting thousands of miles away. Scientists studying exoplanets (planets orbiting other stars) face exactly this challenge. They need powerful computer simulations to model the complex magnetic and fluid dynamics happening around these distant worlds. This research introduces a new computational tool that could revolutionize how we study the magnetic environments of exoplanets, potentially helping us understand which worlds might be habitable.</p>\n<h4>What They Did</h4>\n<p>The researchers built a sophisticated computer program called GAMERA-OP—think of it as a virtual laboratory for studying plasma (super-hot, electrically charged gas) in space. Just as video games need powerful graphics engines to render realistic 3D worlds, scientists need specialized software to simulate the invisible magnetic fields and swirling gases around planets and stars. Their program is like upgrading from basic 2D drawings to high-definition 3D movies. It can handle curved coordinate systems (imagine mapping weather on a sphere rather than a flat surface) and maintains mathematical precision that previous tools struggled with. The team rewrote the entire program in a more efficient computer language and designed it like LEGO blocks—modular pieces that can be easily combined or modified for different research questions.</p>\n<h4>Key Findings</h4>\n<p>The new tool passed all standard accuracy tests while using significantly less computational power than previous methods. It maintains perfect mathematical precision for magnetic field calculations—something that sounds technical but is crucial for realistic simulations. The program excels at handling rotating systems and complex geometries, making it particularly valuable for studying spinning planets and their magnetic fields.</p>\n<h4>Looking Forward</h4>\n<p>This advancement could accelerate discoveries about exoplanet atmospheres and magnetic shields—factors that determine whether distant worlds could potentially support life. Better simulations mean better predictions about which exoplanets deserve closer study with future space telescopes.</p>",
      "tweet_hook": {
        "hook": "🌌 Scientists just built a virtual universe simulator that's changing everything we know about space",
        "claim": "New 3D computer model can simulate magnetic fields in space with perfect precision - no errors, even at the smallest computational level",
        "evidence": "Uses advanced math to preserve magnetic field laws (∇·B=0) to 'machine precision' - the most accurate possible",
        "question": "What cosmic mysteries could we solve with a perfect space simulator? 🚀"
      },
      "figure_url": "https://arxiv.org/html/2602.12307v1/fig1.png"
    },
    {
      "id": "2602.12303v1",
      "title": "Astrophysics Wrapped 2025: Year-in-Review of Every Astrophysics arXiv Paper from 2025",
      "abstract": "Over the past few years, Astrophysics has experienced an unprecedented increase in research output, as is evident from the year-over-year increase in the number of research papers put onto the arXiv. As a result, keeping up with progress happening outside our respective sub-fields can be exhausting. While it is impossible to be informed on every single aspect of every sub-field, this paper aims to be the next best thing. We present a summary of statistics for every paper uploaded onto the Astrophysics arXiv over the past year - 2025. We analyse a host of metadata ranging from simple metrics like the number of pages and the most used keywords, as well as deeper, more interesting statistics like the distribution of journals to which papers are submitted, the most used telescopes, the most studied astrophysical objects including GW, GRB, FRB events, exoplanets and much more. We also indexed the authors' affiliations to put into context the global distribution of research and collaboration. Combining this data with the citation information of each paper allows us to understand how influential different papers have been on the progress of the field this year. Overall, these statistics highlight the general current state of the field, the hot topics people are working on and the different research communities across the globe and how they function. We also delve into the costs involved in publications and what it means for the community. We hope that this is helpful for both students and professionals alike to adapt their current trajectories to better benefit the field.",
      "authors": [
        "Rommulus Francis Lewis",
        "Hetansh Shah",
        "Amruth Alfred"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "published": "2026-02-11",
      "updated": "2026-02-11",
      "pdf_link": "https://arxiv.org/pdf/2602.12303v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.12303v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\n\nImagine trying to keep up with every conversation happening at a massive scientific conference with thousands of researchers all talking at once. That's essentially what's happening in astronomy today—so many discoveries are being made that even professional astronomers struggle to stay informed about breakthroughs outside their specialty. This research tackles that overwhelming flood of information by creating the ultimate \"year in review\" for space science, analyzing every single astronomy paper published in 2025. For anyone curious about where we stand in our quest to understand the universe, this study reveals which cosmic mysteries are capturing scientists' attention most and how our knowledge is expanding.\n\n**What They Did**\n\nThe researchers acted like cosmic librarians, systematically cataloging and analyzing thousands of astronomy research papers from 2025. Instead of reading every paper word-for-word—which would take lifetimes—they examined the \"metadata,\" or basic information about each study: how many pages long they were, which keywords appeared most frequently, what telescopes were used, and which cosmic objects were studied most. They also tracked where the researchers worked around the globe and how often their papers were cited by other scientists, creating a comprehensive snapshot of the entire field's activity over one year.\n\n**Key Findings**\n\nThe study revealed fascinating patterns in modern astronomy research. Certain \"hot topics\" dominated the field, with exoplanets, gravitational waves, gamma-ray bursts, and fast radio bursts capturing significant attention. The research mapped out which telescopes were workhorses of discovery and identified the most-studied cosmic objects. They also uncovered the global nature of modern astronomy, showing how researchers from different continents collaborate and which institutions are leading various types of research.\n\n**Looking Forward**\n\nThis bird's-eye view of astronomy helps both students and seasoned researchers navigate the field more strategically. For exoplanet science specifically, understanding these broader trends means researchers can identify emerging techniques, popular targets for study, and collaboration opportunities that might accelerate the discovery of potentially habitable worlds beyond our solar system.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to keep up with every conversation happening at a massive scientific conference with thousands of researchers all talking at once. That's essentially what's happening in astronomy today—so many discoveries are being made that even professional astronomers struggle to stay informed about breakthroughs outside their specialty. This research tackles that overwhelming flood of information by creating the ultimate \"year in review\" for space science, analyzing every single astronomy paper published in 2025. For anyone curious about where we stand in our quest to understand the universe, this study reveals which cosmic mysteries are capturing scientists' attention most and how our knowledge is expanding.</p>\n<h4>What They Did</h4>\n<p>The researchers acted like cosmic librarians, systematically cataloging and analyzing thousands of astronomy research papers from 2025. Instead of reading every paper word-for-word—which would take lifetimes—they examined the \"metadata,\" or basic information about each study: how many pages long they were, which keywords appeared most frequently, what telescopes were used, and which cosmic objects were studied most. They also tracked where the researchers worked around the globe and how often their papers were cited by other scientists, creating a comprehensive snapshot of the entire field's activity over one year.</p>\n<h4>Key Findings</h4>\n<p>The study revealed fascinating patterns in modern astronomy research. Certain \"hot topics\" dominated the field, with exoplanets, gravitational waves, gamma-ray bursts, and fast radio bursts capturing significant attention. The research mapped out which telescopes were workhorses of discovery and identified the most-studied cosmic objects. They also uncovered the global nature of modern astronomy, showing how researchers from different continents collaborate and which institutions are leading various types of research.</p>\n<h4>Looking Forward</h4>\n<p>This bird's-eye view of astronomy helps both students and seasoned researchers navigate the field more strategically. For exoplanet science specifically, understanding these broader trends means researchers can identify emerging techniques, popular targets for study, and collaboration opportunities that might accelerate the discovery of potentially habitable worlds beyond our solar system.</p>",
      "tweet_hook": {
        "hook": "Astrophysics is exploding—and we literally analyzed EVERY paper published in 2025 🚀",
        "claim": "Researchers tracked every single astrophysics paper uploaded to arXiv in 2025, revealing unprecedented growth in space science research that's impossible for experts to keep up with",
        "evidence": "The flood of new discoveries is so overwhelming that even specialists can't stay current outside their own narrow research areas",
        "question": "What cosmic breakthroughs are you missing while scientists struggle to keep up?"
      },
      "figure_url": "https://arxiv.org/html/2602.12303v1/x1.png"
    }
  ]
}