{
  "announcement_date": "2026-02-13",
  "updated_at": "2026-02-13T04:16:47.234706+00:00",
  "category": "astro-ph.EP",
  "paper_count": 5,
  "papers": [
    {
      "id": "2602.11923v1",
      "title": "The Radius Cliff is a Waterfall: Explaining Sub-Neptune Exoplanets with Steam Worlds",
      "abstract": "The demographics of Kepler planets provide a key testbed for models of planet formation and evolution, particularly for explaining the radius valley separating super-Earths and sub-Neptunes. A primordial interpretation based on differences in bulk densities -- where rocky and water-rich planets form via migration pathways -- offers an alternative to atmospheric loss scenarios. Updated interior structure models of water worlds with adiabatic steam atmospheres reproduce the observed valley near 2 R_⊕ more accurately. Furthermore, migration models from our Genesis library suggest that these formation pathways can also account for the distinct period distributions of super-Earths and sub-Neptunes, as well as the emergence of the hot Neptune desert. Motivated by this, we develop a Bayesian hierarchical mixture model for close-in Kepler planets (P<100 days), combining rocky planets and water worlds without H/He envelopes. The inferred mass distributions of rocky and water-rich planets peak at 2.6 M_⊕ and 7 M_⊕, respectively, with the water mass fraction of water worlds peaking at 41\\%. Water worlds provide a good representation of the Kepler sub-Neptune population, with the radius cliff emerging as a ``waterfall\" -- a sharp decline in their occurrence. However, our mass-radius analysis shows that water worlds alone cannot explain planets with R 3 R_⊕, implying that at least 20\\% of sub-Neptunes in the sample are enriched in H/He gas.",
      "authors": [
        "Aritra Chakrabarty",
        "Gijs D. Mulders",
        "Artyom Aguichine",
        "Natalie Batalha"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-02-12",
      "updated": "2026-02-12",
      "pdf_link": "https://arxiv.org/pdf/2602.11923v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.11923v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 30,
      "summary": "# Scientists Discover \"Steam Worlds\" May Explain Missing Link in Planetary Evolution\n\n**Why It Matters**\n\nFor years, astronomers have puzzled over a mysterious gap in the sizes of planets beyond our solar system. While we find plenty of small, rocky \"super-Earths\" and larger \"sub-Neptunes\" with thick atmospheres, there's a conspicuous shortage of planets in between—roughly twice Earth's size. Understanding this \"radius valley\" is crucial because it reveals how planets form and evolve, helping us piece together the story of planetary systems throughout the galaxy. This research suggests we may have been looking at the problem all wrong.\n\n**What They Did**\n\nThe researchers analyzed data from NASA's Kepler Space Telescope, which discovered thousands of exoplanets by watching them cross in front of their stars. Instead of assuming this size gap resulted from planets losing their atmospheres over time, the team explored whether different types of planets—rocky worlds versus water-rich \"steam worlds\"—could naturally create this pattern. They built computer models of planets made largely of water, with steamy atmospheres created by their own heated surfaces, and compared these to the actual planets Kepler discovered.\n\n**Key Findings**\n\nThe models revealed that water worlds with steam atmospheres can perfectly reproduce the observed size gap around twice Earth's radius. These steam worlds appear to make up a significant portion of sub-Neptune planets, with water comprising about 41% of their mass on average. The research suggests the \"radius cliff\" is actually more like a \"waterfall\"—a sharp drop-off where steam worlds become much rarer. However, the largest sub-Neptunes (over three times Earth's radius) still need traditional hydrogen and helium atmospheres to explain their size.\n\n**Looking Forward**\n\nThis discovery fundamentally reshapes our understanding of planetary diversity. Rather than viewing the size gap as planets losing atmospheres, we may be seeing two distinct families of worlds that formed differently from the start. This could help astronomers better predict what types of planets exist around other stars and refine our search for potentially habitable worlds.",
      "summary_html": "<p># Scientists Discover \"Steam Worlds\" May Explain Missing Link in Planetary Evolution</p>\n<h4>Why It Matters</h4>\n<p>For years, astronomers have puzzled over a mysterious gap in the sizes of planets beyond our solar system. While we find plenty of small, rocky \"super-Earths\" and larger \"sub-Neptunes\" with thick atmospheres, there's a conspicuous shortage of planets in between—roughly twice Earth's size. Understanding this \"radius valley\" is crucial because it reveals how planets form and evolve, helping us piece together the story of planetary systems throughout the galaxy. This research suggests we may have been looking at the problem all wrong.</p>\n<h4>What They Did</h4>\n<p>The researchers analyzed data from NASA's Kepler Space Telescope, which discovered thousands of exoplanets by watching them cross in front of their stars. Instead of assuming this size gap resulted from planets losing their atmospheres over time, the team explored whether different types of planets—rocky worlds versus water-rich \"steam worlds\"—could naturally create this pattern. They built computer models of planets made largely of water, with steamy atmospheres created by their own heated surfaces, and compared these to the actual planets Kepler discovered.</p>\n<h4>Key Findings</h4>\n<p>The models revealed that water worlds with steam atmospheres can perfectly reproduce the observed size gap around twice Earth's radius. These steam worlds appear to make up a significant portion of sub-Neptune planets, with water comprising about 41% of their mass on average. The research suggests the \"radius cliff\" is actually more like a \"waterfall\"—a sharp drop-off where steam worlds become much rarer. However, the largest sub-Neptunes (over three times Earth's radius) still need traditional hydrogen and helium atmospheres to explain their size.</p>\n<h4>Looking Forward</h4>\n<p>This discovery fundamentally reshapes our understanding of planetary diversity. Rather than viewing the size gap as planets losing atmospheres, we may be seeing two distinct families of worlds that formed differently from the start. This could help astronomers better predict what types of planets exist around other stars and refine our search for potentially habitable worlds.</p>",
      "tweet_hook": {
        "hook": "🌍 Scientists just solved a cosmic mystery that's been puzzling astronomers for years!",
        "claim": "Planets between Earth and Neptune sizes aren't missing - they're 'steam worlds' with water so hot it creates massive atmospheres that puff them up like cosmic balloons.",
        "evidence": "New models show water-rich planets can perfectly explain the mysterious 2 Earth-radius 'valley' in planet sizes discovered by Kepler.",
        "question": "Could some of our nearest planetary neighbors be giant steam-powered worlds? 🔥💨"
      },
      "figure_url": "https://arxiv.org/html/2602.11923v1/mr_models.jpg"
    },
    {
      "id": "2602.11818v1",
      "title": "Global magnetohydrodynamic simulations of the inner regions of protoplanetary discs. II. Vertical-net-flux regime",
      "abstract": "The inner regions of protoplanetary discs, which encompass the putative habitable zone, are dynamically complex, featuring a relatively well-ionised, turbulent active zone located interior to a poorly ionised 'dead' zone. In this second paper, we investigate a model of the magnetohydrodynamic processes around the interface between these two regions, using five three-dimensional global magnetohydrodynamic simulations of discs threaded by a large-scale poloidal-net-flux magnetic field. We employ physically motivated profiles for Ohmic resistivity and ambipolar diffusion, alongside a simplified thermodynamic model comprising a cool disc and hot corona. Our results show that, first, the interface acts as a one-way barrier to inward transport of large-scale magnetic flux from the dead zone. This leads to magnetic flux depletion throughout most of the active zone, whereby it either advects inwards to the inner numerical boundary or accumulates just inside the interface. Second, two sources of strong variability emerge from the interface due to the difficulty of maintaining a constant, vertically integrated electrical current across distinct and evolving magnetic-field states. Third, despite the weak magnetothermal wind in the dead zone, a pressure maximum forms at the interface, leading to Rossby-wave-induced vortices. Fourth, unlike the model of Iwasaki et. al (2024), there is no 'transition zone' devoid of magnetic flux and magnetic winds. Instead, multiple outflow zones span all disc radii reflecting the radially varying launch conditions, with an inner turbulent wind impinging upon an outer, more laminar one. Fifth, a heated corona prevents the 'puffing up' of poloidal-net-flux, active disc regions.",
      "authors": [
        "Matthew J. O. Roberts",
        "Henrik N. Latter",
        "Geoffroy Lesur"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-02-12",
      "updated": "2026-02-12",
      "pdf_link": "https://arxiv.org/pdf/2602.11818v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.11818v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 25,
      "summary": "# Scientists Reveal How Baby Solar Systems Shape the Worlds Where Life Might Emerge\n\n**Why It Matters**\n\nWhen stars are born, they're surrounded by spinning disks of gas and dust—the cosmic nurseries where planets form. The inner parts of these disks, roughly where Earth sits in our solar system, are where rocky planets like ours could potentially harbor life. But these regions are incredibly chaotic, with powerful magnetic forces and swirling material creating conditions that directly influence what kinds of worlds emerge. Understanding these early environments helps us predict where habitable planets might form around other stars and what they might look like when they do.\n\n**What They Did**\n\nResearchers created detailed computer simulations of these planet-forming disks, focusing on the boundary between two very different zones. Think of it like the edge between a stormy ocean and calm waters—one region is turbulent and electrically active (like a thunderstorm), while the other is quiet and electrically \"dead.\" The scientists ran five separate simulations, each tracking how magnetic fields, gas flows, and electrical currents behave across this boundary over time. They included realistic physics for how electricity flows through the disk and how heat moves between the cool disk and the hot atmosphere above it.\n\n**Key Findings**\n\nThe simulations revealed that this boundary acts like a one-way gate, trapping magnetic field lines and preventing them from moving inward. This creates a magnetic traffic jam that leads to dramatic variability—imagine electrical currents trying to flow smoothly across two completely different environments. Surprisingly, the researchers found continuous outflows of material (stellar winds) across the entire disk, rather than distinct zones. They also discovered that vortices form at the boundary, similar to atmospheric storms, which could influence how planets form and migrate.\n\n**Looking Forward**\n\nThese findings reshape our understanding of where and how Earth-like planets form. The magnetic barriers and variable conditions in these regions could determine whether forming planets develop protective magnetic fields and retain their atmospheres—crucial factors for habitability. This research provides a more accurate foundation for predicting which of the thousands of known exoplanets might truly be capable of supporting life.",
      "summary_html": "<p># Scientists Reveal How Baby Solar Systems Shape the Worlds Where Life Might Emerge</p>\n<h4>Why It Matters</h4>\n<p>When stars are born, they're surrounded by spinning disks of gas and dust—the cosmic nurseries where planets form. The inner parts of these disks, roughly where Earth sits in our solar system, are where rocky planets like ours could potentially harbor life. But these regions are incredibly chaotic, with powerful magnetic forces and swirling material creating conditions that directly influence what kinds of worlds emerge. Understanding these early environments helps us predict where habitable planets might form around other stars and what they might look like when they do.</p>\n<h4>What They Did</h4>\n<p>Researchers created detailed computer simulations of these planet-forming disks, focusing on the boundary between two very different zones. Think of it like the edge between a stormy ocean and calm waters—one region is turbulent and electrically active (like a thunderstorm), while the other is quiet and electrically \"dead.\" The scientists ran five separate simulations, each tracking how magnetic fields, gas flows, and electrical currents behave across this boundary over time. They included realistic physics for how electricity flows through the disk and how heat moves between the cool disk and the hot atmosphere above it.</p>\n<h4>Key Findings</h4>\n<p>The simulations revealed that this boundary acts like a one-way gate, trapping magnetic field lines and preventing them from moving inward. This creates a magnetic traffic jam that leads to dramatic variability—imagine electrical currents trying to flow smoothly across two completely different environments. Surprisingly, the researchers found continuous outflows of material (stellar winds) across the entire disk, rather than distinct zones. They also discovered that vortices form at the boundary, similar to atmospheric storms, which could influence how planets form and migrate.</p>\n<h4>Looking Forward</h4>\n<p>These findings reshape our understanding of where and how Earth-like planets form. The magnetic barriers and variable conditions in these regions could determine whether forming planets develop protective magnetic fields and retain their atmospheres—crucial factors for habitability. This research provides a more accurate foundation for predicting which of the thousands of known exoplanets might truly be capable of supporting life.</p>",
      "tweet_hook": {
        "hook": "The birthplace of planets has 'dead zones' that could determine where life can exist 🌍",
        "claim": "Scientists used 5 supercomputer simulations to map how magnetic fields create turbulent 'active zones' and calm 'dead zones' in planet-forming discs around young stars",
        "evidence": "These zones form right where habitable planets like Earth would develop, potentially controlling their formation",
        "question": "Could magnetic 'dead zones' be why some solar systems have no Earth-like worlds? 🤔"
      },
      "figure_url": "https://arxiv.org/html/2602.11818v1/figures/non_ideal_setup/fig1_left.png"
    },
    {
      "id": "2602.12201v1",
      "title": "Oxygen left behind: Atmospheric Enrichment due to Fractionation in Sub-Neptunes using BOREAS",
      "abstract": "The evolution of exoplanetary atmospheres is strongly influenced by atmospheric escape, particularly for close-in planets. Fractionation during atmospheric loss can preferentially remove lighter elements such as hydrogen, while retaining heavier species like oxygen. In this study, we investigate how and under what conditions hydrodynamic escape and chemical fractionation jointly shape the mass and composition of exoplanet atmospheres, especially for mixed H2 + H2O atmospheres. We develop BOREAS, a self-consistent mass loss model coupling a 1D Parker wind formulation with a mass-dependent fractionation scheme, which we apply across a range of planet masses, radii, equilibrium temperatures, and incident XUV fluxes, allowing us to track hydrogen and oxygen escape rates at different snapshots in time. We find that oxygen is efficiently retained over most of the parameter space. Significant oxygen loss occurs under high incident XUV fluxes, while at intermediate fluxes oxygen loss is largely confined to low-gravity planets. Where oxygen is retained, irradiation is too weak to drive significant escape of hydrogen and thus limiting atmospheric enrichment. By contrast, our model predicts that sub-Neptunes undergo substantial atmospheric enrichment over approx. 200 Myr when hydrogen escape is efficient and accompanied by partial oxygen entrainment. Notably, our results imply that sub-Neptunes near the radius valley can evolve into water-rich planets, in agreement with GJ 9827 d. Present-day water-rich atmospheres may have originated from water-poor envelopes under some conditions, highlighting the need to include chemical fractionation in evolution models. BOREAS is publicly available.",
      "authors": [
        "Marilina Valatsou",
        "Caroline Dorn",
        "Pierlou Marty",
        "James E. Owen"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "published": "2026-02-12",
      "updated": "2026-02-12",
      "pdf_link": "https://arxiv.org/pdf/2602.12201v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.12201v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 23,
      "summary": "**Why It Matters**\n\nImagine if Earth's atmosphere could completely transform over millions of years, turning from one type of air into something entirely different. That's exactly what's happening to planets beyond our solar system. Scientists have discovered that many Earth-sized and Neptune-sized planets are literally losing their atmospheres to space—but not all gases escape equally. This selective loss could be creating worlds with dramatically different compositions than when they first formed, potentially leading to planets rich in water vapor where none existed before. Understanding this process helps us figure out which distant worlds might be habitable and reveals how planetary atmospheres evolve over cosmic time.\n\n**What They Did**\n\nThe research team built a sophisticated computer model called BOREAS to simulate how planets lose their atmospheres. Think of it like modeling how a pot of soup boils away—but instead of just water evaporating, different ingredients escape at different rates. Their model tracks two key components: hydrogen (the lightest element) and oxygen (much heavier). They tested this simulation across hundreds of different planetary scenarios, varying factors like planet size, distance from the host star, and how much high-energy radiation the planet receives. By running these virtual experiments, they could watch how atmospheric composition changes over millions of years.\n\n**Key Findings**\n\nThe results reveal a cosmic sorting process: hydrogen escapes to space much more easily than oxygen, leaving planets with increasingly oxygen-rich atmospheres over time. Planets can become substantially enriched in heavier gases within about 200 million years—a blink of an eye in cosmic terms. However, this process only works under specific conditions. Too much stellar radiation strips away everything, while too little fails to drive significant atmospheric loss. The sweet spot creates planets that could end up with water-rich atmospheres, even if they started water-poor.\n\n**Looking Forward**\n\nThis research suggests that many planets we observe today may be atmospheric shape-shifters, bearing little resemblance to their original compositions. Some sub-Neptune planets near Earth's size might have evolved into water worlds, offering new targets in our search for potentially habitable environments beyond our solar system.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine if Earth's atmosphere could completely transform over millions of years, turning from one type of air into something entirely different. That's exactly what's happening to planets beyond our solar system. Scientists have discovered that many Earth-sized and Neptune-sized planets are literally losing their atmospheres to space—but not all gases escape equally. This selective loss could be creating worlds with dramatically different compositions than when they first formed, potentially leading to planets rich in water vapor where none existed before. Understanding this process helps us figure out which distant worlds might be habitable and reveals how planetary atmospheres evolve over cosmic time.</p>\n<h4>What They Did</h4>\n<p>The research team built a sophisticated computer model called BOREAS to simulate how planets lose their atmospheres. Think of it like modeling how a pot of soup boils away—but instead of just water evaporating, different ingredients escape at different rates. Their model tracks two key components: hydrogen (the lightest element) and oxygen (much heavier). They tested this simulation across hundreds of different planetary scenarios, varying factors like planet size, distance from the host star, and how much high-energy radiation the planet receives. By running these virtual experiments, they could watch how atmospheric composition changes over millions of years.</p>\n<h4>Key Findings</h4>\n<p>The results reveal a cosmic sorting process: hydrogen escapes to space much more easily than oxygen, leaving planets with increasingly oxygen-rich atmospheres over time. Planets can become substantially enriched in heavier gases within about 200 million years—a blink of an eye in cosmic terms. However, this process only works under specific conditions. Too much stellar radiation strips away everything, while too little fails to drive significant atmospheric loss. The sweet spot creates planets that could end up with water-rich atmospheres, even if they started water-poor.</p>\n<h4>Looking Forward</h4>\n<p>This research suggests that many planets we observe today may be atmospheric shape-shifters, bearing little resemblance to their original compositions. Some sub-Neptune planets near Earth's size might have evolved into water worlds, offering new targets in our search for potentially habitable environments beyond our solar system.</p>",
      "tweet_hook": {
        "hook": "Some exoplanets are literally bleeding hydrogen into space while hoarding oxygen 🌍💨",
        "claim": "Scientists discovered that sub-Neptune planets can lose their lighter hydrogen atmospheres through escape, leaving behind oxygen-enriched air that's totally different from what they started with",
        "evidence": "New simulations show how 'atmospheric fractionation' acts like a cosmic filter, separating light and heavy elements as planets lose their air",
        "question": "Could this process create breathable atmospheres on distant worlds?"
      },
      "figure_url": "https://arxiv.org/html/2602.12201v1/fig01_LXUV_evolution.png"
    },
    {
      "id": "2602.11271v1",
      "title": "Gas-depleted planet formation occurred in the four-planet system around the red dwarf LHS 1903",
      "abstract": "Small exoplanet radii show two populations, referred to as super-Earths and sub-Neptunes, separated by a gap known as the radius valley. This may be produced by the removal of atmospheres due to stellar or internal heating, or lack of an initial envelope. We us transit photometry and radial velocity measurements to detect and characterize four planets orbiting LHS 1903, a red dwarf (M-dwarf) star in the Milky Way's thick disk. The planets have orbital periods between 2.2 and 29.3 days, and span the radius valley within a single planetary system. The derived densities indicate that LHS 1903 b is rocky, while LHS 1903 c and LHS 1903 d have extended atmospheres. Although the most distant planet from the host star, LHS 1903 e, has no gaseous envelope, indicating it formed from gas-depleted material.",
      "authors": [
        "Thomas G. Wilson",
        "Anna M. Simpson",
        "Andrew Collier Cameron",
        "Ryan Cloutier",
        "Vardan Adibekyan",
        "Ancy Anna John",
        "Yann Alibert",
        "Manu Stalport",
        "Jo Ann Egger",
        "Andrea Bonfanti",
        "Nicolas Billot",
        "Pascal Guterman",
        "Pierre F. L. Maxted",
        "Attila E. Simon",
        "Sergio G. Sousa",
        "Malcolm Fridlund",
        "Mathias Beck",
        "Anja Bekkelien",
        "Sebastien Salmon",
        "Valerie Van Grootel",
        "Luca Fossati",
        "Alexander James Mustill",
        "Hugh P. Osborn",
        "Tiziano Zingales",
        "Matthew J. Hooton",
        "Laura Affer",
        "Suzanne Aigrain",
        "Roi Alonso",
        "Guillem Anglada",
        "Alexandros Antoniadis-Karnavas",
        "Tamas Barczy",
        "David Barrado Navascues",
        "Susana C. C. Barros",
        "Wolfgang Baumjohann",
        "Thomas Beck",
        "Willy Benz",
        "Federico Biondi",
        "Xavier Bonfils",
        "Luca Borsato",
        "Alexis Brandeker",
        "Christopher Broeg",
        "Lars A. Buchhave",
        "Maximilian Buder",
        "Juan Cabrera",
        "Sebastian Carrazco Gaxiola",
        "David Charbonneau",
        "Sebastien Charnoz",
        "David R. Ciardi",
        "Karen A. Collins",
        "Kevin I. Collins",
        "Rosario Cosentino",
        "Szilard Csizmadia",
        "Patricio E. Cubillos",
        "Shweta Dalal",
        "Mario Damasso",
        "James R. A. Davenport",
        "Melvyn B. Davies",
        "Magali Deleuil",
        "Laetitia Delrez",
        "Olivier D. S. Demangeon",
        "Brice-Olivier Demory",
        "Victoria DiTomasso",
        "Diana Dragomir",
        "Courtney D. Dressing",
        "Xavier Dumusque",
        "David Ehrenreich",
        "Anders Erikson",
        "Emma Esparza-Borges",
        "Andrea Fortier",
        "Izuru Fukuda",
        "Akihiko Fukui",
        "Davide Gandolfi",
        "Adriano Ghedina",
        "Steven Giacalone",
        "Holden Gill",
        "Michael Gillon",
        "Yilen Gomez Maqueo Chew",
        "Manuel Gudel",
        "Pere Guerra",
        "Maximilian N. Gunther",
        "Nathan Hara",
        "Avet Harutyunyan",
        "Yuya Hayashi",
        "Raphaelle D. Haywood",
        "Rae Holcomb",
        "Keith Horne",
        "Sergio Hoyer",
        "Chelsea X. Huang",
        "Masahiro Ikoma",
        "Kate G. Isaak",
        "James A. G. Jackman",
        "Jon M. Jenkins",
        "Eric L. N. Jensen",
        "Daniel Jontof-Hutter",
        "Yugo Kawai",
        "Laszlo L. Kiss",
        "Ben S. Lakeland",
        "Jacques Laskar",
        "David W. Latham",
        "Alain Lecavelier des Etangs",
        "Adrien Leleu",
        "Monika Lendl",
        "Jerome de Leon",
        "Florian Lienhard",
        "Mercedes Lopez-Morales",
        "Christophe Lovis",
        "Michael B. Lund",
        "Rafael Luque",
        "Demetrio Magrin",
        "Luca Malavolta",
        "Aldo F. Martınez Fiorenzano",
        "Andrew W. Mayo",
        "Michel Mayor",
        "Christoph Mordasini",
        "Annelies Mortier",
        "Felipe Murgas",
        "Norio Narita",
        "Valerio Nascimbeni",
        "Belinda A. Nicholson",
        "Goran Olofsson",
        "Roland Ottensamer",
        "Isabella Pagano",
        "Larissa Palethorpe",
        "Enric Palle",
        "Hannu Parviainen",
        "Marco Pedani",
        "Francesco A. Pepe",
        "Gisbert Peter",
        "Matteo Pinamonti",
        "Giampaolo Piotto",
        "Don Pollacco",
        "Ennio Poretti",
        "Didier Queloz",
        "Samuel N. Quinn",
        "Roberto Ragazzoni",
        "Nicola Rando",
        "David Rapetti",
        "Francesco Ratti",
        "Heike Rauer",
        "Federica Rescigno",
        "Ignasi Ribas",
        "Ken Rice",
        "George R. Ricker",
        "Paul Robertson",
        "Thierry de Roche",
        "Laurence Sabin",
        "Nuno C. Santos",
        "Dimitar D. Sasselov",
        "Arjun B. Savel",
        "Gaetano Scandariato",
        "Nicole Schanche",
        "Urs Schroffenegger",
        "Richard P. Schwarz",
        "Sara Seager",
        "Ramotholo Sefako",
        "Damien Segransan",
        "Avi Shporer",
        "Andre M. Silva",
        "Alexis M. S. Smith",
        "Alessandro Sozzetti",
        "Manfred Steller",
        "Gyula M. Szabo",
        "Motohide Tamura",
        "Nicolas Thomas",
        "Amy Tuson",
        "Stephane Udry",
        "Andrew Vanderburg",
        "Roland K. Vanderspek",
        "Julia Venturini",
        "Francesco Verrecchia",
        "Nicholas A. Walton",
        "Christopher A. Watson",
        "Robert D. Wells",
        "Joshua N. Winn",
        "Roberto Zambelli",
        "Carl Ziegler"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-02-11",
      "updated": "2026-02-11",
      "pdf_link": "https://arxiv.org/pdf/2602.11271v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.11271v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 13,
      "summary": "**Why It Matters**\n\nScientists have long wondered how planets get their \"clothes\"—the atmospheres that wrap around rocky cores. Some planets are naked rocks, while others wear thick gaseous coats. This discovery helps solve that puzzle by finding a rare planetary family where we can see both types living around the same star. Understanding how atmospheres form and disappear is crucial because it determines whether a planet could potentially support life as we know it.\n\n**What They Did**\n\nThe research team played cosmic detective, using two main tools to study a small red star called LHS 1903. First, they watched for tiny dips in the star's brightness—like detecting a fly crossing in front of a streetlight—which happens when planets pass between us and their star. Second, they measured how the star wobbles slightly as its planets tug on it gravitationally, like a dog walker being pulled by four different dogs. By combining these techniques, they could determine each planet's size, weight, and density.\n\n**Key Findings**\n\nThe team discovered four planets with dramatically different personalities orbiting their red dwarf star every 2.2 to 29.3 days. The innermost planet is a dense, rocky world stripped bare of atmosphere. Two middle planets retained thick, puffy atmospheres that make them larger despite potentially having similar rocky cores. Most surprisingly, the outermost planet—which should have been the easiest to keep an atmosphere in the cooler outer regions—is completely naked rock. This suggests it never had an atmosphere to begin with, forming from material that was already stripped of gas.\n\n**Looking Forward**\n\nThis planetary system serves as a natural laboratory for understanding how planets acquire and lose their atmospheres. The surprising naked outer planet suggests that the disk of gas and dust from which these planets formed was already depleted, offering new insights into planetary formation around red dwarf stars—the most common type in our galaxy.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Scientists have long wondered how planets get their \"clothes\"—the atmospheres that wrap around rocky cores. Some planets are naked rocks, while others wear thick gaseous coats. This discovery helps solve that puzzle by finding a rare planetary family where we can see both types living around the same star. Understanding how atmospheres form and disappear is crucial because it determines whether a planet could potentially support life as we know it.</p>\n<h4>What They Did</h4>\n<p>The research team played cosmic detective, using two main tools to study a small red star called LHS 1903. First, they watched for tiny dips in the star's brightness—like detecting a fly crossing in front of a streetlight—which happens when planets pass between us and their star. Second, they measured how the star wobbles slightly as its planets tug on it gravitationally, like a dog walker being pulled by four different dogs. By combining these techniques, they could determine each planet's size, weight, and density.</p>\n<h4>Key Findings</h4>\n<p>The team discovered four planets with dramatically different personalities orbiting their red dwarf star every 2.2 to 29.3 days. The innermost planet is a dense, rocky world stripped bare of atmosphere. Two middle planets retained thick, puffy atmospheres that make them larger despite potentially having similar rocky cores. Most surprisingly, the outermost planet—which should have been the easiest to keep an atmosphere in the cooler outer regions—is completely naked rock. This suggests it never had an atmosphere to begin with, forming from material that was already stripped of gas.</p>\n<h4>Looking Forward</h4>\n<p>This planetary system serves as a natural laboratory for understanding how planets acquire and lose their atmospheres. The surprising naked outer planet suggests that the disk of gas and dust from which these planets formed was already depleted, offering new insights into planetary formation around red dwarf stars—the most common type in our galaxy.</p>",
      "tweet_hook": {
        "hook": "🪐 BREAKING: Scientists just found a 4-planet system that rewrites the rulebook on how worlds form!",
        "claim": "Around red dwarf star LHS 1903, four planets formed WITHOUT thick atmospheres - proving planets can skip the 'puffy' phase and go straight to being rocky super-Earths",
        "evidence": "The planets orbit every 2.2 to 29.3 days and all sit in the 'radius valley' - the mysterious gap between small rocky and large gassy worlds",
        "question": "Could this discovery explain why some planets never got thick atmospheres to begin with? 🤔"
      },
      "figure_url": "https://images.unsplash.com/photo-1614728263952-84ea256f9679?w=800&q=80"
    },
    {
      "id": "2602.11531v1",
      "title": "Eccentricity Evolution of Warm Jupiters: The Role of Distant Perturbers and Nearby Companions",
      "abstract": "Warm Jupiters-giant exoplanets with orbital periods between 10 and 200 days-exhibit a broad range of eccentricities and are often accompanied by nearby low-mass planets. Understanding the origins of their orbital architectures requires examining both their migration histories and subsequent dynamical interactions. In this study, we perform extensive N-body simulations to explore how distant giant planet perturbers affect the eccentricity evolution of warm Jupiters and the role of nearby super-Earth companions in mediating these interactions. We find that while distant perturbers can induce large-amplitude eccentricity oscillations in warm Jupiters via the von Zeipel-Lidov-Kozai mechanism, the presence of nearby super-Earth companions often suppresses these variations via strong dynamical coupling. This mechanism naturally leads to a bimodal eccentricity distribution: warm Jupiters with nearby companions tend to maintain low eccentricities, whereas those without exhibit significantly broader eccentricity distributions. We show that reproducing the observed eccentricity distribution of warm Jupiters lacking nearby companions is most naturally explained if a substantial fraction of distant perturbers occupy dynamically extreme orbits, either with large mutual inclinations or high orbital eccentricities. These results support a scenario in which warm Jupiters experience substantial post-disk dynamical evolution, shaped jointly by distant perturbers and nearby companions.",
      "authors": [
        "Ying He",
        "Dong-Hong Wu",
        "Sheng Jin"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-02-12",
      "updated": "2026-02-12",
      "pdf_link": "https://arxiv.org/pdf/2602.11531v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.11531v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 12,
      "summary": "**Why It Matters**\n\nImagine discovering that planets the size of Jupiter orbit other stars much closer to their suns than Jupiter orbits ours—but not as close as scorching \"hot Jupiters\" that whip around their stars in just days. These \"warm Jupiters\" represent a cosmic mystery that's been puzzling astronomers: why do some have stretched-out, oval-shaped orbits while others follow nearly perfect circles? Understanding how these giant worlds ended up in their current positions helps us piece together the chaotic story of how planetary systems form and evolve—including whether systems like ours are common or rare in the galaxy.\n\n**What They Did**\n\nThe researchers created detailed computer simulations—like cosmic video games—to watch how warm Jupiters behave over millions of years. They populated virtual solar systems with different combinations of planets: the warm Jupiter itself, smaller \"super-Earth\" planets nearby, and distant giant planets acting as gravitational bullies. By running these simulations thousands of times with different starting conditions, they could observe how the orbits changed over time and compare the results to real exoplanets we've discovered.\n\n**Key Findings**\n\nThe team discovered a cosmic tug-of-war that explains warm Jupiters' varied orbits. When distant giant planets act alone, they can dramatically stretch a warm Jupiter's orbit through a gravitational effect called the von Zeipel-Lidov-Kozai mechanism—essentially a rhythmic gravitational squeeze that makes orbits more oval over time. However, nearby super-Earth companions act like protective siblings, their gravity dampening these wild orbital swings and keeping warm Jupiters on more circular paths. This creates two distinct populations: warm Jupiters with nearby planetary neighbors tend to have calm, circular orbits, while lone warm Jupiters show much more varied, eccentric paths.\n\n**Looking Forward**\n\nThis research suggests that planetary systems undergo dramatic reshuffling long after their initial formation, like cosmic musical chairs that can last millions of years. These findings will help astronomers better interpret observations from current and future planet-hunting missions, potentially revealing which planetary systems experienced violent histories versus more peaceful evolution—crucial insights for understanding where Earth-like worlds might thrive.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine discovering that planets the size of Jupiter orbit other stars much closer to their suns than Jupiter orbits ours—but not as close as scorching \"hot Jupiters\" that whip around their stars in just days. These \"warm Jupiters\" represent a cosmic mystery that's been puzzling astronomers: why do some have stretched-out, oval-shaped orbits while others follow nearly perfect circles? Understanding how these giant worlds ended up in their current positions helps us piece together the chaotic story of how planetary systems form and evolve—including whether systems like ours are common or rare in the galaxy.</p>\n<h4>What They Did</h4>\n<p>The researchers created detailed computer simulations—like cosmic video games—to watch how warm Jupiters behave over millions of years. They populated virtual solar systems with different combinations of planets: the warm Jupiter itself, smaller \"super-Earth\" planets nearby, and distant giant planets acting as gravitational bullies. By running these simulations thousands of times with different starting conditions, they could observe how the orbits changed over time and compare the results to real exoplanets we've discovered.</p>\n<h4>Key Findings</h4>\n<p>The team discovered a cosmic tug-of-war that explains warm Jupiters' varied orbits. When distant giant planets act alone, they can dramatically stretch a warm Jupiter's orbit through a gravitational effect called the von Zeipel-Lidov-Kozai mechanism—essentially a rhythmic gravitational squeeze that makes orbits more oval over time. However, nearby super-Earth companions act like protective siblings, their gravity dampening these wild orbital swings and keeping warm Jupiters on more circular paths. This creates two distinct populations: warm Jupiters with nearby planetary neighbors tend to have calm, circular orbits, while lone warm Jupiters show much more varied, eccentric paths.</p>\n<h4>Looking Forward</h4>\n<p>This research suggests that planetary systems undergo dramatic reshuffling long after their initial formation, like cosmic musical chairs that can last millions of years. These findings will help astronomers better interpret observations from current and future planet-hunting missions, potentially revealing which planetary systems experienced violent histories versus more peaceful evolution—crucial insights for understanding where Earth-like worlds might thrive.</p>",
      "tweet_hook": {
        "hook": "🪐 The mystery of 'warm Jupiter' planets just got a major breakthrough!",
        "claim": "Scientists discovered that distant giant planets act like cosmic bullies, dramatically reshaping the orbits of warm Jupiters over millions of years through gravitational warfare.",
        "evidence": "Using advanced computer simulations, researchers tracked how planets with 10-200 day orbits get their stretched, oval-shaped paths.",
        "question": "Could our own solar system have hidden giants pulling planetary strings we never knew about?"
      },
      "figure_url": "https://arxiv.org/html/2602.11531v1/Insta_rate_pr.jpg"
    }
  ]
}