{
  "announcement_date": "2026-01-26",
  "updated_at": "2026-01-26T03:53:19.182202+00:00",
  "category": "astro-ph.EP",
  "paper_count": 4,
  "papers": [
    {
      "id": "2601.16357v1",
      "title": "TOI-6692b: An eccentric 130 day period giant planet with a single transit from TESS",
      "abstract": "We report the discovery and characterization of TOI-6692 b, an eccentric (e~0.54) Jupiter on a 130-day orbit. TOI-6692 b was first detected as a community TESS Object of Interest (cTOI) by the Visual Survey Group and the Planet Hunters group as a single transit candidate via TESS observation. The period was subsequently confirmed via radial velocity monitoring from the Planet Finder Spectrograph on the 6.5m Magellan telescope. Additional radial velocities were acquired with the CHIRON, FEROS, and CORALIE spectrographs. LCOGT ground-based photometric follow-up was conducted over 2 weeks to detect another transit and refine the period. Although we did not detect an ingress or egress of the 11.04 hr transit, we did detect a possible in-transit signal in the multi-night data and provide an updated ephemeris for future monitoring. TOI-6692 b is one of few planets with orbital periods longer than 100 days that have a secure mass, radius, and eccentricity detection. As with most giant planets at these orbital periods, the eccentricity of TOI-6692 b is lower than that expected of planets undergoing high-eccentricity tidal migration, but is more consistent with the expectations of planet-planet scattering outcomes. A long-term radial velocity trend was detected and further monitoring is warranted to determine the outer companion period. TOI-6692 b is also one of few TESS single transit targets that have its period eventually confirmed via follow-up photometric campaigns timed to capture transits despite the relatively large ephemeris uncertainties. Such efforts highlight the capabilities of night-to-night stability on ground-based photometric facilities today.",
      "authors": [
        "Allyson Bieryla",
        "Karen A. Collins",
        "George Zhou",
        "David W. Latham",
        "Brad Carter",
        "Paul Dalba",
        "Robert Gagliano",
        "Thomas L. Jacobs",
        "Martti Holst Kristiansen",
        "Daryll Lacourse",
        "Mark Omohundro",
        "H. M. Schwengeler",
        "Khalid Barkaoui",
        "Rafael Brahm",
        "Douglas A. Caldwell",
        "Jeffrey D. Crane",
        "Tansu Daylan",
        "Sarah Deveny",
        "Yadira S. Gaibor",
        "Michael Gillon",
        "Thomas Henning",
        "Keith Horne",
        "R. Paul Butler",
        "Jason D. Eastman",
        "Steve B. Howell",
        "Emmanuel Jehin",
        "Eric L. N. Jensen",
        "Andres Jordan",
        "Michelle Kunimoto",
        "Colin Littlefield",
        "Lena Parc",
        "Samuel N. Quinn",
        "Malena Rice",
        "Joseph E. Rodriguez",
        "Richard P. Schwarz",
        "Ramotholo Sefako",
        "Stephen A. Shectman",
        "Avi Shporer",
        "Abderahmane Soubkiou",
        "Gregor Srdoc",
        "Michal Steiner",
        "Marcelo Tala Pinto",
        "Johanna Teske",
        "Trifon Trifonov",
        "Solene Ulmer-Moll",
        "Cristilyn N. Watkins",
        "Sharon X. Wang",
        "Jhon Yana Galarza",
        "Samuel W. Yee"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-22",
      "updated": "2026-01-22",
      "pdf_link": "https://arxiv.org/pdf/2601.16357v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.16357v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 45,
      "summary": "**Why It Matters**\n\nImagine trying to solve a jigsaw puzzle with only one piece visible for a brief moment every four months. That's essentially what astronomers faced when they spotted a single, mysterious signal from a distant world called TOI-6692b. This discovery matters because it showcases how modern astronomy can piece together the story of an entire planet from just fleeting glimpses. Finding planets with such long orbital periods—those that take months to complete one \"year\"—helps us understand how planetary systems like our own solar system form and evolve over billions of years.\n\n**What They Did**\n\nThe planet was first spotted by citizen scientists volunteers who comb through data from TESS, NASA's planet-hunting telescope. They noticed a single dimming event as the planet passed in front of its star—like watching a moth briefly cross a distant streetlight. To confirm this wasn't just a fluke, astronomers used multiple ground-based telescopes around the world to measure tiny wobbles in the star caused by the planet's gravitational pull. They also attempted to catch the planet crossing its star again by timing their observations to coincide with when they predicted the next transit would occur, despite having only one previous sighting to work with.\n\n**Key Findings**\n\nTOI-6692b is a gas giant similar to Jupiter but follows a highly stretched-out, oval-shaped orbit that takes 130 days to complete. Its path is so eccentric that it swings much closer and farther from its star during each orbit—imagine Earth having summers hot enough to melt lead and winters colder than Mars. The planet's 11-hour-long transit makes it one of the few distant worlds where astronomers have nailed down its mass, size, and orbital shape with confidence.\n\n**Looking Forward**\n\nThis discovery demonstrates that even single, brief observations can unlock planetary secrets when combined with persistent follow-up work. The techniques used here will help astronomers find more distant worlds and better understand how planets get kicked into such extreme orbits.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to solve a jigsaw puzzle with only one piece visible for a brief moment every four months. That's essentially what astronomers faced when they spotted a single, mysterious signal from a distant world called TOI-6692b. This discovery matters because it showcases how modern astronomy can piece together the story of an entire planet from just fleeting glimpses. Finding planets with such long orbital periods—those that take months to complete one \"year\"—helps us understand how planetary systems like our own solar system form and evolve over billions of years.</p>\n<h4>What They Did</h4>\n<p>The planet was first spotted by citizen scientists volunteers who comb through data from TESS, NASA's planet-hunting telescope. They noticed a single dimming event as the planet passed in front of its star—like watching a moth briefly cross a distant streetlight. To confirm this wasn't just a fluke, astronomers used multiple ground-based telescopes around the world to measure tiny wobbles in the star caused by the planet's gravitational pull. They also attempted to catch the planet crossing its star again by timing their observations to coincide with when they predicted the next transit would occur, despite having only one previous sighting to work with.</p>\n<h4>Key Findings</h4>\n<p>TOI-6692b is a gas giant similar to Jupiter but follows a highly stretched-out, oval-shaped orbit that takes 130 days to complete. Its path is so eccentric that it swings much closer and farther from its star during each orbit—imagine Earth having summers hot enough to melt lead and winters colder than Mars. The planet's 11-hour-long transit makes it one of the few distant worlds where astronomers have nailed down its mass, size, and orbital shape with confidence.</p>\n<h4>Looking Forward</h4>\n<p>This discovery demonstrates that even single, brief observations can unlock planetary secrets when combined with persistent follow-up work. The techniques used here will help astronomers find more distant worlds and better understand how planets get kicked into such extreme orbits.</p>",
      "tweet_hook": {
        "hook": "We just found a giant planet that takes 130 days to orbit its star—from a single transit! 🪐",
        "claim": "TOI-6692b is an eccentric Jupiter-sized planet with a highly elliptical 130-day orbit, confirmed from just one TESS transit observation.",
        "evidence": "Despite seeing only one 11-hour transit, we confirmed the period using radial velocity data from multiple ground-based telescopes.",
        "question": "How do you confirm a planet's orbit when you've only seen it transit once? 🤔"
      },
      "figure_url": "https://arxiv.org/html/2601.16357v1/x1.png"
    },
    {
      "id": "2601.16791v1",
      "title": "Mercury-Arχes: a high-performance n-body code for planet formation studies",
      "abstract": "Forming planetary systems are populated by large numbers of gravitationally interacting planetary bodies, spanning from massive giant planets to small planetesimals akin to present-day asteroids and comets. All these planetary bodies are embedded in the gaseous embrace of their native protoplanetary disks, and their interactions with the disk gas play a central role in shaping their dynamical evolution and the outcomes of planet formation. These factors make realistic planet formation simulations extremely computationally demanding, which in turn means that accurately modeling the formation of planetary systems requires the use of high-performance methods. The planet formation code Mercury-Arχes was developed to address these challenges and, since its first implementation, has been used in multiple exoplanetary and Solar System studies. Mercury-Arχes is a parallel n-body code that builds on the widely used Mercury code and is capable of modeling the growth and migration of forming planets, the interactions between planetary bodies and the disk gas, as well as the evolving impact flux of planetesimals on forming planets across the different stages of their formation process. In this work we provide the up-to-date overview of its physical modeling capabilities and the first detailed description of its high-performance implementation based on the OpenMP directive-based parallelism for shared memory environments, to harness the multi-thread and vectorization features of modern processor architectures.",
      "authors": [
        "Diego Turrini",
        "Sergio Fonte",
        "Romolo Politi",
        "Danae Polychroni",
        "Scigé J. Liu",
        "Paolo Matteo Simonetti",
        "Simona Pirani"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "physics.comp-ph"
      ],
      "published": "2026-01-23",
      "updated": "2026-01-23",
      "pdf_link": "https://arxiv.org/pdf/2601.16791v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.16791v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 14,
      "summary": "**Why It Matters**\n\nImagine trying to understand how a bustling city develops by watching it in fast-forward over centuries—that's essentially what scientists are doing when they study how planets form around distant stars. This research matters because it helps us answer one of humanity's most profound questions: How common are planetary systems like our own? By creating more powerful computer simulations of planet formation, researchers can better predict what kinds of worlds exist beyond our solar system and whether Earth-like planets capable of supporting life are rare cosmic accidents or common occurrences throughout the galaxy.\n\n**What They Did**\n\nThe researchers developed a sophisticated computer program called Mercury-Arχes that acts like a cosmic flight simulator for planet formation. Just as flight simulators must track thousands of variables simultaneously—weather, physics, mechanical systems—this program tracks the gravitational dance between countless objects in a young solar system: massive gas giant planets, rocky worlds like Earth, and swarms of smaller bodies like asteroids and comets. The challenge is that these simulations must also account for the swirling disk of gas that surrounds young stars, which pushes and pulls on forming planets like a cosmic wind. To handle these incredibly complex calculations, the team optimized their program to run on multiple computer processors simultaneously, like having dozens of calculators working together on the same massive equation.\n\n**Key Findings**\n\nThe main achievement is a dramatically more efficient simulation tool that can model planet formation with unprecedented detail and speed. By using parallel processing techniques, the program can simultaneously track the interactions between thousands of planetary bodies while accounting for gas disk effects—something that would have taken prohibitively long with older methods.\n\n**Looking Forward**\n\nThis computational breakthrough will allow scientists to run more comprehensive simulations of how different types of planetary systems form, helping us understand why some stars host multiple Earth-sized worlds while others have only gas giants. These insights will prove invaluable as next-generation telescopes discover thousands of new exoplanets.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to understand how a bustling city develops by watching it in fast-forward over centuries—that's essentially what scientists are doing when they study how planets form around distant stars. This research matters because it helps us answer one of humanity's most profound questions: How common are planetary systems like our own? By creating more powerful computer simulations of planet formation, researchers can better predict what kinds of worlds exist beyond our solar system and whether Earth-like planets capable of supporting life are rare cosmic accidents or common occurrences throughout the galaxy.</p>\n<h4>What They Did</h4>\n<p>The researchers developed a sophisticated computer program called Mercury-Arχes that acts like a cosmic flight simulator for planet formation. Just as flight simulators must track thousands of variables simultaneously—weather, physics, mechanical systems—this program tracks the gravitational dance between countless objects in a young solar system: massive gas giant planets, rocky worlds like Earth, and swarms of smaller bodies like asteroids and comets. The challenge is that these simulations must also account for the swirling disk of gas that surrounds young stars, which pushes and pulls on forming planets like a cosmic wind. To handle these incredibly complex calculations, the team optimized their program to run on multiple computer processors simultaneously, like having dozens of calculators working together on the same massive equation.</p>\n<h4>Key Findings</h4>\n<p>The main achievement is a dramatically more efficient simulation tool that can model planet formation with unprecedented detail and speed. By using parallel processing techniques, the program can simultaneously track the interactions between thousands of planetary bodies while accounting for gas disk effects—something that would have taken prohibitively long with older methods.</p>\n<h4>Looking Forward</h4>\n<p>This computational breakthrough will allow scientists to run more comprehensive simulations of how different types of planetary systems form, helping us understand why some stars host multiple Earth-sized worlds while others have only gas giants. These insights will prove invaluable as next-generation telescopes discover thousands of new exoplanets.</p>",
      "tweet_hook": {
        "hook": "How do you simulate billions of colliding rocks forming planets? 🪐",
        "claim": "Mercury-Arχes revolutionizes planet formation modeling by tracking massive giant planets down to tiny asteroids in realistic gas disks.",
        "evidence": "The parallel n-body code uses OpenMP parallelism to harness modern multi-core processors, making previously impossible simulations feasible.",
        "question": "What planetary mysteries could we solve with faster, more realistic simulations?"
      },
      "figure_url": "https://arxiv.org/html/2601.16791v1/Gprof-Serial.png"
    },
    {
      "id": "2601.16841v1",
      "title": "The Origins of Planets for ArieL (OPAL) Key Science Project: the end-to-end planet formation campaign for the ESA space mission Ariel",
      "abstract": "The growing body of atmospheric observations of exoplanets from space and ground-based facilities showcases how the great diversity of the planetary population is not limited to their physical properties but extends to their compositions. The ESA space mission Ariel will observe and characterise hundreds of exoplanetary atmospheres to explore and understand the roots of this compositional diversity. To lay the foundations for the Ariel mission, the OPAL Key Science Project is tasked with creating an unprecedented library of realistic synthetic atmospheres spanning tens of elements and hundreds of molecules on which the Ariel consortium will test and validate its codes and pipelines ahead of launch. In this work we describe the aims and the pipeline of codes of the OPAL project, as well as the process through which we trace the genetic link connecting planets to their native protoplanetary disks and host stars. We present the early results of this complex and unprecedented endeavour and discuss how they highlight the great diversity of outcomes that emerge from the large degeneracy in the parameter space of possible initial conditions to the planet formation process. This, in turn, illustrates the growing importance of interdisciplinary modelling studies supported by high-performance computing methods and infrastructures to properly investigate this class of high-dimensionality problems.",
      "authors": [
        "Danae Polychroni",
        "Diego Turrini",
        "Romolo Politi",
        "Sergio Fonte",
        "Eugenio Schisano",
        "Elenia Pacetti",
        "Paolo Matteo Simonetti",
        "Michele Zusi",
        "Sergio Molinari",
        "Stavro Ivanovski"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "physics.comp-ph"
      ],
      "published": "2026-01-23",
      "updated": "2026-01-23",
      "pdf_link": "https://arxiv.org/pdf/2601.16841v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.16841v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 5,
      "summary": "**Why It Matters**\n\nImagine if every person on Earth had wildly different air to breathe—some with oxygen-rich atmospheres, others thick with methane, and still others as thin as mountaintop air. This is exactly what scientists are discovering about planets beyond our solar system. Thousands of exoplanets have been found, and they show an incredible diversity not just in size and temperature, but in the very air that surrounds them. Understanding why these planetary atmospheres are so different could unlock the secrets of how planets form and whether any might harbor life. It's like having a cosmic detective story where the atmosphere holds the clues to each planet's origin story.\n\n**What They Did**\n\nTo prepare for Ariel, an upcoming European space telescope that will study hundreds of exoplanet atmospheres, researchers created something like a massive recipe book for planetary atmospheres. They built computer simulations that follow the entire \"life story\" of a planet—starting from the swirling disk of gas and dust around a young star, through the planet's formation, and ending with its final atmospheric composition. Think of it as creating a family tree that connects each planet to its birthplace. Their simulations track dozens of chemical elements and hundreds of different molecules, creating a library of realistic artificial atmospheres that spans the full range of possibilities scientists expect to find in space.\n\n**Key Findings**\n\nThe research revealed that even tiny differences in starting conditions can lead to dramatically different planetary outcomes. Like how small changes in a recipe can completely alter the final dish, minor variations in the original disk of material around a star can produce planets with vastly different atmospheric compositions. This helps explain the stunning diversity scientists observe in real exoplanets and shows that the universe is capable of creating an almost endless variety of worlds.\n\n**Looking Forward**\n\nThis work provides the essential groundwork for interpreting future discoveries from the Ariel mission. When the telescope begins observing real exoplanets, scientists will have this comprehensive library to compare against, helping them decode what each atmosphere reveals about its planet's formation history and potential for supporting life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine if every person on Earth had wildly different air to breathe—some with oxygen-rich atmospheres, others thick with methane, and still others as thin as mountaintop air. This is exactly what scientists are discovering about planets beyond our solar system. Thousands of exoplanets have been found, and they show an incredible diversity not just in size and temperature, but in the very air that surrounds them. Understanding why these planetary atmospheres are so different could unlock the secrets of how planets form and whether any might harbor life. It's like having a cosmic detective story where the atmosphere holds the clues to each planet's origin story.</p>\n<h4>What They Did</h4>\n<p>To prepare for Ariel, an upcoming European space telescope that will study hundreds of exoplanet atmospheres, researchers created something like a massive recipe book for planetary atmospheres. They built computer simulations that follow the entire \"life story\" of a planet—starting from the swirling disk of gas and dust around a young star, through the planet's formation, and ending with its final atmospheric composition. Think of it as creating a family tree that connects each planet to its birthplace. Their simulations track dozens of chemical elements and hundreds of different molecules, creating a library of realistic artificial atmospheres that spans the full range of possibilities scientists expect to find in space.</p>\n<h4>Key Findings</h4>\n<p>The research revealed that even tiny differences in starting conditions can lead to dramatically different planetary outcomes. Like how small changes in a recipe can completely alter the final dish, minor variations in the original disk of material around a star can produce planets with vastly different atmospheric compositions. This helps explain the stunning diversity scientists observe in real exoplanets and shows that the universe is capable of creating an almost endless variety of worlds.</p>\n<h4>Looking Forward</h4>\n<p>This work provides the essential groundwork for interpreting future discoveries from the Ariel mission. When the telescope begins observing real exoplanets, scientists will have this comprehensive library to compare against, helping them decode what each atmosphere reveals about its planet's formation history and potential for supporting life.</p>",
      "tweet_hook": {
        "hook": "🌍 Why are exoplanets so wildly different? The answer lies in their birth stories.",
        "claim": "New OPAL project creates unprecedented library of synthetic atmospheres to trace how planets inherit chemistry from their birth disks",
        "evidence": "By modeling tens of elements and hundreds of molecules, we're revealing the genetic link between planets and their protoplanetary nurseries",
        "question": "What if every planet's atmosphere is a fossil record of its formation? 🧵"
      },
      "figure_url": "https://arxiv.org/html/2601.16841v1/nea_scatter_PS_output_pl_orbper_pl_bmassj_pres.png"
    },
    {
      "id": "2601.16268v1",
      "title": "proto-Lightspeed: a high-speed, ultra-low read noise imager on the Magellan Clay Telescope",
      "abstract": "proto-Lightspeed is a new instrument that has been commissioned on the Nasmyth East port of the Magellan Clay Telescope at Las Campanas Observatory to deliver high-speed optical imaging with deep sub-electron read noise. Making use of commercial re-imaging lenses and the ORCA-Quest 2 camera from Hamamatsu, proto-Lightspeed images a field 1' in diameter at up to 200 Hz or windowed fields at higher rates, up to 6600 Hz for a 1.6''× 1' field of view. proto-Lightspeed delivers seeing-limited image quality in the g', r', and i' bands and adjustable magnification for pixel scales between 0.017''-0.050''. proto-Lightspeed is well suited to studying compact binary systems, exoplanet transits, rapid flaring associated with accretion, periodic optical emission from pulsars, occultations of background stars by small trans-Neptunian Objects, and any other rapidly variable source. proto-Lightspeed will be a P.I. instrument beginning in 2026B, available for use by members of the Magellan Consortium. In this paper, we discuss the design and performance of the instrument, results from its two commissioning runs, and plans for a facility instrument, Lightspeed, to support simultaneous multicolor imaging across a 7'×4' field.",
      "authors": [
        "Christopher Layden",
        "Kevin Burdge",
        "Gabor Furesz",
        "Juliana Garcia-Mejia",
        "Jack Dinsmore",
        "Geoffrey Mo",
        "David Osip",
        "John J. Piotrowski",
        "Roger W. Romani",
        "August Berne",
        "Deepro Chakrabarty",
        "Emma Chickles"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "published": "2026-01-22",
      "updated": "2026-01-22",
      "pdf_link": "https://arxiv.org/pdf/2601.16268v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.16268v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\n\nImagine trying to photograph a firefly blinking on and off in your backyard while standing a mile away. That's essentially what astronomers face when studying rapidly changing events in space—like planets passing in front of distant stars, or explosive flares from cosmic objects. These fleeting celestial events happen incredibly fast and are extremely faint, making them nearly impossible to capture with traditional telescopes. Missing these brief moments means losing crucial clues about how planets form, how stars behave, and what strange objects lurk in the outer reaches of our solar system. This is why astronomers desperately needed a new kind of cosmic camera.\n\n**What They Did**\n\nScientists built an ultra-fast space camera called proto-Lightspeed and attached it to one of the world's most powerful telescopes in Chile. Think of it as upgrading from an old film camera to the most advanced high-speed digital camera imaginable. This new instrument can take up to 200 pictures per second of the entire viewing area, or an incredible 6,600 pictures per second when focused on smaller regions of sky. The camera is so sensitive it can detect almost individual particles of light, with virtually no background noise that typically ruins faint astronomical images. The team used commercially available lenses combined with cutting-edge Japanese camera technology, proving that sometimes the best scientific tools come from clever combinations of existing technology.\n\n**Key Findings**\n\nThe camera successfully captured razor-sharp images during its test runs, proving it can spot the kinds of rapid changes astronomers have been trying to study for years. It can photograph objects across different colors of light simultaneously and adjust its magnification like a zoom lens. The instrument works so well that it will become available to the international astronomy community in 2026, giving researchers worldwide access to this powerful new tool.\n\n**Looking Forward**\n\nThis technology opens entirely new windows into the universe's most dynamic events. Astronomers will finally be able to study how planets affect their host stars during transits, catch mysterious objects in the outer solar system as they briefly block background starlight, and witness the split-second flares that reveal secrets about cosmic collisions and explosions. The team is already planning an even more advanced version that could revolutionize how we discover and study exoplanets.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to photograph a firefly blinking on and off in your backyard while standing a mile away. That's essentially what astronomers face when studying rapidly changing events in space—like planets passing in front of distant stars, or explosive flares from cosmic objects. These fleeting celestial events happen incredibly fast and are extremely faint, making them nearly impossible to capture with traditional telescopes. Missing these brief moments means losing crucial clues about how planets form, how stars behave, and what strange objects lurk in the outer reaches of our solar system. This is why astronomers desperately needed a new kind of cosmic camera.</p>\n<h4>What They Did</h4>\n<p>Scientists built an ultra-fast space camera called proto-Lightspeed and attached it to one of the world's most powerful telescopes in Chile. Think of it as upgrading from an old film camera to the most advanced high-speed digital camera imaginable. This new instrument can take up to 200 pictures per second of the entire viewing area, or an incredible 6,600 pictures per second when focused on smaller regions of sky. The camera is so sensitive it can detect almost individual particles of light, with virtually no background noise that typically ruins faint astronomical images. The team used commercially available lenses combined with cutting-edge Japanese camera technology, proving that sometimes the best scientific tools come from clever combinations of existing technology.</p>\n<h4>Key Findings</h4>\n<p>The camera successfully captured razor-sharp images during its test runs, proving it can spot the kinds of rapid changes astronomers have been trying to study for years. It can photograph objects across different colors of light simultaneously and adjust its magnification like a zoom lens. The instrument works so well that it will become available to the international astronomy community in 2026, giving researchers worldwide access to this powerful new tool.</p>\n<h4>Looking Forward</h4>\n<p>This technology opens entirely new windows into the universe's most dynamic events. Astronomers will finally be able to study how planets affect their host stars during transits, catch mysterious objects in the outer solar system as they briefly block background starlight, and witness the split-second flares that reveal secrets about cosmic collisions and explosions. The team is already planning an even more advanced version that could revolutionize how we discover and study exoplanets.</p>",
      "tweet_hook": {
        "hook": "🚀 We just built a camera that can capture space at 6,600 frames per second with near-zero noise!",
        "claim": "proto-Lightspeed on the Magellan telescope delivers ultra-high-speed imaging at up to 6,600 Hz with sub-electron read noise for exoplanet research",
        "evidence": "The instrument captures exoplanet transits and stellar flares at 200 Hz across 1' fields, with adjustable pixel scales from 0.017'' to 0.050''",
        "question": "What rapid cosmic phenomena would you want to catch in ultra-slow motion? 🎬✨"
      },
      "figure_url": "https://arxiv.org/html/2601.16268v1/x1.png"
    }
  ]
}