{
  "announcement_date": "2026-02-18",
  "updated_at": "2026-02-18T04:17:14.859994+00:00",
  "category": "astro-ph.EP",
  "paper_count": 5,
  "papers": [
    {
      "id": "2602.15105v1",
      "title": "Searching for Extragalactic Exoplanets: A Survey of the Sagittarius Dwarf Galaxy Stream with TESS",
      "abstract": "To date no exoplanets have been detected outside the Milky Way, and their extragalactic occurrence rates are poorly constrained. Using available data from TESS we perform the first transit survey of the Sagittarius dwarf galaxy stream using 15,176 main sequence stars identified as likely members. We calculate an upper limit of <1.01% for hot Jupiters with radii of 1-2 RJuₚ and periods of 0.6-10 days after detecting zero planets. We compare our calculated occurrence rate upper limits to the upper limits found in the Milky Way globular clusters M4 and 47 Tuc. Our 1-σ occurrence rate upper limit of <0.37% for the Sagittarius dwarf galaxy stream, for planets with radii of 1.5-2 RJuₚ and periods <10 days, is lower than the <0.57% upper limit measured in 47 Tuc. Similarly, our 2 sigma upper limit of <0.78% for planets with radii of 1.4-2 Juₚ and periods <8 days is below the <0.81% upper limit measured in M4. We predict that a future analysis of TESS data with a high detection efficiency for hot Jupiter transit depths would require ηₑₓtrₐgₐlₐctic ≥ 11,467 target stars to detect a planet of extragalactic origin. Therefore, we predict that a future investigation of TESS data which includes additional extragalactic stellar streams will be able to either detect the first extragalactic origin planet or provide evidence that older, lower metallicity extragalactic environments may experience a lower hot Jupiter occurrence rate than is observed for the Milky Way.",
      "authors": [
        "William Schap",
        "Jason Dittmann",
        "Elizabeth Lada"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "published": "2026-02-16",
      "updated": "2026-02-16",
      "pdf_link": "https://arxiv.org/pdf/2602.15105v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.15105v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 27,
      "summary": "**Why It Matters**\n\nFor decades, astronomers have discovered thousands of planets orbiting stars in our own galaxy, the Milky Way. But what about planets in other galaxies entirely? This groundbreaking research represents humanity's first systematic attempt to find planets beyond our galactic neighborhood—a quest that could reveal whether planetary systems are truly universal phenomena or if conditions in different galaxies produce dramatically different results. The answer could fundamentally change our understanding of how common planets are in the universe and whether the building blocks of life exist everywhere or just in special cosmic neighborhoods like our own.\n\n**What They Did**\n\nThe researchers turned their attention to the Sagittarius dwarf galaxy, a smaller galaxy that's currently being torn apart and absorbed by our Milky Way. They used NASA's planet-hunting telescope TESS (Transiting Exoplanet Survey Satellite) to monitor over 15,000 stars from this disrupted galaxy. Like celestial detectives, they watched for tiny, periodic dips in starlight that occur when a planet crosses in front of its host star—imagine watching for the shadow of a fly passing in front of a distant lighthouse. They specifically searched for \"hot Jupiters\"—massive planets that orbit extremely close to their stars, completing their years in just days rather than the 11 years our Jupiter takes.\n\n**Key Findings**\n\nDespite monitoring thousands of stars, the team found exactly zero planets. While this might seem disappointing, it's actually scientifically valuable information. Based on their observations, they calculated that fewer than 1% of stars in this extragalactic stream likely host hot Jupiter planets. This rate appears even lower than what's been observed in ancient star clusters within our own galaxy, suggesting that stars from different galactic environments might indeed have fewer large planets.\n\n**Looking Forward**\n\nThis research blazes the trail for extragalactic planet hunting. The team estimates that monitoring over 11,000 additional extragalactic stars could either yield the first confirmed planet from another galaxy or provide strong evidence that older, metal-poor galactic environments simply don't produce as many giant planets as our relatively young, metal-rich Milky Way does.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>For decades, astronomers have discovered thousands of planets orbiting stars in our own galaxy, the Milky Way. But what about planets in other galaxies entirely? This groundbreaking research represents humanity's first systematic attempt to find planets beyond our galactic neighborhood—a quest that could reveal whether planetary systems are truly universal phenomena or if conditions in different galaxies produce dramatically different results. The answer could fundamentally change our understanding of how common planets are in the universe and whether the building blocks of life exist everywhere or just in special cosmic neighborhoods like our own.</p>\n<h4>What They Did</h4>\n<p>The researchers turned their attention to the Sagittarius dwarf galaxy, a smaller galaxy that's currently being torn apart and absorbed by our Milky Way. They used NASA's planet-hunting telescope TESS (Transiting Exoplanet Survey Satellite) to monitor over 15,000 stars from this disrupted galaxy. Like celestial detectives, they watched for tiny, periodic dips in starlight that occur when a planet crosses in front of its host star—imagine watching for the shadow of a fly passing in front of a distant lighthouse. They specifically searched for \"hot Jupiters\"—massive planets that orbit extremely close to their stars, completing their years in just days rather than the 11 years our Jupiter takes.</p>\n<h4>Key Findings</h4>\n<p>Despite monitoring thousands of stars, the team found exactly zero planets. While this might seem disappointing, it's actually scientifically valuable information. Based on their observations, they calculated that fewer than 1% of stars in this extragalactic stream likely host hot Jupiter planets. This rate appears even lower than what's been observed in ancient star clusters within our own galaxy, suggesting that stars from different galactic environments might indeed have fewer large planets.</p>\n<h4>Looking Forward</h4>\n<p>This research blazes the trail for extragalactic planet hunting. The team estimates that monitoring over 11,000 additional extragalactic stars could either yield the first confirmed planet from another galaxy or provide strong evidence that older, metal-poor galactic environments simply don't produce as many giant planets as our relatively young, metal-rich Milky Way does.</p>",
      "tweet_hook": {
        "hook": "🌌 Scientists just searched for planets in ANOTHER GALAXY for the first time ever!",
        "claim": "Researchers used NASA's TESS telescope to hunt for exoplanets in the Sagittarius dwarf galaxy stream, scanning over 15,000 stars but found zero planets so far.",
        "evidence": "This sets an upper limit: less than 1% of stars in that galaxy likely host hot Jupiter-type planets with 0.6-10 day orbits.",
        "question": "Could alien worlds in other galaxies be rarer than we thought? 🪐"
      },
      "figure_url": "https://arxiv.org/html/2602.15105v1/cutoffscatter.png"
    },
    {
      "id": "2602.15507v1",
      "title": "Upper atmosphere dynamics and drivers of volatiles loss from terrestrial-type (exo)planets",
      "abstract": "Volatile loss from exoplanetary atmospheres and its possible implications for the longevity of habitable surface conditions is a topic of vigorous debate currently. The vast majority of the habitable zone terrestrial-like exoplanets known to date orbit low-mass M- and K-dwarf stars and are subject to the conditions drastically different to those of terrestrial planets in the Solar System. In particular, they orbit far closer to their host stars than similar planets around G-dwarfs similar to the Sun. Therefore they receive higher X-ray and UV fluxes, even though luminosities of M- and K-dwarfs are lower than those of heavier stars. Furthermore, due to their slower evolution, M-dwarfs retain high activity on the gigayear timescales. The combination of these two effects has led to claims that most terrestrial planets orbiting M-dwarfs may have their atmospheres stripped from the higher X-ray and UV fluxes of their host stars. Opposing this are researchers who point out that volatile inventories for terrestrial exoplanets are ill-constrained, and hence, they may be able to \"weather the storm\" of these higher X-ray and UV fluxes. In this chapter, we focus on exploring volatile loss in the upper atmospheres of terrestrial planets in our solar system and applications to those in exoplanetary systems around stars of different types.",
      "authors": [
        "Daria Kubyshkina",
        "Michael J. Way",
        "Iannis Dandouras",
        "Helmut Lammer",
        "Antonino Francesco Lanza",
        "Manasvi Lingam",
        "Rumi Nakamura",
        "Moa Persson",
        "Manuel Scherf",
        "Kanako Seki"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-02-17",
      "updated": "2026-02-17",
      "pdf_link": "https://arxiv.org/pdf/2602.15507v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.15507v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 26,
      "summary": "# Could Earth-like Worlds Around Smaller Stars Keep Their Air?\n\n**Why It Matters**\n\nImagine finding a planet that looks just like Earth—the right size, the right distance from its star, potentially the right conditions for liquid water. But what if that planet has no atmosphere at all? This research tackles one of the biggest questions in our search for life beyond Earth: whether planets orbiting smaller, dimmer stars can actually hold onto the air that makes life possible. Since most of the potentially habitable worlds we've discovered orbit these smaller stars rather than Sun-like ones, understanding atmospheric loss could determine whether we're looking for life in the right places—or if these worlds are actually barren, airless rocks.\n\n**What They Did**\n\nThe researchers studied how planets lose their atmospheres by examining what happens in the upper layers of planetary air, where space meets atmosphere. Think of it like studying how a hot cup of coffee loses steam—but instead of water vapor escaping, entire atmospheres can be stripped away by intense radiation from nearby stars. They compared conditions around different types of stars: our Sun (a medium-sized G-dwarf), and the smaller, cooler K-dwarf and M-dwarf stars that most Earth-like exoplanets orbit. They analyzed how X-ray and ultraviolet radiation from these stars affects planetary atmospheres over billions of years.\n\n**Key Findings**\n\nThe research reveals a cosmic catch-22. While smaller M-dwarf and K-dwarf stars are dimmer overall, planets must orbit much closer to them to stay warm enough for liquid water—sometimes ten times closer than Earth orbits the Sun. At these close distances, planets receive intense X-ray and ultraviolet bombardment that can blast away their atmospheres. Making matters worse, these smaller stars stay active and energetic for billions of years longer than Sun-like stars, potentially stripping atmospheres throughout a planet's entire lifetime.\n\n**Looking Forward**\n\nThis research highlights the central debate in exoplanet science: are most potentially habitable worlds actually uninhabitable? The answer depends on whether these planets started with thick enough atmospheres to survive the bombardment, or whether they can replenish lost air through volcanic activity. Future space telescopes will test these predictions by directly measuring the atmospheres of nearby exoplanets, finally revealing whether our cosmic neighbors have managed to keep their air.",
      "summary_html": "<p># Could Earth-like Worlds Around Smaller Stars Keep Their Air?</p>\n<h4>Why It Matters</h4>\n<p>Imagine finding a planet that looks just like Earth—the right size, the right distance from its star, potentially the right conditions for liquid water. But what if that planet has no atmosphere at all? This research tackles one of the biggest questions in our search for life beyond Earth: whether planets orbiting smaller, dimmer stars can actually hold onto the air that makes life possible. Since most of the potentially habitable worlds we've discovered orbit these smaller stars rather than Sun-like ones, understanding atmospheric loss could determine whether we're looking for life in the right places—or if these worlds are actually barren, airless rocks.</p>\n<h4>What They Did</h4>\n<p>The researchers studied how planets lose their atmospheres by examining what happens in the upper layers of planetary air, where space meets atmosphere. Think of it like studying how a hot cup of coffee loses steam—but instead of water vapor escaping, entire atmospheres can be stripped away by intense radiation from nearby stars. They compared conditions around different types of stars: our Sun (a medium-sized G-dwarf), and the smaller, cooler K-dwarf and M-dwarf stars that most Earth-like exoplanets orbit. They analyzed how X-ray and ultraviolet radiation from these stars affects planetary atmospheres over billions of years.</p>\n<h4>Key Findings</h4>\n<p>The research reveals a cosmic catch-22. While smaller M-dwarf and K-dwarf stars are dimmer overall, planets must orbit much closer to them to stay warm enough for liquid water—sometimes ten times closer than Earth orbits the Sun. At these close distances, planets receive intense X-ray and ultraviolet bombardment that can blast away their atmospheres. Making matters worse, these smaller stars stay active and energetic for billions of years longer than Sun-like stars, potentially stripping atmospheres throughout a planet's entire lifetime.</p>\n<h4>Looking Forward</h4>\n<p>This research highlights the central debate in exoplanet science: are most potentially habitable worlds actually uninhabitable? The answer depends on whether these planets started with thick enough atmospheres to survive the bombardment, or whether they can replenish lost air through volcanic activity. Future space telescopes will test these predictions by directly measuring the atmospheres of nearby exoplanets, finally revealing whether our cosmic neighbors have managed to keep their air.</p>",
      "tweet_hook": {
        "hook": "🌍 Most 'Earth-like' planets might be doomed from the start",
        "claim": "Scientists discover that most potentially habitable exoplanets orbit so close to their stars that they're likely losing their atmospheres—and ability to support life",
        "evidence": "Unlike Earth, these planets orbit tiny M- and K-dwarf stars at much closer distances, experiencing extreme atmospheric stripping",
        "question": "Could we be looking for life in all the wrong places? 🔭"
      },
      "figure_url": "https://arxiv.org/html/2602.15507v1/x1.png"
    },
    {
      "id": "2602.15501v1",
      "title": "Precise measurement of WASP-31 b's Rossiter-McLaughlin effect and characterization of the planet transmission spectra",
      "abstract": "Context. Hot Jupiters are ideal natural laboratories to investigate atmospheric composition and dynamics. However, high-resolution transmission spectroscopy is currently limited by our capability of removing planet-occulted line-distortion (POLD) contamination from the signal. Aims. In this paper, we aim to characterize the transmission spectrum of WASP-31 b from two and a half transits observed with the ESPRESSO spectrograph at the VLT. Methods. The Rossiter-McLaughlin (RM) signature was analyzed using the RM \"revolutions\" method. Before extracting the transmission spectrum of the planet, we corrected the dataset for telluric lines using molecfit and further modeled the POLD deformations using EvE. Results. We confirm the planet low sky-projected spin-orbit angle from previous studies and further refine its value to λ= -0.09⁺⁰.³¹₋₀.₃₂ deg. We do not detect any species (including previously detected species such as K or CrH) in the planetary atmosphere. In most cases the non-detections are due to the strong POLDs contamination or lack of observable lines in the ESPRESSO wavelength range, and so previous detections cannot be ruled out. Conclusions. Planet-occulted line-distortion contamination continues to be the main limitation of high-resolution transmission spectroscopy for species present in both the star and the planet, hindering atmospheric detections even with state-of-the-art models, in particular for planets with a low sky-projected spin-orbit angle. Developing advanced techniques to isolate planetary signatures is of utmost importance in the advent of ELT-like observations.",
      "authors": [
        "M. Steiner",
        "V. Bourrier",
        "D. Ehrenreich",
        "W. Dethier",
        "H. Chakraborty",
        "S. Pelletier",
        "M. Lendl",
        "B. Akinsanmi",
        "R. Allart",
        "J. M. Almenara",
        "S. Cristiani",
        "J. I. González Hernández",
        "P. D. Marcantonio",
        "C. J. A. P. Martins",
        "L. Mishra",
        "D. Mounzer",
        "M. R. Zapatero Osorio",
        "E. Palle",
        "F. Pepe",
        "A. Psaridi",
        "N. C. Santos",
        "J. V. Seidel",
        "A. Sozzetti",
        "V. Vaulato",
        "G. Viviani",
        "J. Yu"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-02-17",
      "updated": "2026-02-17",
      "pdf_link": "https://arxiv.org/pdf/2602.15501v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.15501v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 25,
      "summary": "**Why It Matters**\n\nImagine trying to analyze the air quality in a distant city by studying how sunlight changes as it passes through the atmosphere—except the city is orbiting another star 1,200 light-years away. That's essentially what astronomers are attempting when they study exoplanet atmospheres. WASP-31 b, a \"hot Jupiter\" roughly the size of our solar system's largest planet but scorching hot from orbiting extremely close to its star, offers a perfect natural laboratory for understanding alien worlds. These atmospheric studies could eventually help us identify planets with conditions suitable for life, making this research a crucial stepping stone toward answering whether we're alone in the universe.\n\n**What They Did**\n\nUsing one of the world's most advanced telescopes in Chile, researchers observed WASP-31 b as it passed in front of its host star multiple times. Think of it like watching a soap bubble drift across a flashlight beam—the light changes slightly as it filters through the bubble, revealing what the bubble is made of. The team used an ultra-precise instrument called ESPRESSO to split the starlight into its component colors, creating a cosmic fingerprint. They also measured how the planet's orbit affects the star's rotation, like watching a spotlight wobble slightly as an object passes in front of it. The challenge was separating the planet's faint atmospheric signature from much stronger contamination caused by the star's own light.\n\n**Key Findings**\n\nThe researchers confirmed that WASP-31 b orbits almost perfectly aligned with its star's equator, with a tilt of just -0.09 degrees—imagine a coin spinning on a table that's nearly perfectly flat. However, they couldn't detect any specific chemicals in the planet's atmosphere, including potassium and chromium hydride that other studies had previously identified. This wasn't necessarily because these substances aren't there, but because contamination from the star's own light was too overwhelming, like trying to hear a whisper next to a roaring waterfall.\n\n**Looking Forward**\n\nThis study highlights a major challenge facing exoplanet science: current technology struggles to separate planetary atmospheric signals from stellar contamination, especially for planets in well-aligned orbits like WASP-31 b. However, this limitation is temporary. Next-generation telescopes currently under construction will be dramatically more powerful, potentially overcoming these obstacles and opening a new era of detailed atmospheric analysis of distant worlds.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to analyze the air quality in a distant city by studying how sunlight changes as it passes through the atmosphere—except the city is orbiting another star 1,200 light-years away. That's essentially what astronomers are attempting when they study exoplanet atmospheres. WASP-31 b, a \"hot Jupiter\" roughly the size of our solar system's largest planet but scorching hot from orbiting extremely close to its star, offers a perfect natural laboratory for understanding alien worlds. These atmospheric studies could eventually help us identify planets with conditions suitable for life, making this research a crucial stepping stone toward answering whether we're alone in the universe.</p>\n<h4>What They Did</h4>\n<p>Using one of the world's most advanced telescopes in Chile, researchers observed WASP-31 b as it passed in front of its host star multiple times. Think of it like watching a soap bubble drift across a flashlight beam—the light changes slightly as it filters through the bubble, revealing what the bubble is made of. The team used an ultra-precise instrument called ESPRESSO to split the starlight into its component colors, creating a cosmic fingerprint. They also measured how the planet's orbit affects the star's rotation, like watching a spotlight wobble slightly as an object passes in front of it. The challenge was separating the planet's faint atmospheric signature from much stronger contamination caused by the star's own light.</p>\n<h4>Key Findings</h4>\n<p>The researchers confirmed that WASP-31 b orbits almost perfectly aligned with its star's equator, with a tilt of just -0.09 degrees—imagine a coin spinning on a table that's nearly perfectly flat. However, they couldn't detect any specific chemicals in the planet's atmosphere, including potassium and chromium hydride that other studies had previously identified. This wasn't necessarily because these substances aren't there, but because contamination from the star's own light was too overwhelming, like trying to hear a whisper next to a roaring waterfall.</p>\n<h4>Looking Forward</h4>\n<p>This study highlights a major challenge facing exoplanet science: current technology struggles to separate planetary atmospheric signals from stellar contamination, especially for planets in well-aligned orbits like WASP-31 b. However, this limitation is temporary. Next-generation telescopes currently under construction will be dramatically more powerful, potentially overcoming these obstacles and opening a new era of detailed atmospheric analysis of distant worlds.</p>",
      "tweet_hook": {
        "hook": "Scientists just eavesdropped on an alien world's atmosphere in unprecedented detail 🌍✨",
        "claim": "Using a super-precise technique, researchers measured how starlight filters through WASP-31 b's atmosphere as it passes in front of its star, revealing the planet's chemical fingerprint",
        "evidence": "The ESPRESSO spectrograph at VLT captured 2.5 transits with such accuracy that it can detect tiny atmospheric distortions invisible before",
        "question": "What secrets could this 'hot Jupiter's' atmosphere reveal about alien worlds? 🔭"
      },
      "figure_url": "https://images.unsplash.com/photo-1614732414444-096e5f1122d5?w=800&q=80"
    },
    {
      "id": "2602.15611v1",
      "title": "Searching for Axion-like particle Dark Matter with Time-domain Polarization: Constraints from a protoplanetary disk",
      "abstract": "Axion-like particles (ALPs) can induce a birefringence effect that rotates the polarization angle of light, offering a probe of ultralight dark matter. We analyze archival near-infrared polarimetric data of the protoplanetary disk (PPD) around HD 163296. Whereas previous studies considered only single-epoch snapshots, we perform a consistent multi-epoch time-series analysis, extracting the polarization angle and its uncertainty from the polarized images. The resulting six-epoch time series is consistent with a constant polarization angle within the measurement uncertainties, while being sensitive to timescales of 170-400 days. The typical polarization angle uncertainties are 1.6--6.4 degrees, partly driven by multiple scattering in the optically thick disk, which broadens the intrinsic polarization angle distribution and introduces additional dispersion in the representative polarization angle. Based on these data, we derive the first upper limits on the ALP-photon coupling from PPD polarization variability, gₐγ 7.5 × 10⁻¹² (mₐ / 10⁻²²\\, eV)\\, GeV⁻¹. Furthermore, we forecast that achieving a polarization angle uncertainty of σ 0.1 degrees would enable world-leading sensitivity to ALP-induced birefringence.",
      "authors": [
        "Kanako Narita",
        "Tomohiro Fujita",
        "Ryo Tazaki",
        "Bunyo Hatsukade"
      ],
      "categories": [
        "astro-ph.CO",
        "astro-ph.EP",
        "hep-ph"
      ],
      "published": "2026-02-17",
      "updated": "2026-02-17",
      "pdf_link": "https://arxiv.org/pdf/2602.15611v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.15611v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 10,
      "summary": "**Why It Matters**\n\nScientists are hunting for one of the universe's greatest mysteries: dark matter, the invisible substance that makes up most of our cosmos. While we can't see dark matter directly, it might reveal itself by subtly twisting starlight as it travels through space—like how polarized sunglasses filter light in a specific direction. Researchers have now turned to young solar systems still forming around distant stars, using these cosmic nurseries as natural laboratories to search for dark matter's fingerprints in polarized light.\n\n**What They Did**\n\nThe team studied HD 163296, a young star surrounded by a swirling disk of gas and dust where planets are likely forming—similar to how our own solar system looked billions of years ago. Using powerful telescopes, they measured how light from this disk was polarized (oriented in specific directions) and tracked these measurements across six different observations over roughly a year. Think of it like taking multiple photos of the same scene with polarized sunglasses, then checking if the light's orientation changed between shots. If hypothetical particles called axion-like particles—a leading dark matter candidate—exist, they should cause this polarized light to slowly rotate over time, like a cosmic polarizing filter spinning in space.\n\n**Key Findings**\n\nThe polarized light showed no detectable rotation over the 170-400 day observation period, remaining steady within measurement uncertainties of about 1.6 to 6.4 degrees. While this might sound like a null result, it actually provides valuable constraints—the researchers could rule out certain types of dark matter particles and set the first-ever limits on how strongly these hypothetical particles interact with light using data from planet-forming disks.\n\n**Looking Forward**\n\nThis technique opens an entirely new window for dark matter detection using the numerous planet-forming disks astronomers observe. With more precise measurements—achieving uncertainties of just 0.1 degrees—future observations could provide world-leading sensitivity to dark matter, potentially solving one of physics' biggest puzzles while simultaneously studying how planetary systems form.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Scientists are hunting for one of the universe's greatest mysteries: dark matter, the invisible substance that makes up most of our cosmos. While we can't see dark matter directly, it might reveal itself by subtly twisting starlight as it travels through space—like how polarized sunglasses filter light in a specific direction. Researchers have now turned to young solar systems still forming around distant stars, using these cosmic nurseries as natural laboratories to search for dark matter's fingerprints in polarized light.</p>\n<h4>What They Did</h4>\n<p>The team studied HD 163296, a young star surrounded by a swirling disk of gas and dust where planets are likely forming—similar to how our own solar system looked billions of years ago. Using powerful telescopes, they measured how light from this disk was polarized (oriented in specific directions) and tracked these measurements across six different observations over roughly a year. Think of it like taking multiple photos of the same scene with polarized sunglasses, then checking if the light's orientation changed between shots. If hypothetical particles called axion-like particles—a leading dark matter candidate—exist, they should cause this polarized light to slowly rotate over time, like a cosmic polarizing filter spinning in space.</p>\n<h4>Key Findings</h4>\n<p>The polarized light showed no detectable rotation over the 170-400 day observation period, remaining steady within measurement uncertainties of about 1.6 to 6.4 degrees. While this might sound like a null result, it actually provides valuable constraints—the researchers could rule out certain types of dark matter particles and set the first-ever limits on how strongly these hypothetical particles interact with light using data from planet-forming disks.</p>\n<h4>Looking Forward</h4>\n<p>This technique opens an entirely new window for dark matter detection using the numerous planet-forming disks astronomers observe. With more precise measurements—achieving uncertainties of just 0.1 degrees—future observations could provide world-leading sensitivity to dark matter, potentially solving one of physics' biggest puzzles while simultaneously studying how planetary systems form.</p>",
      "tweet_hook": {
        "hook": "Scientists are using baby star systems to hunt for invisible dark matter particles! 🌟",
        "claim": "Researchers analyzed how light twists around a forming solar system over time to search for axion-like particles - mysterious ultralight dark matter candidates.",
        "evidence": "They tracked polarized light from protoplanetary disk HD 163296 across six different time periods using advanced infrared imaging.",
        "question": "Could the secrets of dark matter be hiding in the birth of new worlds? 🤔"
      },
      "figure_url": "https://arxiv.org/html/2602.15611v1/x1.png"
    },
    {
      "id": "2602.15695v1",
      "title": "The Montreal Open Clusters and Associations (MOCA) Database: A Census of Nearby Associations, Open Clusters, and Young Substellar Objects within 500 pc of the Sun",
      "abstract": "We present the Montreal Open Clusters and Associations database (MOCAdb), a public MySQL database with a Python interface. MOCAdb provides a census of memberships for 10259 associations and open clusters within 500 pc of the Sun, with a comprehensive compilation of literature measurements such as spectral types, kinematics, rotation periods, activity indices, spectral indices, and photometry. All known substellar objects are cataloged in MOCAdb, along with 2943 public spectra, to enable the characterization of substellar association members. MOCAdb also features periodically updated calculations such as Galactic UVW space velocities. We use this compilation to construct mappings between independent association definitions, and to update the BANYAN Σ membership classification tool, which now includes 8125 associations. The BANYAN Σ model construction is improved to account for heterogeneous and correlated errors and to capture complex association shapes using Gaussian mixture models. Combined with Gaia DR3, this enabled us to identify 11535 yet unrecognized candidate members of young associations within 500 pc, mostly M dwarfs. Our results corroborate a recent observation that systematics up to ≈4 km/s remain in Gaia DR3 radial velocities for A-type stars. We present an updated census of age-calibrated exoplanets and substellar objects: 134 age-calibrated exoplanet systems (plus 121 TESS exoplanet candidates), 99 of which did not appear to have known memberships so far, and 455 substellar (L0 or later) candidate members of young associations, 196 of which appear newly recognized. We bring the total of candidate isolated planetary-mass objects to 101, 53 of which are newly recognized candidate members.",
      "authors": [
        "Jonathan Gagné",
        "Leslie Moranta",
        "Jacqueline K. Faherty",
        "Jason Lee Curtis",
        "Thomas P. Bickle",
        "Dominic Couture",
        "Amélie Chiasson David",
        "Katie Christie",
        "Samantha Lambier",
        "Elise Leclerc",
        "Livia Poliquin",
        "Danika Belzile",
        "Eric E. Mamajek"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "published": "2026-02-17",
      "updated": "2026-02-17",
      "pdf_link": "https://arxiv.org/pdf/2602.15695v1.pdf",
      "abs_link": "https://arxiv.org/abs/2602.15695v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 5,
      "summary": "**Why It Matters**\n\nImagine trying to determine someone's age just by looking at them—it's tricky, right? The same challenge exists when studying planets orbiting other stars. To truly understand how planets form and evolve, astronomers need to know their ages. The key lies in studying young star clusters and associations—cosmic neighborhoods where stars are born together and share the same age. This research creates the most comprehensive catalog yet of these stellar neighborhoods near Earth, opening new windows into planetary science and helping us understand how planetary systems like our own come to be.\n\n**What They Did**\n\nResearchers built a massive digital library called the Montreal Open Clusters and Associations database, or MOCAdb for short. Think of it as a cosmic census that catalogs over 10,000 star groups within 500 light-years of Earth—our local galactic neighborhood. They gathered information from hundreds of scientific papers, recording everything from star types to how fast they spin. The team also improved a tool called BANYAN Σ (pronounced \"sigma\"), which works like facial recognition software for stars, identifying which cosmic neighborhood each star belongs to by analyzing how it moves through space.\n\n**Key Findings**\n\nThe database revealed some exciting discoveries. The researchers identified nearly 11,500 previously unknown candidate members of young star groups, mostly small, dim stars called M dwarfs. They cataloged 134 planetary systems with known ages, plus 121 potential new ones spotted by NASA's planet-hunting telescope TESS. Perhaps most intriguingly, they found 101 \"rogue\" objects that appear to be planet-sized but float freely through space without orbiting any star—cosmic orphans that challenge our understanding of how planets form.\n\n**Looking Forward**\n\nThis treasure trove of data will revolutionize exoplanet science. With precise ages for these stellar neighborhoods, astronomers can now study how planets change over millions of years, track atmospheric evolution, and better understand which types of planets might harbor life. It's like having a cosmic time machine that lets us see planets at different stages of their lives.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to determine someone's age just by looking at them—it's tricky, right? The same challenge exists when studying planets orbiting other stars. To truly understand how planets form and evolve, astronomers need to know their ages. The key lies in studying young star clusters and associations—cosmic neighborhoods where stars are born together and share the same age. This research creates the most comprehensive catalog yet of these stellar neighborhoods near Earth, opening new windows into planetary science and helping us understand how planetary systems like our own come to be.</p>\n<h4>What They Did</h4>\n<p>Researchers built a massive digital library called the Montreal Open Clusters and Associations database, or MOCAdb for short. Think of it as a cosmic census that catalogs over 10,000 star groups within 500 light-years of Earth—our local galactic neighborhood. They gathered information from hundreds of scientific papers, recording everything from star types to how fast they spin. The team also improved a tool called BANYAN Σ (pronounced \"sigma\"), which works like facial recognition software for stars, identifying which cosmic neighborhood each star belongs to by analyzing how it moves through space.</p>\n<h4>Key Findings</h4>\n<p>The database revealed some exciting discoveries. The researchers identified nearly 11,500 previously unknown candidate members of young star groups, mostly small, dim stars called M dwarfs. They cataloged 134 planetary systems with known ages, plus 121 potential new ones spotted by NASA's planet-hunting telescope TESS. Perhaps most intriguingly, they found 101 \"rogue\" objects that appear to be planet-sized but float freely through space without orbiting any star—cosmic orphans that challenge our understanding of how planets form.</p>\n<h4>Looking Forward</h4>\n<p>This treasure trove of data will revolutionize exoplanet science. With precise ages for these stellar neighborhoods, astronomers can now study how planets change over millions of years, track atmospheric evolution, and better understand which types of planets might harbor life. It's like having a cosmic time machine that lets us see planets at different stages of their lives.</p>",
      "tweet_hook": {
        "hook": "Scientists just mapped 10,000+ star families in our cosmic neighborhood! 🌟",
        "claim": "A new database catalogs over 10,000 star clusters and associations within 500 light-years of Earth, including all known failed stars (brown dwarfs) in the region.",
        "evidence": "The Montreal database includes 2,943 spectra and tracks everything from star rotation to chemical composition across our local galaxy.",
        "question": "What secrets might these stellar census records reveal about how stars form and evolve? 🤔"
      },
      "figure_url": "https://arxiv.org/html/2602.15695v1/x1.png"
    }
  ]
}