{
  "responseHeader":{
    "status":0,
    "QTime":224,
    "params":{
      "q":"author:\"Solmaz, Arif\"",
      "fl":"bibcode,title,year,journal,volume,page,doi,abstract,bibstem,database",
      "fq_database":"(database:astronomy OR database:physics)",
      "start":"0",
      "internal_logging_params":"X-Amzn-Trace-Id=Root=1-691e56ef-069dbd29587a89a62313a6cb",
      "sort":"date desc",
      "rows":"50",
      "wt":"json"}},
  "response":{"numFound":31,"start":0,"numFoundExact":true,"docs":[
      {
        "bibcode":"2025arXiv251114407K",
        "abstract":"The ExoClock project is an open platform aiming to monitor exoplanets by integrating observations from space and ground based telescopes. This study presents an updated catalogue of 620 exoplanet ephemerides, integrating 30000 measurements from ground-based telescopes (the ExoClock network), literature, and space telescopes (Kepler, K2 and TESS). The updated catalogue includes 277 planets from TESS which require special observing strategies due to their shallow transits or bright host stars. This study demonstrates that data from larger telescopes and the employment of new methodologies such as synchronous observations with small telescopes, are capable of monitoring special cases of planets. The new ephemerides show that 45% of the planets required an update while the results show an improvement of one order of magnitude in prediction uncertainty. The collective analysis also enabled the identification of new planets showing TTVs, highlighting the importance of extensive observing coverage. Developed in the context of the ESA's Ariel space mission, with the goal of delivering a catalogue with reliable ephemerides to increase the mission efficiency, ExoClock's scope and service have grown well beyond the remit of Ariel. The ExoClock project has been operating in the framework of open science, and all tools and products are accessible to everyone within academia and beyond, to support efficient scheduling of future exoplanet observations, especially from larger telescopes where the pressure for time allocation efficiency is higher (Ariel, JWST, VLT, ELT, Subaru etc). The inclusion of diverse audiences in the process and the collaborative mode not only foster democratisation of science but also enhance the quality of the results.",
        "bibstem":["arXiv",
          "arXiv2511"],
        "database":["astronomy"],
        "page":["arXiv:2511.14407"],
        "title":["ExoClock Project IV: A homogeneous catalogue of 620 updated exoplanet ephemerides"],
        "year":"2025"},
      {
        "bibcode":"2025A&A...703A.147O",
        "abstract":"Context. Trans-Neptunian objects (TNOs) are thought to be some of the most ancient and primitive bodies in our Solar System. Understanding their basic physical properties is crucial to unraveling their origin and the evolution of the outer Solar System beyond Neptune. Stellar occultations are a highly effective and sensitive method of studying these distant and faint objects, allowing us to gather essential information about their physical characteristics. (24835) 1995 SM<SUB>55</SUB> is one of the few members of the Haumea orbital cluster and, therefore, is an especially relevant body to study within the TNO population. Aims. The main objectives of the present work are to determine the projected size, absolute magnitude, and geometric albedo of 1995 SM<SUB>55</SUB> and to analyze the results compared to Haumea. Methods. We predicted a stellar occultation by this TNO for February, 25, 2024, carried out a specific campaign to observe the occultation, and derived the projected size and shape from the occultation observations using an elliptical fit to the occultation chords. We also analyzed a large set of photometric observations of (24835) 1995 SM<SUB>55</SUB> to obtain the absolute magnitude and the rotational period. Finally, we combined these results to derive the geometric albedo of this TNO. Results. The occultation was successfully detected from seven instruments located at five different sites; 33 other sites reported negative detections. Using an elliptical fit to the occultation chords, we determined the size and shape of the limb of (24835) 1995 SM<SUB>55</SUB> during the occultation: an ellipse with semi-axes (104.3 ± 0.4) × (83.5 ± 0.5) km. The area-equivalent diameter (D<SUB>eq,A</SUB>) for this ellipse is 186.7 ± 1.8 km. This is consistent with the upper limit of 250 km estimated from Herschel Observatory thermal data. From our photometric observations, we derived an absolute magnitude (H<SUB>V</SUB>) of 4.55 ± 0.03, a phase slope parameter of 0.04 ± 0.02 mag/deg, and a V − R value of 0.37 ± 0.05. The rotational variability has a maximum peak-to-valley amplitude (∆m) of 0.05 mag, but we could not derive an unambiguous rotational period. Combining the projected size from the occultation with the absolute photometry, we obtained a geometric albedo in the V band (p<SUB>V</SUB>) of 0.80 ± 0.04 for 1995 SM<SUB>55</SUB>. This value is remarkably high for a TNO and somewhat higher than that of Haumea, but consistent with the concept that 1995 SM<SUB>55</SUB> is a member of the orbital cluster of Haumea.",
        "bibstem":["A&A",
          "A&A...703"],
        "database":["astronomy"],
        "doi":["10.1051/0004-6361/202556498",
          "10.48550/arXiv.2509.15384"],
        "page":["A147"],
        "title":["A high geometric albedo and small size for the Haumea cluster member (24835) 1995 SM<SUB>55</SUB> determined from a stellar occultation and photometric observations"],
        "volume":"703",
        "year":"2025"},
      {
        "bibcode":"2025MNRAS.543.3456E",
        "abstract":"Cross-correlations techniques offer an alternative method to search for molecular species in James Webb Space Telescope (JWST) observations of exoplanet atmospheres. In a previous article, we applied cross-correlation functions for the first time to JWST NIRSpec/G395H observations of exoplanet atmospheres, resulting in a detection of CO in the transmission spectrum of WASP-39b and a tentative detection of CO isotopologues. Here, we present an improved version of our cross-correlation technique and an investigation into how efficient the technique is when searching for other molecules in JWST NIRSpec/G395H data. Our search results in the detection of more molecules via cross-correlations in the atmosphere of WASP-39b, including <inline-formula><tex-math>$\\rm H_{2}O$</tex-math></inline-formula> and <inline-formula><tex-math>$\\rm CO_{2}$</tex-math></inline-formula>, and confirms the CO detection. This result proves that cross-correlations are a robust and computationally cheap alternative method to search for molecular species in transmission spectra observed with JWST. We also searched for other molecules (<inline-formula><tex-math>$\\rm CH_{4}$</tex-math></inline-formula>, <inline-formula><tex-math>$\\rm NH_{3}$</tex-math></inline-formula>, <inline-formula><tex-math>$\\rm SO_{2}$</tex-math></inline-formula>, <inline-formula><tex-math>$\\rm N_{2}O$</tex-math></inline-formula>, <inline-formula><tex-math>$\\rm H_{2}S$</tex-math></inline-formula>, <inline-formula><tex-math>$\\rm PH_{3}$</tex-math></inline-formula>, <inline-formula><tex-math>$\\rm O_{3}$</tex-math></inline-formula>, and <inline-formula><tex-math>$\\rm C_{2}H_{2}$</tex-math></inline-formula>) that were not detected, for which we provide the definition of their cross-correlation baselines for future searches of those molecules in other targets. We find that that the cross-correlation search of each molecule is more efficient over limited wavelength regions of the spectrum, where the signal for that molecule dominates over other molecules, than over broad wavelength ranges. In general, we also find that Gaussian normalization is the most efficient normalization mode for the generation of the molecular templates.",
        "bibstem":["MNRAS",
          "MNRAS.543"],
        "database":["astronomy"],
        "doi":["10.1093/mnras/staf1659",
          "10.48550/arXiv.2509.25319"],
        "page":["3456"],
        "title":["Testing the performance of cross-correlation techniques to search for molecular features in JWST NIRSpec G395H observations of transiting exoplanets"],
        "volume":"543",
        "year":"2025"},
      {
        "bibcode":"2025epsc.conf...39A",
        "bibstem":["epsc",
          "epsc.conf"],
        "database":["astronomy"],
        "doi":["10.5194/epsc-dps2025-39"],
        "page":["EPSC-DPS2025-39"],
        "title":["Planetary Research: A new diamond open access journal for planetary science"],
        "volume":"2025",
        "year":"2025",
        "abstract":"Planetary Research is a new diamond open-access journal for the planetary sciences and is set to be launched in January 2026. Planetary Research will follow an alternative to the traditional model of commercial publishing: the diamond open access model, whereby the journal is run entirely by volunteers using free and open-source software, and owned by the community, through a non-profit association that has been set up in France (The Planetary Research Cooperative). This means that all articles published in Planetary Research will be available for free for both authors and readers, with no access, subscription, or submission processing charges, whilst the journal scope and principles are determined by the community through participation in the online forum and monthly meetings. Further opportunities for participation include open calls for the positions of editor-in-chief, editors, associate editors, and members of the media team and technical team, with deadlines on July the 1st, 2025 (see https://planetary-research.org for details).Planetary Research will cover the full scope of planetary science, including work based on spacecraft and Earth-based observatory data, laboratory studies of extraterrestrial or analogue materials, theoretical and numerical modeling, and terrestrial field-site analogue research. Studies on the Earth, as well as extrasolar systems, exoplanets, and solar and stellar phenomena, are welcome when the results are presented in a comparative planetology context. Original research will be published as long-format articles or short letters, with additional article types provided for reviews, descriptions of planetary missions and instrumentation, numerical codes, datasets, and commentaries that express a point of view on a topic or current issue. Published journal articles will receive a Digital Object Identifier (DOI) as in traditional journals. Planetary Research will apply to be indexed in Clarivate's Web of Science Core Collection and Elsevier's Scopus database by the end of 2026, and a journal Impact Factor will be automatically computed by Clarivate once two full years of citation data exist.Articles in Planetary Research will be peer-reviewed by expert reviewers assigned by the editorial team, with a choice of single-blind or double-blind review. Reviewers and associate editors will be by default anonymous but may choose to identify themselves. Having passed through the peer-review process, articles will be published on the journal website under a Creative Commons Attribution 4.0 license (CC BY 4.0), freely available to all with the authors retaining the copyright. All reviews, associate editor recommendations, and editor assessments will be made available as a review report that will be linked to the published article on the website. Each published article will also be promoted on the website and through social media by the journal's volunteer-led media team to increase its visibility and engagement both within the scientific community and the wider general public.Based on the recent successes of diamond open access journals in other fields (Volcanica, Seismica, Tektonika, Geomorphica, Sedimentologika, Advances in Geochemistry and Cosmochemistry, and soon Geodynamica), Planetary Research will use open-source software and volunteers for managing day-to-day journal activities, while the technical copyediting and production services are the only parts that are outsourced. This will be done by, and the journal hosted by, the Open Publishing Services (OPUS) at the Université Paris Cité. The total running costs for the journal will thus be kept between 10,000 and 30,000 € per year. The journal's first year running costs have already been met, and a number of grant proposals and discussions are underway to secure the longer-term funding. It is envisaged that a consortium of national space agencies and planetary science funding organizations will commit to assuring the operational costs of the journal, with 10 such partners ensuring that an individual contribution of only a few thousand euros per year would be needed.The journal's key principles follow those of open science. By removing financial barriers to publication, making the journal's functioning open to community participation, and promoting to and engaging with the general public of individual research articles, Planetary Research aims to democratise access and dissemination of scientific knowledge in the field of planetary science."},
      {
        "bibcode":"2025epsc.conf.1815L",
        "abstract":"The rapid advances in machine learning (ML) present unprecedented opportunities for planetary science. We have established a dedicated working group (WG) focused on the application of ML in this field to harness these technological advancements, address complex scientific questions, and enhance our understanding of planetary systems.The Europlanet Machine Learning Working Group held its kick-off meeting during the EPSC 2024 in Berlin, September 2024. The discussion focused on launching the group for exchanging ideas and opportunities with people within and outside of Europlanet's membership for the first year of its launch. Some of the main goals established were to create a knowledge-sharing platform for members to share their research and invite collaboration, form sub-groups within the WG to expand on current research focus, and foster new collaborative research opportunities within or outside of Europlanet with new funding.As of May 2025, the Europlanet Machine Learning Working Group has 30 members. Better still, the group has so far been able to attract both senior and early career members.The WG will build upon the achievements of the Europlanet RI project, which has addressed a broad range of ML applications across planetary research. The new group will delve deeper into specialized areas and foster collaboration and knowledge exchange. This targeted approach will enable the development of tailored ML solutions, drive innovation, and accelerate scientific discoveries.Bridging the gap between ML and planetary science, the WG will position academic institutions and industry stakeholders at the forefront of cutting-edge research. The WG will developML methods and tools for planetary surface and subsurface mapping, mineralogy, geomorphology, and geology; apply ML techniques to planetary atmospheres, climates, and weather systems; study the formation and evolution of planetary systems, exoplanets, and astrobiology; create ML frameworks and platforms for data integration, fusion, visualization, and dissemination. Large Language Models (e.g., ChatGPT) will be utilized as tools for ML in planetary science. Figure 1. Europlanet Machine Learning Working Group web page (https://www.europlanet.org/services/europlanet-machine-learning-working-group/)The Machine Learning WG initiated regular monthly meetings on the third Wednesday of each month from January 2025 onwards, where members of the WG got an opportunity to present their current or published work followed by a Q/A session. On the Europlanet website(Fig. 1), you can see the scheduled meetings and speakers. We will highlight some of the talks given by our members. Membership in the WG requires being a member of Europlanet. Benefits include participating in high-impact, state-of-the-art ML science, sharing ML tools and facilities on the Europlanet ML Portal, developing collaborations, participating in future Europlanet EC-funded ML proposals, and accessing Europlanet ML training, career development, and professional services.",
        "bibstem":["epsc",
          "epsc.conf"],
        "database":["astronomy"],
        "doi":["10.5194/epsc-dps2025-1815"],
        "page":["EPSC-DPS2025-1815"],
        "title":["Europlanet Machine Learning Working Group: a year of progress"],
        "volume":"2025",
        "year":"2025"},
      {
        "bibcode":"2025epsc.conf.1467K",
        "bibstem":["epsc",
          "epsc.conf"],
        "database":["astronomy"],
        "doi":["10.5194/epsc-dps2025-1467"],
        "page":["EPSC-DPS2025-1467"],
        "title":["Artificial Intelligence in Planetary Science and Astronomy: Applications and Research Potential"],
        "volume":"2025",
        "year":"2025",
        "abstract":"IntroductionArtificial Intelligence (AI) is one of the most influential fields of the 21st century (Zhang et al., 2021). Rich, E (2019) candidly described it as \"the study of how to make computers do things which, at the moment, people do better\", today AI often surpasses human ability in tasks like large-scale data mining and pattern recognition - its true strength. AI's subfields - Machine Learning (ML) and deep learning (DL), play a critical role in expanding the usage to a vast variety of fields like planetary science, astronomy, earth observations, and remote sensing, just to name a few. There is an expected inclination towards incorporating AI more frequently in the studies of planetary science given the vast and complex nature of planetary data. In fact, AI has already been instrumental in extracting meaningful insights and advancing research in both interplanetary and astronomical studies.In planetary sciences, several AI techniques have been employed in order to bridge gaps in our understanding of the varied patterns and occurrences for studying the natural features observable from the data returned by scientific payloads. For example, PCA and cluster analysis can help in detecting patterns of compositional variation from multi and hyper-spectral imagery (Moussaoui et al., 2008; D'Amore &amp; Padovan, 2022). Furthermore, to study specific features and patterns in their occurrences, correlations with neighbouring features; unsupervised algorithms and more complex -supervised techniques can be helpful depending on the scale of the task. From simple methods of unsupervised learning like clustering used to study the spectral signatures of Jezero crater on Mars (Pletl et al., 2023) to applying large language models to track asteroids affected by gravitational effects which alter the asteroid's orbit (Carruba et al., 2025), such applications highlight the prospects of AI in the field of planetary science. Henceforth, to develop a deeper understanding of the potential and applications of ML, below is a typical AI workflow.Typical AI workflowA typical workflow for an AI model involves an initial step of selecting a model suitable for your goals (Figure 2). Data format, quality of the data, static or dynamic features of interest, etc can influence the choice of AI model or techniques. Data preparation steps, like normalizing the data i.e. scaling the data from [-1,1] values, prevents dominance of any one feature in the data and stabilizes the model training process. Furthermore, parameters or hyperparameters are selected depending on the complexity of the model. While more complex models; deep neural networks or Vision Transformers will need hyperparameter adjustment to maximize performance, simpler models mainly rely on predefined weights or fixed rules. Likewise, a model architecture shall be established as per the data and targets. One example is the usage of the Faster-R-CNN - a robust and high accuracy yielding model which can be employed to train on high-resolution labelled images to perform object-detection tasks like identifying craters. In scientific use cases, the workflow often encompasses actual data that must be separated into a training set, validation set (to optimize the hyper-parameters) and a test set, completely independent from the training. To evaluate \"how well\" the model has learnt from the training dataset, accuracy, precision, recall, F1-score, and intersection-over-union (IoU) are the most popular statistics. Subsequently, model predictions can help in developing an understanding of the potential areas for fine-tuning and refining the model for the use case. Henceforth, fine-tuning the model is another crucial step.Figure 2: A typical AI workflowPotential of AIA successful application of ML in planetary science can be driven by a collaboration of scientists and ML experts. Scientists (astronomers, geologists, planetary scientists etc.) are arguably more equipped to answer science-based questions like what can be called a crater and conversely, ML experts may be more adept at assessing data preparation techniques to eradicate noise. The field of planetary sciences encompasses themes like anomaly detection, simulation and surface modeling, atmospheric studies, gravitational behavior and its effects on planets and smaller bodies, instrumentation and spacecraft design etc. which necessitates such collaborations for the optimum result. In recent years, Large Language Models (LLMs) have had a significant paradigm shift in AI applications due to their understanding of patterns acquired through their vast pre-training phase. For time series analysis, image classification, and pattern identification tasks common in planetary sciences, LLMs can significantly streamline workflows by reducing the need for specialized preprocessing steps.Given the enormous data from missions and observational surveys, and the numerous applications of planetary sciences, it is the need of the hour to produce workflows that not only automates but helps in an objective/standard decision making for problem statements of planetary sciences. The Europlanet Machine Learning Working Group does exactly this by sharing the latest techniques, tools, and applications and opens doors for people who want to apply these robust techniques.ReferencesRich, E. (2019). Artificial Intelligence 3E (Sie) (Vol. 63, No. 4). Tata McGraw-Hill Education. Moussaoui, S. et.al. (2008) On the decomposition of Mars hyperspectral data by ICA and Bayesian positive source separation Neurocomputing for Vision Research; Advances in Blind Signal Processing, 71, 2194-2208, http://dx.doi.org/10.1016/j.neucom.2007.07.034 Carruba, V. et al. (2025). Vision Transformers for identifying asteroids interacting with secular resonances. Icarus, 425, 116346. https://doi.org/10.1016/j.icarus.2024.116346 D'Amore, M., &amp; Padovan, S. (2022). Chapter 7 Automated surface mapping via unsupervised learning and classification of Mercury Visible-Near-Infrared reflectance spectra. In J. Helbert, M. D'Amore, M. Aye, &amp; H. Kerner (Eds.), Machine Learning for Planetary Science (pp. 131-149). Elsevier. https://doi.org/10.1016/B978-0-12-818721-0.00016-1 Pletl, A. et.al. (2023). Spectral Clustering of CRISM Datasets in Jezero Crater Using UMAP and k-Means. Remote Sensing, 15(4), Article 4. /10.3390/rs15040939 Zhang, D. et al. (2021). The AI Index 2021 Annual Report (No. arXiv:2103.06312). arXiv. /10.48550/arXiv.2103.06312"},
      {
        "bibcode":"2025JEST...2210049T",
        "abstract":"In this study, zinc oxide nanoparticles (ZnONp) were synthesized from Ocimum basilicum L. (ObL-ZnONp) plant wastes by green synthesis method to remove methylene blue (MB) dye, which has toxic effects on the environment. In batch adsorption studies, the effects of pH (3–11), ObL-ZnONp amount (0.0312–1.25 g/L), time (0–30 min), initial MB concentration (2–64 mg/L) and temperature (25–45 °C) were tested to determine the adsorption mechanism. The obtained results were tested with Pseudo first order (PFO), Pseudo second order (PSO), Elovich and Intraparticle diffusion kinetic models and evaluated in Freundlich, Langmuir, Temkin and Dubinin-Radushkevich isotherm models. Also 6 different error functions were used to interpret the results. Additionally, the morphological properties of the synthesized ObL-ZnONp were characterized by Fourier transform infrared (FTIR) spectroscopy, scanning electron microscopy (SEM) and energy dispersive X-ray (EDX) analysis. In addition, desorption tests were also performed. According to the obtained results, the most suitable kinetic and isotherm models were determined as PSO (R<SUP>2</SUP>: 0.999) and Freundlich (0.991), respectively. In addition, while more than 90% removal efficiency was achieved in 4 min, the maximum adsorption amount was determined as 21.41 mgMB/gObL-ZnONp. This study determined that Np synthesized at low cost was quite effective in MB removal.",
        "bibstem":["JEST",
          "JEST...22"],
        "database":["earth science"],
        "doi":["10.1007/s13762-025-06492-4"],
        "page":["10049"],
        "title":["Rapid adsorption of methylene blue by synthesizing zinc oxide nanoparticles from Ocimum basilicum L. waste"],
        "volume":"22",
        "year":"2025"},
      {
        "bibcode":"2023TJAA....4S.147A",
        "abstract":"Geçiş yapan ötegezegenlere ait parametreleri hassas bir şekilde belirleyebilmek için geçiş ışık eğrilerinde görülebilecek zaman değişimlerini tespit etmek oldukça önemlidir. Geçiş ve örtülme ortası zamanları, kenar kararması, yıldız aktivitesi ya da yıldızın basıklığı gibi ışık eğrisi morfolojisini etkileyen nedenlerle ya da sisteme ilave nesneler, yörünge presesyonu, açısal momentum değişimi gibi nedenlerle saniye, dakika veya saat mertebesinde, çoğunlukla çevrimsel şekilde değişebilmektedir. Bu çalışmada manyetik aktivite gösteren barınak yıldızlarda gözlenen yüzey lekelerinin gezegen tarafından örtülmesinin geçiş ortası zamanlarındaki değişime etkileri incelenmektedir.",
        "bibstem":["TJAA",
          "TJAA....4"],
        "database":["astronomy"],
        "doi":["10.55064/tjaa.1203704"],
        "page":["147"],
        "title":["Leke Örtülmelerinin Ötegezegen Geçiş Ortası Zaman Ölçümlerine Etkisi"],
        "volume":"4",
        "year":"2023"},
      {
        "bibcode":"2023TJAA....4S..83O",
        "abstract":"Bu çalışmada sıcak-Jüpiter türü çok sayıda ötegezegenin barınak yıldızlarının önünden geçiş zamanlarının değişimleri ile büyük çoğunluğu ortak zarf evresini tamamlamış bir grup çift yıldızın tutulma zamanlarının değişimleri üzerine yapılan uzun süreli bir araştırma ve bu araştırma kapsamında Türkiye'deki beş ayrı gözlemevinde yapılan gözlemlerin sonuçları sunulmaktadır. Son olarak, geçiş zamanları değişimi gösterdiğinden şüphelenilen TrES-5 sistemine ilişkin ön analizler bir örnek çalışma olarak sunulmuştur.",
        "bibstem":["TJAA",
          "TJAA....4"],
        "database":["astronomy"],
        "doi":["10.55064/tjaa.1202812"],
        "page":["83"],
        "title":["Zamanlama Yöntemiyle Ötegezegen Keşfi"],
        "volume":"4",
        "year":"2023"},
      {
        "bibcode":"2023BAAS...55c.263M",
        "abstract":"There is a growing awareness within the space science community that cross-disciplinary studies will make the greatest advances toward many major scientific objectives. This requires coordination and collaboration between the communities represented by the NASA SMD Divisions. We outline here specific steps that NASA and the community can take to further cross-disciplinary research.",
        "bibstem":["BAAS",
          "BAAS...55"],
        "database":["astronomy"],
        "doi":["10.3847/25c2cfeb.e033d3ce"],
        "page":["263"],
        "title":["Advancing Space Science Requires NASA Support for Coordination Between the Science Mission Directorate Communities"],
        "volume":"55",
        "year":"2023"},
      {
        "bibcode":"2023yCat..22650004K",
        "abstract":"In this study, we integrated light curves from the ExoClock network, the Exoplanet Transit Database (ETD; Poddany+ 2010NewA...15..297P), and the MAST Archive (for the Kepler, K2, and TESS space missions), and midtransit times from the literature, to update the ephemerides of 450 exoplanets. All the light curves were acquired before the end of 2021. See Section 2. <P />(2 data files).",
        "bibstem":["yCat",
          "yCat..226"],
        "database":["astronomy"],
        "page":["J/ApJS/265/4"],
        "title":["VizieR Online Data Catalog: ExoClock project. III. 450 exoplanet ephemerides (Kokori+, 2023)"],
        "volume":"226",
        "year":"2023"},
      {
        "bibcode":"2023ApJS..265....4K",
        "abstract":"The ExoClock project has been created to increase the efficiency of the Ariel mission. It will achieve this by continuously monitoring and updating the ephemerides of Ariel candidates, in order to produce a consistent catalog of reliable and precise ephemerides. This work presents a homogenous catalog of updated ephemerides for 450 planets, generated by the integration of ~18,000 data points from multiple sources. These sources include observations from ground-based telescopes (the ExoClock network and the Exoplanet Transit Database), midtime values from the literature, and light curves from space telescopes (Kepler, K2, and TESS). With all the above, we manage to collect observations for half of the postdiscovery years (median), with data that have a median uncertainty less than 1 minute. In comparison with the literature, the ephemerides generated by the project are more precise and less biased. More than 40% of the initial literature ephemerides had to be updated to reach the goals of the project, as they were either of low precision or drifting. Moreover, the integrated approach of the project enables both the monitoring of the majority of the Ariel candidates (95%), and also the identification of missing data. These results highlight the need for continuous monitoring to increase the observing coverage of the candidate planets. Finally, the extended observing coverage of planets allows us to detect trends (transit-timing variations) for a sample of 19 planets. All the products, data, and codes used in this work are open and accessible to the wider scientific community.",
        "bibstem":["ApJS",
          "ApJS..265"],
        "database":["astronomy"],
        "doi":["10.3847/1538-4365/ac9da4",
          "10.48550/arXiv.2209.09673"],
        "page":["4"],
        "title":["ExoClock Project. III. 450 New Exoplanet Ephemerides from Ground and Space Observations"],
        "volume":"265",
        "year":"2023"},
      {
        "bibcode":"2022A&A...664A.130S",
        "abstract":"Context. As part of our international program aimed at obtaining accurate physical properties of trans-Neptunian objects (TNOs), we predicted a stellar occultation by the TNO (38628) Huya of the star Gaia DR2 4352760586390566400 (m<SUB>G</SUB> = 11.5 mag) on March 18, 2019. After an extensive observational campaign geared at obtaining the astrometric data, we updated the prediction and found it favorable to central Europe. Therefore, we mobilized half a hundred of professional and amateur astronomers in this region and the occultation was finally detected by 21 telescopes located at 18 sites in Europe and Asia. This places the Huya event among the best ever observed stellar occultation by a TNO in terms of the number of chords. <BR /> Aims: The aim of our work is to determine an accurate size, shape, and geometric albedo for the TNO (38628) Huya by using the observations obtained from a multi-chord stellar occultation. We also aim to provide constraints on the density and other internal properties of this TNO. <BR /> Methods: The 21 positive detections of the occultation by Huya allowed us to obtain well-separated chords which permitted us to fit an ellipse for the limb of the body at the moment of the occultation (i.e., the instantaneous limb) with kilometric accuracy. <BR /> Results: The projected semi-major and minor axes of the best ellipse fit obtained using the occultation data are (a', b') = (217.6 ± 3.5 km, 194.1 ± 6.1 km) with a position angle for the minor axis of P' = 55.2° ± 9.1. From this fit, the projected area-equivalent diameter is 411.0 ± 7.3 km. This diameter is compatible with the equivalent diameter for Huya obtained from radiometric techniques (D = 406 ± 16 km). From this instantaneous limb, we obtained the geometric albedo for Huya (p<SUB>V</SUB> = 0.079 ± 0.004) and we explored possible three-dimensional shapes and constraints to the mass density for this TNO. We did not detect the satellite of Huya through this occultation, but the presence of rings or debris around Huya was constrained using the occultation data. We also derived an upper limit for a putative Pluto-like global atmosphere of about p<SUB>surf</SUB> = 10 nbar.",
        "bibstem":["A&A",
          "A&A...664"],
        "database":["astronomy"],
        "doi":["10.1051/0004-6361/202141546",
          "10.48550/arXiv.2205.12882"],
        "page":["A130"],
        "title":["Physical properties of the trans-Neptunian object (38628) Huya from a multi-chord stellar occultation"],
        "volume":"664",
        "year":"2022"},
      {
        "bibcode":"2021NewA...8601571P",
        "abstract":"We present new BVR band photometric light curves of BO Aries obtained in 2020 and combined them with the Transiting Exoplanet Survey Satellite (TESS) light curves. We obtained times of minima based on Gaussian and Cauchy distributions and then applied the Monte Carlo Markov Chain (MCMC) method to measure the amount of uncertainty from our CCD photometry and TESS data. A new ephemeris of the binary system was computed employing 204 times of minimum. The light curves were analyzed using the Wilson-Devinney binary code combined with the Monte Carlo (MC) simulation. For this light curve solution, we considered a dark spot on the primary component. We conclude that this binary is an A-type system with a mass ratio of q = 0.2074 ± 0.0001 , an orbital inclination of i = 82.18 ± 0.02 deg, and a fillout factor of f = 75.7 ± 0.8 % . Our results for the a (R<SUB>⊙</SUB>) and q parameters are consistent with the results of the Xu-Dong Zhang and Sheng-Bang Qian (2020) model. The absolute parameters of the two components were calculated and the distance estimate of the binary system was found to be 142 ± 9 pc.",
        "bibstem":["NewA",
          "NewA...86"],
        "database":["astronomy"],
        "doi":["10.1016/j.newast.2021.101571",
          "10.48550/arXiv.2101.06265"],
        "page":["101571"],
        "title":["BO Ari Light Curve Analysis using Ground-Based and TESS Data"],
        "volume":"86",
        "year":"2021"},
      {
        "bibcode":"2021TJAA....2....1S",
        "abstract":"Çukurova University Space Sciences and Solar Energy Research and Application Center (UZAYMER) was founded in 1991. In this work, we present current research in the fields of astronomy, astrophysics and solar energy and the astronomical infrastructure of the center. In addition, the astrometrological status of UZAYMER was investigated using long-term (20 years) data from the AstroGIS database and moderate-term (7 years) measurements taken from the meteorological station. Astronomical extinction coefficients, seeing conditions and light pollution measurements of UZAYMER were also obtained. Furthermore, the observation limits were determined for the UZAYMER 50 cm telescope (UT50) and the observation efficiency was evaluated. UZAYMER has reached a level that can support both national and international scientific collaborations with its improved technical infrastructure and increased human resources. With its annual number of clear nights, favorable weather conditions and dark sky values, UZAYMER ranks 972 in Group A of the Suitability Index for Astronomical Sites (SIAS) among the 2141 observatories.",
        "bibstem":["TJAA",
          "TJAA....2"],
        "database":["astronomy"],
        "doi":["10.48550/arXiv.2103.04855"],
        "page":["1"],
        "title":["Ç.Ü. Uzay Bilimleri ve Güneş Enerjisi Araştırma ve Uygulama Merkezi (UZAYMER) : I. Gözlem Koşulları ve Güncel Projeler"],
        "volume":"2",
        "year":"2021"},
      {
        "bibcode":"2021AstL...47..402P",
        "abstract":"The first analysis of the photometric observation in BVR filters of a W UMa type binary system BQ Ari was performed. Light curve analysis was performed using Wilson-Devinney (W-D) code combined with a Monte Carlo (MC) simulation to determine its photometric and geometric elements and their uncertainties. These results show that BQ Ari is a contact binary system with a photometric mass ratio $q=0.548± 0.019$, a fillout factor $f=24± 0.8%$, and an orbital inclination of $i=85.09± 0.45$. We used the parallax from Gaia EDR3 for calculating the absolute parameters of the binary system. This study suggested a new linear ephemeris for BQ Ari, combining our new mid-eclipse times and the previous observations, which we analyzed using the Monte Carlo Markov Chain (MCMC) method. We present the first analysis of the system's orbital period behavior by analyzing the $O-C$ diagram using the Genetic Algorithm (GA) and the MCMC approaches in OCFit code. We attempted to explain the analysis of the residuals of linear fit in the $O-C$ diagram with two approaches; ``LiTE $+$ Quadratic'' and ``Magnetic activity $+$ Quadratic.'' Although we consider the magnetic activity to be probable, the system should be studied further in order to reveal the nature of orbital period variations.",
        "bibstem":["AstL",
          "AstL...47"],
        "database":["astronomy"],
        "doi":["10.1134/S1063773721060050",
          "10.48550/arXiv.2006.00528"],
        "page":["402"],
        "title":["The First Light Curve Solutions and Period Study of BQ Ari"],
        "volume":"47",
        "year":"2021"},
      {
        "bibcode":"2021BAAS...53d.414M",
        "abstract":"There is a growing awareness that cross-disciplinary studies achieve many major science objectives. This requires greater coordination and collaboration between the four communities represented by the NASA SMD Divisions. We outline specific steps that can be taken by NASA and by the space science community to further cross-disciplinary research.",
        "bibstem":["BAAS",
          "BAAS...53"],
        "database":["astronomy"],
        "doi":["10.3847/25c2cfeb.53e7ca7e"],
        "page":["414"],
        "title":["Advancing Space Science Requires NASA Support for Coordination Between the Science Mission Directorate Communities"],
        "volume":"53",
        "year":"2021"},
      {
        "bibcode":"2019BAAS...51g.158M",
        "abstract":"We outline specific steps that NASA and the space science community can take to advance collaboration and coordination between the communities represented by the four NASA Science Mission Directorate Divisions. It is important to note that the only way that this effort can succeed is if NASA initiates and supports it through directed resources.",
        "bibstem":["BAAS",
          "BAAS...51"],
        "database":["astronomy"],
        "page":["158"],
        "title":["Advancing Space Science Requires NASA Support for Coordination Between the Science Mission Directorate Communities"],
        "volume":"51",
        "year":"2019"},
      {
        "bibcode":"2019BAAS...51g..55S",
        "abstract":"Commodity cloud computing makes it possible for science projects to easily procure highly-reliable data management infrastructure on demand. In this paper we argue that astronomy should outsource our data management needs to the commercial cloud thereby allowing us to focus on our core competencies of data calibration and science exploitation.",
        "bibstem":["BAAS",
          "BAAS...51"],
        "database":["astronomy"],
        "doi":["10.48550/arXiv.1907.06320"],
        "page":["55"],
        "title":["Astronomy should be in the clouds"],
        "volume":"51",
        "year":"2019"},
      {
        "bibcode":"2019BAAS...51g.265H",
        "abstract":"Open-source software (OSS) promotes reproducibility and efficiency in science. The most popular OSS framework in astrophysics is the Python Numerical Core (PNC), including the NumPy, SciPy, Matplotlib, Pandas, and Scikit-learn packages. With over 5,000,000 users, these projects have grown beyond the volunteer scale and require financial support.",
        "bibstem":["BAAS",
          "BAAS...51"],
        "database":["astronomy"],
        "page":["265"],
        "title":["Support the Python Numerical Core"],
        "volume":"51",
        "year":"2019"},
      {
        "bibcode":"2019BAAS...51c.271L",
        "abstract":"The primary objective of this white paper is to illustrate the importance of the thermal infrared in characterizing terrestrial planets leveraging our experience in characterizing extra-solar jovian worlds.",
        "bibstem":["BAAS",
          "BAAS...51"],
        "database":["astronomy"],
        "page":["271"],
        "title":["The Importance of Thermal Emission Spectroscopy for Understanding Terrestrial Exoplanets"],
        "volume":"51",
        "year":"2019"},
      {
        "bibcode":"2019BAAS...51c.414H",
        "abstract":"This white paper elaborates on the need for a quantitative biosignature identification and assessment framework to produce a numerical estimate for the likelihood that a given world has life. This will provide a comprehensive means to weigh planetary habitability alongside potential biosignatures and their respective false positives.",
        "bibstem":["BAAS",
          "BAAS...51"],
        "database":["astronomy"],
        "page":["414"],
        "title":["A Balancing Act: Biosignature and Anti-Biosignature Studies in the Next Decade and Beyond"],
        "volume":"51",
        "year":"2019"},
      {
        "bibcode":"2019astro2020T.528D",
        "abstract":"This white paper reviews the scientific community's ability to use data from future telescopes to search for life on exoplanets. It summarizes products from the Exoplanet Biosignatures Workshop Without Walls (EBWWW). This effort led to papers that constituted the Exoplanet Analysis Group's (ExoPAG) 16th Science Assessment Group (SAG 16).",
        "bibstem":["astro",
          "astro2020"],
        "database":["astronomy"],
        "doi":["10.48550/arXiv.1801.06714"],
        "page":["528"],
        "title":["Life Beyond the Solar System: Remotely Detectable Biosignatures"],
        "volume":"2020",
        "year":"2019"},
      {
        "bibcode":"2016PhRvB..93k5101R",
        "abstract":"Atomically engineered oxide heterointerfaces show a range of novel phenomena not present in their bulk form, thus providing an additional knob to tune the functional properties across such interfaces. Here we show that for an oxide Schottky interface between metallic SrRuO<SUB>3</SUB> and semiconducting Nb doped SrTiO<SUB>3</SUB> (Nb:STO) the terminating surface of the substrate plays a crucial role in determining the electronic transport across it. Interestingly this is achieved by engineering a monolayer of a charge-neutral SrO layer across the Schottky interface and not by the insertion of charged layers at the interface, as has been demonstrated earlier. These changes in the energy-band line-up across a symmetric interface indicate the presence of different polar characters at the SrO and TiO<SUB>2</SUB> terminations of the substrate. Owing to the presence of the same AO layer (SrO) in both SrRuO<SUB>3</SUB> and Nb:STO, we propose an intermixing of Ru and Ti ions across the interface for the SrO terminated Nb:STO substrate. First-principles density functional theory calculations on these systems conform with our experimental findings, and indicate a resultant shift in the interfacial atomic plane stacking of SrRuO<SUB>3</SUB> at the intermixed interface, leading to a modification of the electrostatic potential at the interface. The interdependence between the interfacial band alignment to the local atomic plane displacement across an intrinsically nonpolar oxide heterointerface is a key mechanism in realizing novel electronic properties in oxide based devices.",
        "bibstem":["PhRvB",
          "PhRvB..93"],
        "database":["physics"],
        "doi":["10.1103/PhysRevB.93.115101"],
        "page":["115101"],
        "title":["Engineering interfacial energy profile by changing the substrate terminating plane in perovskite heterointerfaces"],
        "volume":"93",
        "year":"2016"},
      {
        "bibcode":"2015PhRvB..92c5405N",
        "abstract":"Combined in situ x-ray photoemission spectroscopy, scanning tunneling spectroscopy, and angle resolved photoemission spectroscopy of molecular beam epitaxy grown Bi<SUB>2</SUB>Te<SUB>3</SUB> on lattice mismatched substrates reveal high quality stoichiometric thin films with topological surface states without a contribution from the bulk bands at the Fermi energy. The absence of bulk states at the Fermi energy is achieved without counterdoping. We observe that the surface morphology and electronic band structure of Bi<SUB>2</SUB>Te<SUB>3</SUB> are not affected by in vacuo storage and exposure to oxygen, whereas major changes are observed when exposed to ambient conditions. These films help define a pathway towards intrinsic topological devices.",
        "bibstem":["PhRvB",
          "PhRvB..92"],
        "database":["physics"],
        "doi":["10.1103/PhysRevB.92.035405",
          "10.48550/arXiv.1502.01185"],
        "page":["035405"],
        "title":["In situ spectroscopy of intrinsic Bi<SUB>2</SUB>Te<SUB>3</SUB> topological insulator thin films and impact of extrinsic defects"],
        "volume":"92",
        "year":"2015"},
      {
        "bibcode":"2014acm..conf..538U",
        "abstract":"In our project, we aim toward constructing Turkish Meteor Surveillance Systems and Network in Turkey. For this goal, video observational systems from SonotaCo (Japan) were chosen. Meteors are going to be observed with the specific cameras, their orbits will be calculated by the software from SonotaCo, and the places where they will be falling / impacting will be examined by field trips. The collected meteorites will be investigated by IR-Raman Spectroscopic techniques and SEM-EDX analyses in order to setup a database. On the other hand, according to our Prime Ministry Ottoman Archives, there are huge amounts of reports of falls for the past centuries. In order to treat these data properly, it is obvious that processing systems should be constructed and developed.",
        "bibstem":["acm",
          "acm..conf"],
        "database":["astronomy"],
        "page":["538"],
        "title":["Turkish meteor surveillance systems and network: Impact craters and meteorites database"],
        "year":"2014"},
      {
        "bibcode":"2010RPDos.138..264Y",
        "bibstem":["RPDos",
          "RPDos.138"],
        "database":["earth science"],
        "doi":["10.1093/rpd/ncp239"],
        "page":["264"],
        "title":["Methods for spectral interference corrections for direct measurements of 234U and 230Th in materials by gamma-ray spectrometry"],
        "volume":"138",
        "year":"2010"},
      {
        "bibcode":"2010JRNC..283..305Y",
        "abstract":"In this paper, a semi-empirical method is proposed to determine true coincidence-summing (TCS) correction factors for high resolution γ-ray spectrometry. It needs the knowledge of both full energy peak (FEP) efficiency and total-to-peak (TTP) efficiency curves. The TTP efficiency curve is established from the measurements with a set of coincidence-free point sources. Whereas for a volume source, the coincidence-free FEP efficiency curve is obtained iteratively by using the peaks from almost the coincidence-free nuclides and those from the coincident nuclides in the mixed standard sources. Then the fitting parameters obtained for both TTP and FEP efficiency curves are combined in a freely-available TCS calculation program called TrueCoinc, which yields the TCS correction factors required for any nuclide. As an application, the TCS correction factors were determined for the particular peaks of <SUP>238</SUP>U, <SUP>226</SUP>Ra and <SUP>232</SUP>Th in the reference materials, measured in the case of a close-in detection geometry using a well-type Ge detector. The present TCS correction method can be applied without difficulty to all Ge detectors for any coincident nuclide.",
        "bibstem":["JRNC",
          "JRNC..283"],
        "database":["earth science"],
        "doi":["10.1007/s10967-009-0360-8"],
        "page":["305"],
        "title":["A semi-empirical method for calculation of true coincidence corrections for the case of a close-in detection in γ-ray spectrometry"],
        "volume":"283",
        "year":"2010"},
      {
        "bibcode":"2010AppRI..68.1040Y",
        "abstract":"In this study, true coincidence-summing (TCS) correction factors have been measured for the sources <SUP>22</SUP>Na, <SUP>60</SUP>Co, <SUP>133</SUP>Ba and <SUP>152</SUP>Eu by use of three large volume coplanar grid CdZnTe (acronym: CZT) detectors. In case of a close-in detection geometry, two different TCS calculation algorithms were used to compute the required TCS correction factors. Both of the algorithms are based on the measured total-to-peak (TTP) ratio and full-energy peak (FEP) efficiency values that were obtained using almost \"single\" energy and coincidence-free nuclides. The results for TCS correction factors obtained by two different algorithms were agreeable to each other. The obtained TCS factors were ranged from about 7% to 30.5% in a 2250 mm <SUP>3</SUP> CZT detector when a close counting geometry was used. For other two detectors with a volume of 1000 and 1687.5 mm <SUP>3</SUP>, the resulted TCS correction factors were relatively smaller and varied between about 0.1% and 20% at the close counting geometry condition. Therefore, the results indicate that there is a need for the estimation of TCS corrections in CZT detectors, especially when their crystal volumes are greater than 1 cm <SUP>3</SUP> and these detectors are used in the case of a close-in detection geometry.",
        "bibstem":["AppRI",
          "AppRI..68"],
        "database":["earth science"],
        "doi":["10.1016/j.apradiso.2010.01.042"],
        "page":["1040"],
        "title":["True coincidence-summing corrections for the coincident γ-rays measured with coplanar grid CdZnTe detectors"],
        "volume":"68",
        "year":"2010"},
      {
        "bibcode":"2009JRNC..280..569Y",
        "abstract":"In this study, the validity of the effective (virtual) point-detector concept for the CdZnTe (CZT) detector for disc-shaped radioisotope sources has been investigated in the photon energy range of 50–662 keV. It has been found that the virtual point-detector model is valid for conventional CZT detectors. The photon energy dependence of the virtual interaction depth (VID) in the CZT detector does not seem to fit to a good trend. However, in general, the measured VID values are increasing with increasing γ-ray energy in the range of 50–662 keV, but the VID values always remain within the physical thickness of the CZT detector. For instance, the VID value was measured to be about 4.4±0.5 mm in the 5 mm thick CZT detector at 662 keV γ-ray energy. In application, the VID values for photons can be used for efficiency calculation models by scaling the measured detection efficiency as a function of energy and source-to-detector distance.",
        "bibstem":["JRNC",
          "JRNC..280"],
        "database":["earth science"],
        "doi":["10.1007/s10967-008-7441-y"],
        "page":["569"],
        "title":["Virtual photon interaction depths of CdZnTe detectors in the energy range of 50–662 keV"],
        "volume":"280",
        "year":"2009"},
      {
        "bibcode":"2009AppRI..67.2049Y",
        "abstract":"In this study, the spectral interferences are investigated for the analytical peaks at 63.3 keV of <SUP>234</SUP>Th and 1001.0 keV of <SUP>234m</SUP>Pa, which are often used in the measurement of <SUP>238</SUP>U activity by the γ-ray spectrometry. The correction methods are suggested to estimate the net peak areas of the γ-rays overlapping the analytical peaks, due to the contribution of <SUP>232</SUP>Th that may not be negligible in materials rich in natural thorium. The activity results for the certified reference materials (CRMs) containing U and Th were measured with a well type Ge detector. The self-absorption and true coincidence-summing (TCS) effects were also taken into account in the measurements. It is found that ignoring the contributions of the interference γ-rays of <SUP>232</SUP>Th and <SUP>235</SUP>U to the mixed peak at 63.3 keV of <SUP>234</SUP>Th (<SUP>238</SUP>U) leads to the remarkably large systematic influence of 0.8-122% in the measured <SUP>238</SUP>U activity, but in case of ignoring the contribution of <SUP>232</SUP>Th via the interference γ-ray at 1000.7 keV of <SUP>228</SUP>Ac to the mixed peak at 1001 keV of <SUP>234m</SUP>Pa (<SUP>238</SUP>U) results in relatively smaller systematic influence of 0.05-3%, depending on thorium contents in the samples. The present results showed that the necessary correction for the spectral interferences besides self-absorption and TCS effects is also very important to obtain more accurate <SUP>238</SUP>U activity results. Additionally, if one ignores the contribution of <SUP>232</SUP>Th to both <SUP>238</SUP>U and <SUP>40</SUP>K activities in materials, the maximum systematic influence on the effective radiation dose is estimated to be ~6% and ~1% via the analytical peaks at 63.3 and 1001 keV for measurement of the <SUP>238</SUP>U activity, respectively.",
        "bibstem":["AppRI",
          "AppRI..67"],
        "database":["earth science"],
        "doi":["10.1016/j.apradiso.2009.07.011"],
        "page":["2049"],
        "title":["Spectral interference corrections for the measurement of <SUP>238</SUP>U in materials rich in thorium by a high resolution γ-ray spectrometry"],
        "volume":"67",
        "year":"2009"}]
  }}
