{
  "announcement_date": "2026-01-21",
  "updated_at": "2026-01-21T08:47:53.820652+00:00",
  "category": "astro-ph.EP",
  "paper_count": 21,
  "papers": [
    {
      "id": "2601.13302v1",
      "title": "The Occurrence Rate of Nearby Planetary Companions to Hot Jupiters",
      "abstract": "Of the > 500 confirmed transiting hot jupiters and approximately 2000 additional candidates today, only ten are known to have nearby companion planets. The survival of nearby companions means that these hot jupiters cannot have migrated to their present location via dynamically disruptive high-eccentricity migration but instead have undergone disk migration or formed in situ. The occurrence rate for these nearby companions, therefore, constrains the relative efficiency of different hot jupiter formation pathways. Here, we perform a uniform box least-squares search for nearby transiting companions to hot jupiters in the first five years of TESS data. Accounting for observational completeness and detection efficiency, we arrive at an occurrence rate of (7.6 (+5.5/-3.8))\\%, which is a lower limit on the fraction of hot jupiters that underwent disk migration or in situ formation. Comparing this rate with that derived from transit-timing variation searches suggests that hot jupiters are likely mostly aligned with their nearby companions, but their apparently higher incidence of grazing transits may point to a slight preferential misalignment. We also synthesize evidence that hot jupiters with nearby companions may have cold companions at a rate similar to that of other hot jupiters. Comprehensive transit, radial velocity, and stellar obliquity measurements in hot jupiter systems with nearby companions will be necessary to fully account for the relative prevalence of proposed hot jupiter formation pathways.",
      "authors": [
        "Lizhou Sha",
        "Andrew M. Vanderburg",
        "Chelsea X. Huang",
        "Samuel Christian",
        "Nicholas Saunders",
        "Khalid Barkaoui",
        "Alexander Belinski",
        "Serge Bergeron",
        "Allyson Bieryla",
        "Karen A. Collins",
        "Giuseppe Conzo",
        "Akihiko Fukui",
        "Tristan Guillot",
        "Kai Ikuta",
        "David W. Latham",
        "Jerome P. de Leon",
        "Bob Massey",
        "Gabriel Murawski",
        "Felipe Murgas",
        "Norio Narita",
        "Mohammad Odeh",
        "Enric Palle",
        "Richard P. Schwarz",
        "Gregor Srdoc",
        "Chris Stockdale",
        "Ian A. Waite",
        "Francis P. Wilkin"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-19",
      "updated": "2026-01-19",
      "pdf_link": "https://arxiv.org/pdf/2601.13302v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.13302v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 41,
      "summary": "**Why It Matters**\n\nHot Jupiters are some of the most extreme worlds we've discovered—massive gas giants that orbit incredibly close to their stars, completing a full year in just a few days. These scorching worlds shouldn't exist where we find them, since planets this large typically form much farther from their stars. Understanding how hot Jupiters ended up in such unlikely places is one of astronomy's biggest puzzles, and solving it could reveal fundamental truths about how planetary systems throughout the galaxy come to be. The key lies in studying their neighboring planets, which act like cosmic breadcrumbs telling the story of each system's violent or gentle past.\n\n**What They Did**\n\nThe researchers analyzed five years of data from TESS, NASA's planet-hunting space telescope, which watches for the tiny dips in starlight that occur when planets pass in front of their stars. They focused specifically on stars already known to host hot Jupiters and searched for signs of additional planets orbiting nearby. Think of it like being a detective examining a crime scene—in this case, looking for witnesses (companion planets) that survived whatever dramatic events moved these gas giants so close to their stars. The team then carefully calculated how often such companion planets actually exist, accounting for the limitations of their detection methods.\n\n**Key Findings**\n\nThe study found that roughly 8% of hot Jupiters have nearby planetary companions—a surprisingly small number that represents only ten confirmed cases out of hundreds of known hot Jupiter systems. This low occurrence rate suggests that most hot Jupiters likely experienced violent migrations that would have ejected or destroyed any neighboring worlds. The researchers also discovered that these rare companion planets tend to orbit in the same plane as their hot Jupiter neighbors, indicating relatively peaceful coexistence.\n\n**Looking Forward**\n\nThis research provides crucial evidence that there are at least two distinct pathways for creating hot Jupiters: a gentle process that preserves companion planets, and a more destructive process that eliminates them. As astronomers discover more of these systems and study them in greater detail, we'll gain deeper insights into the chaotic early lives of planetary systems—including our own solar system's formation billions of years ago.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Hot Jupiters are some of the most extreme worlds we've discovered—massive gas giants that orbit incredibly close to their stars, completing a full year in just a few days. These scorching worlds shouldn't exist where we find them, since planets this large typically form much farther from their stars. Understanding how hot Jupiters ended up in such unlikely places is one of astronomy's biggest puzzles, and solving it could reveal fundamental truths about how planetary systems throughout the galaxy come to be. The key lies in studying their neighboring planets, which act like cosmic breadcrumbs telling the story of each system's violent or gentle past.</p>\n<h4>What They Did</h4>\n<p>The researchers analyzed five years of data from TESS, NASA's planet-hunting space telescope, which watches for the tiny dips in starlight that occur when planets pass in front of their stars. They focused specifically on stars already known to host hot Jupiters and searched for signs of additional planets orbiting nearby. Think of it like being a detective examining a crime scene—in this case, looking for witnesses (companion planets) that survived whatever dramatic events moved these gas giants so close to their stars. The team then carefully calculated how often such companion planets actually exist, accounting for the limitations of their detection methods.</p>\n<h4>Key Findings</h4>\n<p>The study found that roughly 8% of hot Jupiters have nearby planetary companions—a surprisingly small number that represents only ten confirmed cases out of hundreds of known hot Jupiter systems. This low occurrence rate suggests that most hot Jupiters likely experienced violent migrations that would have ejected or destroyed any neighboring worlds. The researchers also discovered that these rare companion planets tend to orbit in the same plane as their hot Jupiter neighbors, indicating relatively peaceful coexistence.</p>\n<h4>Looking Forward</h4>\n<p>This research provides crucial evidence that there are at least two distinct pathways for creating hot Jupiters: a gentle process that preserves companion planets, and a more destructive process that eliminates them. As astronomers discover more of these systems and study them in greater detail, we'll gain deeper insights into the chaotic early lives of planetary systems—including our own solar system's formation billions of years ago.</p>",
      "tweet_hook": {
        "hook": "🔥 Hot Jupiters with planetary neighbors hold the key to solving a major mystery in astronomy",
        "claim": "Only 7.6% of hot Jupiters have nearby companion planets - revealing that most migrated through violent, disruptive pathways rather than gentle disk migration",
        "evidence": "Out of >500 confirmed transiting hot Jupiters studied with 5 years of TESS data, we found only ~10 systems with nearby planetary companions",
        "question": "Could this low companion rate mean most hot Jupiters had chaotic, destructive origins? 🤔"
      },
      "figure_url": "https://arxiv.org/html/2601.13302v1/x1.png"
    },
    {
      "id": "2601.12556v1",
      "title": "Analytic Modeling of Tidally Locked Rocky Planet Atmospheres Across Dynamical Regimes",
      "abstract": "We present a new first-principles analytic approach to interpreting eclipses and phase curves of rocky planets. Observations with JWST have reported nondetections of atmospheres around the majority of hot rocky planets orbiting M dwarfs. However, most of these \"bare rock\" inferences are based on models that are ill-suited to many currently observable planets, as they were developed for use on cooler, slower-rotating bodies. In particular, these models rely on the weak temperature gradient assumption, in which rotation is neglected and temperature gradients can be simply related to wind speeds. We find that this assumption may not be valid for over 40% of terrestrials observed with JWST, including TRAPPIST-1b, GJ 367b, and TOI-2445b. Our simple new four-box model does not rely on this assumption, and instead allows the heat transport efficiency to be specified or follow scalings derived herein. This method is fast, interpretable, physically motivated, reproduces previous general circulation model results, and can be used as a starting point for more detailed modeling. We observe that the longitudinal temperature structure of tidally locked terrestrials depends strongly on the atmospheric circulation. Considering the applicable range of atmospheric dynamical regimes, we find that a given planet's nightside temperature can plausibly vary by 100s of Kelvin (from detectable to undetectable). Furthermore, a planet's dayside energy balance can display complex behavior, with degeneracies between surface pressure and dayside temperature. Illustrating an application to observations, we find that assumptions about atmospheric dynamics and longitudinal temperature structure can bias atmospheric constraints at the order-of-magnitude level.",
      "authors": [
        "Christopher P. Wirth",
        "Diana Powell",
        "Robin Wordsworth"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-18",
      "updated": "2026-01-18",
      "pdf_link": "https://arxiv.org/pdf/2601.12556v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.12556v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 41,
      "summary": "**Why It Matters**\n\nImagine trying to determine if a distant house has heating by measuring its temperature from miles away—that's essentially what astronomers face when studying planets around other stars. With the James Webb Space Telescope now peering at rocky planets similar to Earth, we're getting our first real glimpse of what these distant worlds might be like. But here's the problem: many of these planets appear to be \"bare rock\" with no atmospheres at all. This research suggests we might be drawing the wrong conclusions because we're using the wrong tools to interpret what we're seeing. Understanding whether rocky planets can hold onto their atmospheres is crucial for determining if any of them could potentially support life.\n\n**What They Did**\n\nThe researchers developed a new mathematical model to better understand the climates of tidally locked planets—worlds where one side always faces their star (like how one side of the Moon always faces Earth). Previous models made simplifying assumptions that work well for slowly rotating planets like Earth, but break down for these extreme worlds that whip around their stars in just days or weeks. Instead of relying on these outdated assumptions, the team created a \"four-box model\" that treats the planet like four connected regions and allows heat to move between them more realistically. They tested this model against computer simulations and observations from the James Webb Space Telescope.\n\n**Key Findings**\n\nThe results were striking: a planet's nightside temperature could vary by hundreds of degrees Kelvin depending on how efficiently its atmosphere transports heat—the difference between being detectable by our telescopes or completely invisible. The team found that over 40% of rocky planets observed by James Webb, including several in the famous TRAPPIST-1 system, might be misunderstood by current models. Most surprisingly, atmospheric assumptions could throw off temperature estimates by order-of-magnitude levels, meaning some planets we've labeled as \"airless\" might actually have substantial atmospheres.\n\n**Looking Forward**\n\nThis research could revolutionize how we interpret observations of rocky exoplanets. Rather than hastily concluding that most hot rocky planets are bare, astronomers now have better tools to detect thin atmospheres that might have been missed. This is particularly exciting for studying potentially habitable worlds, as it suggests atmospheres might survive in places we didn't expect—expanding our search for planets that could support life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to determine if a distant house has heating by measuring its temperature from miles away—that's essentially what astronomers face when studying planets around other stars. With the James Webb Space Telescope now peering at rocky planets similar to Earth, we're getting our first real glimpse of what these distant worlds might be like. But here's the problem: many of these planets appear to be \"bare rock\" with no atmospheres at all. This research suggests we might be drawing the wrong conclusions because we're using the wrong tools to interpret what we're seeing. Understanding whether rocky planets can hold onto their atmospheres is crucial for determining if any of them could potentially support life.</p>\n<h4>What They Did</h4>\n<p>The researchers developed a new mathematical model to better understand the climates of tidally locked planets—worlds where one side always faces their star (like how one side of the Moon always faces Earth). Previous models made simplifying assumptions that work well for slowly rotating planets like Earth, but break down for these extreme worlds that whip around their stars in just days or weeks. Instead of relying on these outdated assumptions, the team created a \"four-box model\" that treats the planet like four connected regions and allows heat to move between them more realistically. They tested this model against computer simulations and observations from the James Webb Space Telescope.</p>\n<h4>Key Findings</h4>\n<p>The results were striking: a planet's nightside temperature could vary by hundreds of degrees Kelvin depending on how efficiently its atmosphere transports heat—the difference between being detectable by our telescopes or completely invisible. The team found that over 40% of rocky planets observed by James Webb, including several in the famous TRAPPIST-1 system, might be misunderstood by current models. Most surprisingly, atmospheric assumptions could throw off temperature estimates by order-of-magnitude levels, meaning some planets we've labeled as \"airless\" might actually have substantial atmospheres.</p>\n<h4>Looking Forward</h4>\n<p>This research could revolutionize how we interpret observations of rocky exoplanets. Rather than hastily concluding that most hot rocky planets are bare, astronomers now have better tools to detect thin atmospheres that might have been missed. This is particularly exciting for studying potentially habitable worlds, as it suggests atmospheres might survive in places we didn't expect—expanding our search for planets that could support life.</p>",
      "tweet_hook": {
        "hook": "JWST might be missing rocky planet atmospheres that are actually there! 🧵",
        "claim": "Our new models show that current 'bare rock' conclusions may be wrong for 40%+ of hot rocky planets, including famous TRAPPIST-1b",
        "evidence": "Same planet's nightside temperature can vary by 100s of Kelvin depending on atmospheric circulation - from detectable to invisible",
        "question": "How many exoplanet atmospheres have we incorrectly ruled out? 🤔"
      },
      "figure_url": "https://arxiv.org/html/2601.12556v1/x1.png"
    },
    {
      "id": "2601.13104v1",
      "title": "BOWIE-ALIGN: Sub-solar C/O ratio and metallicity atmosphere of the misaligned hot Jupiter HAT-P-30b",
      "abstract": "We present the JWST NIRSpec/G395H transmission spectrum of the misaligned hot Jupiter HAT-P-30b from 2.8--5.2 μm as part of the BOWIE-ALIGN survey, a comparative survey designed to probe the link between planet formation and atmospheric composition in samples of misaligned and aligned hot Jupiters orbiting F-type stars. Through independent data reductions and retrieval analyses, we find evidence for absorption features of H_2O and CO_2 in the atmosphere of HAT-P-30b. Our retrieved abundances are consistent with equilibrium chemistry, from which we infer a sub-solar C/O ratio (0.16--0.45), and sub-solar and sub-stellar metallicity (0.2--0.8×solar, compared to a stellar metallicity of 1.1--1.6×solar), with muted spectral features. This composition challenges formation models of continuous migration and accretion within a steady disc of stellar metallicity, and could be the result of low C/O ratio gas accretion within the water ice line, low metallicity accretion due to the trapping of volatiles further out in the disc, or the combined accretion of low metallicity gas and carbon-poor solids.",
      "authors": [
        "Alastair B. Claringbold",
        "Chloe E. Fisher",
        "James Kirk",
        "Eva-Maria Ahrer",
        "Anna B. T. Penzlin",
        "Daniel P. Thorngren",
        "Mercedes López-Morales",
        "Peter J. Wheatley",
        "Lili Alderson",
        "Richard A. Booth",
        "Duncan A. Christie",
        "Charlotte Fairman",
        "Nathan J. Mayne",
        "Mason McCormack",
        "Annabella Meech",
        "James E. Owen",
        "Vatsal Panwar",
        "Denis E. Sergeev",
        "Daniel Valentine",
        "Hannah R. Wakeford",
        "Maria Zamyatina"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-19",
      "updated": "2026-01-19",
      "pdf_link": "https://arxiv.org/pdf/2601.13104v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.13104v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 39,
      "summary": "**Why It Matters**\n\nImagine trying to solve a cosmic mystery: how do planets form around distant stars? Scientists are getting closer to cracking this puzzle by studying the atmospheres of \"hot Jupiters\"—massive planets that orbit extremely close to their stars. These scorching worlds act like time capsules, preserving clues about their birth billions of years ago. By analyzing what gases make up their atmospheres, astronomers can work backwards to understand where and how these planets originally formed, then trace their dramatic journey to their current positions. This research helps us understand not just alien worlds, but the fundamental processes that shape planetary systems throughout our galaxy.\n\n**What They Did**\n\nResearchers used the James Webb Space Telescope, humanity's most powerful space observatory, to peer into the atmosphere of a distant planet called HAT-P-30b. This hot Jupiter is located about 700 light-years away and has an unusual characteristic—it orbits its star at a tilted angle, like a spinning top that's been knocked askew. The team captured starlight filtering through the planet's atmosphere as it passed in front of its star, similar to how we might study a soap bubble by looking at light shining through it. By breaking this light into its component colors and examining which wavelengths were absorbed, they could identify specific molecules floating in the planet's atmospheric layers.\n\n**Key Findings**\n\nThe atmosphere contains water vapor and carbon dioxide, but in unexpected proportions. The planet has a surprisingly low ratio of carbon to oxygen—between 16% and 45% of what we see in our Sun—and overall contains fewer heavy elements than expected. Most intriguingly, the planet's atmosphere is actually less metal-rich than its host star, which is quite unusual since planets typically form from the same material as their stars.\n\n**Looking Forward**\n\nThese findings challenge current theories about how hot Jupiters form and migrate. The unusual atmospheric composition suggests this planet may have formed in the cooler, outer regions of its solar system before spiraling inward, gathering specific types of materials along the way. This research is part of a larger survey comparing tilted and aligned hot Jupiters, which could revolutionize our understanding of planetary formation and the incredible journeys these worlds take through space.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to solve a cosmic mystery: how do planets form around distant stars? Scientists are getting closer to cracking this puzzle by studying the atmospheres of \"hot Jupiters\"—massive planets that orbit extremely close to their stars. These scorching worlds act like time capsules, preserving clues about their birth billions of years ago. By analyzing what gases make up their atmospheres, astronomers can work backwards to understand where and how these planets originally formed, then trace their dramatic journey to their current positions. This research helps us understand not just alien worlds, but the fundamental processes that shape planetary systems throughout our galaxy.</p>\n<h4>What They Did</h4>\n<p>Researchers used the James Webb Space Telescope, humanity's most powerful space observatory, to peer into the atmosphere of a distant planet called HAT-P-30b. This hot Jupiter is located about 700 light-years away and has an unusual characteristic—it orbits its star at a tilted angle, like a spinning top that's been knocked askew. The team captured starlight filtering through the planet's atmosphere as it passed in front of its star, similar to how we might study a soap bubble by looking at light shining through it. By breaking this light into its component colors and examining which wavelengths were absorbed, they could identify specific molecules floating in the planet's atmospheric layers.</p>\n<h4>Key Findings</h4>\n<p>The atmosphere contains water vapor and carbon dioxide, but in unexpected proportions. The planet has a surprisingly low ratio of carbon to oxygen—between 16% and 45% of what we see in our Sun—and overall contains fewer heavy elements than expected. Most intriguingly, the planet's atmosphere is actually less metal-rich than its host star, which is quite unusual since planets typically form from the same material as their stars.</p>\n<h4>Looking Forward</h4>\n<p>These findings challenge current theories about how hot Jupiters form and migrate. The unusual atmospheric composition suggests this planet may have formed in the cooler, outer regions of its solar system before spiraling inward, gathering specific types of materials along the way. This research is part of a larger survey comparing tilted and aligned hot Jupiters, which could revolutionize our understanding of planetary formation and the incredible journeys these worlds take through space.</p>",
      "tweet_hook": {
        "hook": "🌟 Hot Jupiter HAT-P-30b is rewriting planetary formation rules with JWST data! 🔭",
        "claim": "This misaligned hot Jupiter has a surprisingly sub-solar C/O ratio (0.16-0.45) and lower metallicity than its host star - defying standard models.",
        "evidence": "JWST detected H₂O and CO₂ absorption, revealing atmospheric composition inconsistent with continuous migration in a steady stellar disc.",
        "question": "How do planets end up with such different chemistry than their birth environment? 🤔"
      },
      "figure_url": "https://arxiv.org/html/2601.13104v1/x1.png"
    },
    {
      "id": "2601.13480v1",
      "title": "Architectures of Exoplanetary Systems. IV: A Multi-planet Model for Reproducing the Radius Valley and Intra-system Size Similarity of Planets around Kepler's FGK Dwarfs",
      "abstract": "The Kepler-observed distribution of planet sizes have revealed two distinct patterns: (1) a radius valley separating super-Earths and sub-Neptunes and (2) a preference for intra-system size similarity. We present a new model for the exoplanet population observed by Kepler, which is a \"hybrid\" of a clustered multi-planet model in which the orbital architectures are set by the angular momentum deficit (AMD) stability (He et al. 2020; arXiv:2007.14473) and a joint mass-radius-period model involving envelope mass-loss driven by photoevaporation (Neil & Rogers 2020; arXiv:1911.03582). We find that the models that produce the deepest radius valleys have a primordial population of planets with initial radii peaking at ~ 2.1 R_⊕, which is subsequently sculpted by photoevaporation into a bimodal distribution of final planet radii. The hybrid model requires strongly clustered initial planet masses in order to match the distributions of the size similarity metrics. Thus, the preference for intra-system radius similarity is well explained by a clustering in the primordial mass distribution. The hybrid model also naturally reproduces the observed radius cliff (steep drop-off beyond ~ 2.5 R_⊕). Our hybrid model is the latest installment of the SysSim forward models, and is the first multi-planet model capable of simultaneously reproducing the observed radius valley and the intra-system size similarity patterns. We compute occurrence rates and fractions of stars with planets for a variety of planet types, and find that the occurrence of Venus and Earth-like planets drops by a factor of ~ 2-4 for the hybrid models compared to previous clustered models in which there is no envelope mass-loss.",
      "authors": [
        "Matthias Y. He",
        "Eric B. Ford"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-20",
      "updated": "2026-01-20",
      "pdf_link": "https://arxiv.org/pdf/2601.13480v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.13480v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 38,
      "summary": "**Why It Matters**\n\nWhen we look up at the night sky, one of humanity's most profound questions is whether Earth-like worlds exist around other stars. NASA's Kepler Space Telescope has discovered thousands of planets orbiting distant stars, revealing surprising patterns that challenge our understanding of how planetary systems form. This research tackles two major mysteries: why planets seem to come in preferred sizes with a conspicuous gap between them, and why planets within the same star system tend to be remarkably similar to each other—unlike our own solar system where tiny Mercury sits alongside giant Jupiter.\n\n**What They Did**\n\nThe researchers created a sophisticated computer model that acts like a planetary system simulator. Think of it as a cosmic recipe book that starts with the \"ingredients\" of planet formation—dust, gas, and rocky cores around young stars—then follows what happens over millions of years. Their model combines two key processes: how planets initially cluster together during formation, and how intense starlight later strips away the thick atmospheres of planets that venture too close to their host stars. By running thousands of simulations with different starting conditions, they could test which scenarios best match what Kepler actually observed in our galaxy.\n\n**Key Findings**\n\nThe model reveals that planets originally formed with radii around 2.1 times Earth's size—bigger than our home planet but smaller than Neptune. Over time, stellar radiation sculpted this single population into two distinct groups: smaller \"super-Earths\" and larger \"sub-Neptunes,\" creating the mysterious gap we observe today. The research also confirms that planets born in the same system start with very similar masses, explaining why they end up looking like siblings. Importantly, the model predicts that truly Earth-like and Venus-like worlds are 2-4 times rarer than previous estimates suggested.\n\n**Looking Forward**\n\nThis breakthrough gives astronomers their first comprehensive framework for understanding planetary diversity across the galaxy. As next-generation telescopes like the James Webb Space Telescope examine these distant worlds in greater detail, this model will help predict which systems are most likely to harbor potentially habitable planets, guiding our search for life beyond Earth.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>When we look up at the night sky, one of humanity's most profound questions is whether Earth-like worlds exist around other stars. NASA's Kepler Space Telescope has discovered thousands of planets orbiting distant stars, revealing surprising patterns that challenge our understanding of how planetary systems form. This research tackles two major mysteries: why planets seem to come in preferred sizes with a conspicuous gap between them, and why planets within the same star system tend to be remarkably similar to each other—unlike our own solar system where tiny Mercury sits alongside giant Jupiter.</p>\n<h4>What They Did</h4>\n<p>The researchers created a sophisticated computer model that acts like a planetary system simulator. Think of it as a cosmic recipe book that starts with the \"ingredients\" of planet formation—dust, gas, and rocky cores around young stars—then follows what happens over millions of years. Their model combines two key processes: how planets initially cluster together during formation, and how intense starlight later strips away the thick atmospheres of planets that venture too close to their host stars. By running thousands of simulations with different starting conditions, they could test which scenarios best match what Kepler actually observed in our galaxy.</p>\n<h4>Key Findings</h4>\n<p>The model reveals that planets originally formed with radii around 2.1 times Earth's size—bigger than our home planet but smaller than Neptune. Over time, stellar radiation sculpted this single population into two distinct groups: smaller \"super-Earths\" and larger \"sub-Neptunes,\" creating the mysterious gap we observe today. The research also confirms that planets born in the same system start with very similar masses, explaining why they end up looking like siblings. Importantly, the model predicts that truly Earth-like and Venus-like worlds are 2-4 times rarer than previous estimates suggested.</p>\n<h4>Looking Forward</h4>\n<p>This breakthrough gives astronomers their first comprehensive framework for understanding planetary diversity across the galaxy. As next-generation telescopes like the James Webb Space Telescope examine these distant worlds in greater detail, this model will help predict which systems are most likely to harbor potentially habitable planets, guiding our search for life beyond Earth.</p>",
      "tweet_hook": {
        "hook": "🌍 Why do planets come in two distinct sizes? New research cracks the cosmic mystery! 🧵",
        "claim": "We've built the first model that explains both the 'radius valley' between super-Earths and sub-Neptunes AND why planets in the same system are similar sizes.",
        "evidence": "Planets start ~2.1 Earth radii, then photoevaporation strips atmospheres to create the bimodal size distribution we observe with Kepler.",
        "question": "But here's the kicker: this means Earth-like planets are 2-4x rarer than we thought. Concerning? 🤔"
      },
      "figure_url": "https://arxiv.org/html/2601.13480v1/x1.png"
    },
    {
      "id": "2601.13176v1",
      "title": "Toward Reliable Interpretations of Small Exoplanet Compositions: Comparisons and Considerations of Equations of State and Materials Used in Common Rocky Planet Models",
      "abstract": "The bulk compositions of small planets (R_p< 2 R_⊕) are directly linked to their formation histories, making reliable compositional constraints imperative for testing models of planet formation and evolution. Because exoplanet interiors cannot be directly observed, their make-up must be inferred from mass-radius-composition models that link assumed stellar abundances to the direct observables: planetary mass and radius. There are a variety of such models in the literature, each adopting different equations of state (EOS) to describe the materials' properties at depth and varying assumptions about the minerals present within the planets. These EOS+mineral suites provide the foundations for compositional inferences, but they have not yet been systematically compared. In this work, we review several suites, with a detailed description of the basic structure, mineral physics, and materials within standard small planet models. We show that EOS+mineral suites predict planet densities whose differences are comparable to current observational uncertainties, which present a challenge for robustly interpreting and classifying small planets. We apply a powerful small-planet characterization framework, which illustrates that variations among EOS+mineral suites lead to inconsistent conclusions for both individual planets and sample-level demographics. Our results demonstrate the need for more careful considerations of the materials and EOS used in mass-radius-composition models, especially given the current focus on finding and characterizing potentially habitable rocky planets. We conclude with recommendations for best practices so that future interpretations of small planets and their formation are accurate and consistent.",
      "authors": [
        "Joseph Schulze",
        "Natalie Hinkel",
        "Wendy Panero",
        "Cayman Unterborn"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-19",
      "updated": "2026-01-19",
      "pdf_link": "https://arxiv.org/pdf/2601.13176v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.13176v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 35,
      "summary": "**Why It Matters**\n\nImagine trying to figure out what's inside a wrapped present just by weighing it and measuring its size. That's essentially what astronomers do when studying small, rocky planets beyond our solar system—called exoplanets. Understanding what these distant worlds are made of is crucial because their composition tells the story of how they formed billions of years ago. With thousands of these planets now discovered, and with the tantalizing possibility that some might harbor life, getting their makeup right has never been more important. But here's the problem: different scientific teams are using different methods to analyze the same planets, and they're reaching conflicting conclusions about what these worlds are actually made of.\n\n**What They Did**\n\nThe researchers acted like scientific detectives, comparing the various \"recipe books\" that astronomers use to interpret exoplanet data. These recipe books contain mathematical descriptions of how different materials—like iron, rock, and ice—behave under the extreme pressures and temperatures found deep inside planets. Think of it like comparing different conversion charts that translate a planet's weight and size into its likely composition. The team gathered several of these widely-used recipe books and tested them on the same set of small planets to see if they would reach similar conclusions about what these worlds contain.\n\n**Key Findings**\n\nThe results were troubling: the different recipe books gave conflicting answers about the same planets. The differences in predicted compositions were large enough to matter—comparable to the uncertainties in our current measurements. This means that when one research team concludes a planet is mostly rocky while another says it's rich in water, both might be \"right\" according to their chosen methods. The researchers found that these disagreements affect not just individual planets, but our understanding of planet populations as a whole.\n\n**Looking Forward**\n\nThis research serves as a wake-up call for the exoplanet community. As we enter an era of discovering potentially habitable worlds, astronomers need to standardize their analysis methods to ensure reliable results. The study provides a roadmap for developing better, more consistent approaches to studying these distant worlds, ultimately improving our ability to identify truly Earth-like planets in our cosmic neighborhood.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to figure out what's inside a wrapped present just by weighing it and measuring its size. That's essentially what astronomers do when studying small, rocky planets beyond our solar system—called exoplanets. Understanding what these distant worlds are made of is crucial because their composition tells the story of how they formed billions of years ago. With thousands of these planets now discovered, and with the tantalizing possibility that some might harbor life, getting their makeup right has never been more important. But here's the problem: different scientific teams are using different methods to analyze the same planets, and they're reaching conflicting conclusions about what these worlds are actually made of.</p>\n<h4>What They Did</h4>\n<p>The researchers acted like scientific detectives, comparing the various \"recipe books\" that astronomers use to interpret exoplanet data. These recipe books contain mathematical descriptions of how different materials—like iron, rock, and ice—behave under the extreme pressures and temperatures found deep inside planets. Think of it like comparing different conversion charts that translate a planet's weight and size into its likely composition. The team gathered several of these widely-used recipe books and tested them on the same set of small planets to see if they would reach similar conclusions about what these worlds contain.</p>\n<h4>Key Findings</h4>\n<p>The results were troubling: the different recipe books gave conflicting answers about the same planets. The differences in predicted compositions were large enough to matter—comparable to the uncertainties in our current measurements. This means that when one research team concludes a planet is mostly rocky while another says it's rich in water, both might be \"right\" according to their chosen methods. The researchers found that these disagreements affect not just individual planets, but our understanding of planet populations as a whole.</p>\n<h4>Looking Forward</h4>\n<p>This research serves as a wake-up call for the exoplanet community. As we enter an era of discovering potentially habitable worlds, astronomers need to standardize their analysis methods to ensure reliable results. The study provides a roadmap for developing better, more consistent approaches to studying these distant worlds, ultimately improving our ability to identify truly Earth-like planets in our cosmic neighborhood.</p>",
      "tweet_hook": {
        "hook": "🧵 We might be getting exoplanet compositions completely wrong. Here's why:",
        "claim": "Different models used to determine rocky exoplanet compositions give conflicting results - even for the same planet's mass and radius data.",
        "evidence": "Variations between equation-of-state models produce density differences comparable to current observational uncertainties.",
        "question": "How can we find habitable worlds if we can't agree on what they're made of? 🪨🌍"
      },
      "figure_url": "https://images.unsplash.com/photo-1614730321146-b6fa6a46bcb4?w=800"
    },
    {
      "id": "2601.14045v1",
      "title": "Discovery and characterisation of two exoplanets orbiting the metal-poor, solar-type star TOI-5788 with TESS, CHEOPS, and HARPS-N",
      "abstract": "We present the discovery and characterisation of two transiting exoplanets orbiting the metal-poor, solar-type star TOI-5788. From our analysis of six TESS sectors and a dedicated CHEOPS programme, we identify an inner planet (TOI-5788~b; P = 6.340758±0.000030\\,) with radius 1.528±0.075\\,R_⊕ and an outer planet (TOI-5788~c; P = 16.213362±0.000026\\,) with radius 2.272±0.039\\,R_⊕. We obtained 125 radial-velocity spectra from HARPS-N and constrain the masses of TOI-5788~b and~c as 3.72±0.94\\,M_⊕ and 6.4±1.2\\,M_⊕, respectively. Although dynamical analyses indicate that a third planet could exist in a stable orbit between 8 and 14 days, we find no evidence of additional planets. Since the TOI-5788 system is one of the few systems with planets straddling the radius gap, and noting that there are even fewer such systems around metal poor stars, it is a promising system to constrain planet formation theories. We therefore model the interior structures of both planets. We find that TOI-5788~b is consistent with being a rocky planet with almost no envelope, or having an atmosphere of a high mean molecular weight. We find that TOI-5788~c is consistent with both gas-dwarf and water-world hypotheses of mini-Neptune formation. We model the atmospheric evolution history of both planets. Whilst both scenarios are consistent with the atmospheric evolution of TOI-5788~c, the gas-dwarf model is marginally preferred. The results of the atmospheric evolution analysis are not strongly dependent on stellar evolution. This makes the system a promising target to test internal structure and atmospheric evolution models.",
      "authors": [
        "Ben S. Lakeland",
        "A. Mortier",
        "R. D. Haywood",
        "S. Ulmer-Moll",
        "Z. Garai",
        "A. Vanderburg",
        "J A. Egger",
        "D. A. Turner",
        "D. Kubyshkina",
        "A. C. M. Correia",
        "H. P. Osborn",
        "L. A. Buchhave",
        "L. Malavolta",
        "A. Bonfanti",
        "W. Boschin",
        "A. Cameron",
        "A. Castro-González",
        "R. Cosentino",
        "M. Damasso",
        "X. Dumusque",
        "D. Ehrenreich",
        "Z. Essack",
        "S. Filomeno",
        "L. Fossati",
        "D. Gandolfi",
        "M. Gillon",
        "C. Hedges",
        "M. López-Morales",
        "G. Lacedelli",
        "M. Lendl",
        "J. Maldonado",
        "G. Mantovan",
        "A. F. Martínez Fiorenzano",
        "P. F. L. Maxted",
        "C. Mordasini",
        "B. Nicholson",
        "S. M. O'Brien",
        "L. Palethorpe",
        "E. Palle",
        "M. Pinamonti",
        "D. Rapetti",
        "I. Ribas",
        "N. C. Santos",
        "A. M. Silva",
        "A. Sozzetti",
        "M. Stalport",
        "G. Szabó",
        "S. Udry",
        "M. Vezie",
        "C. A. Watson",
        "T. G. Wilson"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-20",
      "updated": "2026-01-20",
      "pdf_link": "https://arxiv.org/pdf/2601.14045v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.14045v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 32,
      "summary": "**Why It Matters**\n\nImagine finding two siblings in space—one rocky like Earth, the other more like Neptune—orbiting around a star that's quite different from our Sun. That's exactly what astronomers have discovered with the TOI-5788 system, and it's helping us solve one of the biggest puzzles in planet formation. This star is \"metal-poor,\" meaning it has fewer heavy elements than our Sun, yet it managed to create two fascinating worlds. Understanding how planets form around different types of stars gives us crucial insights into how common Earth-like worlds might be throughout the galaxy, and ultimately, how special our own solar system really is.\n\n**What They Did**\n\nThe research team used three powerful space-based and ground-based telescopes working together like a cosmic detective squad. First, NASA's TESS satellite spotted tiny dips in starlight as the planets crossed in front of their star—think of it like watching the shadow of a moth flying past a streetlight. The European CHEOPS mission provided additional observations to nail down the planets' sizes with precision. Finally, the HARPS-N instrument measured the subtle wobble these planets create in their star's motion as they orbit, allowing scientists to calculate their masses. It's like determining someone's weight by watching how much they make a seesaw tip.\n\n**Key Findings**\n\nThe team discovered two remarkable worlds: TOI-5788 b, the inner planet, is about 1.5 times Earth's width and nearly four times its mass—making it a \"super-Earth\" that's likely rocky with little to no atmosphere. The outer planet, TOI-5788 c, is over twice Earth's size and six times heavier, placing it in the \"mini-Neptune\" category. What makes this discovery special is that these planets straddle the mysterious \"radius gap\"—a size range where few planets are found, suggesting something dramatic happens during planet formation.\n\n**Looking Forward**\n\nThis system is a natural laboratory for testing our theories about how planets evolve. Scientists can now study whether mini-Neptunes like TOI-5788 c formed as gas-rich worlds or water-rich \"ocean planets,\" and why some planets retain thick atmospheres while others lose them entirely. With future observations, this system could help us predict what types of planets form around the most common stars in our galaxy.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine finding two siblings in space—one rocky like Earth, the other more like Neptune—orbiting around a star that's quite different from our Sun. That's exactly what astronomers have discovered with the TOI-5788 system, and it's helping us solve one of the biggest puzzles in planet formation. This star is \"metal-poor,\" meaning it has fewer heavy elements than our Sun, yet it managed to create two fascinating worlds. Understanding how planets form around different types of stars gives us crucial insights into how common Earth-like worlds might be throughout the galaxy, and ultimately, how special our own solar system really is.</p>\n<h4>What They Did</h4>\n<p>The research team used three powerful space-based and ground-based telescopes working together like a cosmic detective squad. First, NASA's TESS satellite spotted tiny dips in starlight as the planets crossed in front of their star—think of it like watching the shadow of a moth flying past a streetlight. The European CHEOPS mission provided additional observations to nail down the planets' sizes with precision. Finally, the HARPS-N instrument measured the subtle wobble these planets create in their star's motion as they orbit, allowing scientists to calculate their masses. It's like determining someone's weight by watching how much they make a seesaw tip.</p>\n<h4>Key Findings</h4>\n<p>The team discovered two remarkable worlds: TOI-5788 b, the inner planet, is about 1.5 times Earth's width and nearly four times its mass—making it a \"super-Earth\" that's likely rocky with little to no atmosphere. The outer planet, TOI-5788 c, is over twice Earth's size and six times heavier, placing it in the \"mini-Neptune\" category. What makes this discovery special is that these planets straddle the mysterious \"radius gap\"—a size range where few planets are found, suggesting something dramatic happens during planet formation.</p>\n<h4>Looking Forward</h4>\n<p>This system is a natural laboratory for testing our theories about how planets evolve. Scientists can now study whether mini-Neptunes like TOI-5788 c formed as gas-rich worlds or water-rich \"ocean planets,\" and why some planets retain thick atmospheres while others lose them entirely. With future observations, this system could help us predict what types of planets form around the most common stars in our galaxy.</p>",
      "tweet_hook": {
        "hook": "🌍 Two worlds straddling the 'radius gap' around a metal-poor star just changed planet formation theory",
        "claim": "TOI-5788 hosts rare planets spanning the radius gap (1.5-2.3 Earth radii) around a metal-poor star - a perfect lab for testing formation models",
        "evidence": "TESS, CHEOPS & HARPS-N revealed one rocky world (3.7 Earth masses) and one mini-Neptune (6.4 Earth masses) in a 6.3 & 16.2 day orbit",
        "question": "How do planets form when heavy elements are scarce? This system holds crucial clues 🧵"
      },
      "figure_url": "https://arxiv.org/html/2601.14045v1/transit_lc_final.png"
    },
    {
      "id": "2601.14177v1",
      "title": "Pre-computed aerosol extinction, scattering and asymmetry grids for scalable atmospheric retrievals",
      "abstract": "The unprecedented wavelength coverage and sensitivity of the James Webb Space Telescope (JWST) permits to measure the absorption features of a wide range of condensate species from Silicates to Titan tholins. Atmospheric retrievals are uniquely suited to analyse these datasets and characterize the aerosols present in exoplanet atmospheres. However, including the optical properties of condensed particles within retrieval frameworks remains computationally expensive, limiting our ability to fully exploit JWST observations. In this work, we improve the computational efficiency and scaling behavior of aerosol models in atmospheric retrievals, enabling in-depth studies including multiple condensate species within practical time scales. Rather than computing the aerosol Mie coefficients for each sampled model, we pre-compute extinction efficiency (Qext), scattering efficiency (Qscat) and asymmetry parameter (g) grids for seven condensate species relevant in exoplanet atmospheres (Mg2SiO4 amorph sol - gel, MgSiO3 amorph glass, MgSiO3 amorph sol - gel, SiO2 alpha, SiO2 amorph, SiO and Titan tholins). The pre-computed Qext grids significantly reduce computation time between 1.4 and 17 times with negligible differences on the retrieved parameters. They also scale effortlessly with the number of aerosol species while maintaining the accuracy of cloud models. Thereby enabling more complex retrievals as well as broader population studies without increasing the overall error budget. The Qext, Qscat and g grids are freely available on Zenodo as well as a public TauREx plugin -TauREx-PCQ- that utilize them.",
      "authors": [
        "Maël M. Voyer",
        "Quentin Changeat"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "published": "2026-01-20",
      "updated": "2026-01-20",
      "pdf_link": "https://arxiv.org/pdf/2601.14177v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.14177v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 29,
      "summary": "**Why It Matters**\n\nImagine trying to figure out what clouds are made of by looking at them from hundreds of miles away—that's essentially what scientists do when studying planets outside our solar system. The James Webb Space Telescope, our most powerful space observatory, can detect incredibly faint light from these distant worlds and reveal what's floating in their atmospheres. These alien clouds might contain exotic materials like liquid glass droplets or complex organic compounds similar to the hazy particles on Saturn's moon Titan. Understanding these atmospheric ingredients helps us learn how planets form and whether they might be suitable for life. But there's a catch: analyzing this data requires enormous amounts of computer processing power, often taking so long that scientists can only study a few planets at a time.\n\n**What They Did**\n\nThe researchers tackled this computational bottleneck by creating a cosmic shortcut. Instead of having computers calculate the light-scattering properties of cloud particles from scratch every single time they analyze a planet, they pre-calculated these properties for seven important types of space dust and stored them in ready-to-use digital tables. Think of it like meal prepping for science—instead of cooking from scratch each time you're hungry, you prepare ingredients in advance and just heat them up when needed. These materials include various forms of silicates (similar to volcanic glass) and organic compounds that could exist in alien atmospheres. The team then made these computational tools freely available to other researchers worldwide.\n\n**Key Findings**\n\nThe pre-computed tables dramatically sped up the analysis process, making calculations between 1.4 and 17 times faster depending on the specific material being studied. Most importantly, this speed boost came with virtually no loss in accuracy—the results were essentially identical to the slower, traditional methods. The system also scales efficiently, meaning scientists can now study multiple types of atmospheric particles simultaneously without exponentially increasing computation time.\n\n**Looking Forward**\n\nThis breakthrough means astronomers can now conduct broader surveys of exoplanet atmospheres and study multiple worlds in the time it previously took to analyze just one. As James Webb continues discovering new planets, scientists will be better equipped to quickly identify patterns across different atmospheric compositions, potentially revealing new insights about planetary formation and the prevalence of potentially habitable worlds.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to figure out what clouds are made of by looking at them from hundreds of miles away—that's essentially what scientists do when studying planets outside our solar system. The James Webb Space Telescope, our most powerful space observatory, can detect incredibly faint light from these distant worlds and reveal what's floating in their atmospheres. These alien clouds might contain exotic materials like liquid glass droplets or complex organic compounds similar to the hazy particles on Saturn's moon Titan. Understanding these atmospheric ingredients helps us learn how planets form and whether they might be suitable for life. But there's a catch: analyzing this data requires enormous amounts of computer processing power, often taking so long that scientists can only study a few planets at a time.</p>\n<h4>What They Did</h4>\n<p>The researchers tackled this computational bottleneck by creating a cosmic shortcut. Instead of having computers calculate the light-scattering properties of cloud particles from scratch every single time they analyze a planet, they pre-calculated these properties for seven important types of space dust and stored them in ready-to-use digital tables. Think of it like meal prepping for science—instead of cooking from scratch each time you're hungry, you prepare ingredients in advance and just heat them up when needed. These materials include various forms of silicates (similar to volcanic glass) and organic compounds that could exist in alien atmospheres. The team then made these computational tools freely available to other researchers worldwide.</p>\n<h4>Key Findings</h4>\n<p>The pre-computed tables dramatically sped up the analysis process, making calculations between 1.4 and 17 times faster depending on the specific material being studied. Most importantly, this speed boost came with virtually no loss in accuracy—the results were essentially identical to the slower, traditional methods. The system also scales efficiently, meaning scientists can now study multiple types of atmospheric particles simultaneously without exponentially increasing computation time.</p>\n<h4>Looking Forward</h4>\n<p>This breakthrough means astronomers can now conduct broader surveys of exoplanet atmospheres and study multiple worlds in the time it previously took to analyze just one. As James Webb continues discovering new planets, scientists will be better equipped to quickly identify patterns across different atmospheric compositions, potentially revealing new insights about planetary formation and the prevalence of potentially habitable worlds.</p>",
      "tweet_hook": {
        "hook": "🌍 JWST is revolutionizing how we study alien atmospheres, but there's a computational bottleneck...",
        "claim": "New pre-computed aerosol grids make exoplanet atmospheric analysis 1.4-17x faster, enabling studies of multiple cloud species in practical time",
        "evidence": "We created grids for 7 key condensate species (silicates to Titan tholins) that maintain accuracy while dramatically reducing computation time",
        "question": "What alien worlds will we unlock when cloud analysis becomes this accessible? 🚀"
      },
      "figure_url": "https://arxiv.org/html/2601.14177v1/TitanTholin_MieQ_time_calibration.png"
    },
    {
      "id": "2601.14254v1",
      "title": "Using observations of escaping H/He to constrain the atmospheric composition of sub-Neptunes",
      "abstract": "The internal composition of sub-Neptunes remains a prominent unresolved question in exoplanetary science. We present a technique to place constraints on envelope mean molecular weight that utilises observations of escaping hydrogen or helium exospheres. This method is based on a simple timescale argument, which states that sub-Neptunes require a sufficiently large hydrogen or helium reservoir to explain on-going escape at their observed rates. This then naturally leads to an upper limit on atmospheric mean molecular weight. We apply this technique to archetypal sub-Neptunes, namely GJ-436 b, TOI-776 b and TOI-776 c, which have all been observed to be losing significant hydrogen content as well as relatively featureless transit spectra when observed with JWST. Combining constraints from atmospheric escape and transit spectroscopy in the case of TOI-776 c allows us to tentatively rule out the high mean molecular weight scenario, pointing towards a low mean molecular weight atmosphere with high-altitude aerosols muting spectral features in the infra-red. Finally, we reframe our analysis to the hycean candidate K2-18 b, which has also been shown to host a tentative escaping hydrogen exosphere. If such a detection is robust, we infer a hydrogen-rich envelope mass fraction of f_env = -1.67±0.78, which is inconsistent with the hycean scenario at the ~ 4σ level. This latter result requires further observational follow-up to confirm.",
      "authors": [
        "James G. Rogers",
        "James E. Owen",
        "Ethan Schreyer",
        "James Kirk"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-20",
      "updated": "2026-01-20",
      "pdf_link": "https://arxiv.org/pdf/2601.14254v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.14254v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 21,
      "summary": "**Why It Matters**\n\nImagine trying to figure out what's inside a wrapped gift just by watching steam escape from it. That's essentially what astronomers are doing with a mysterious class of planets called sub-Neptunes—worlds larger than Earth but smaller than Neptune that are surprisingly common throughout our galaxy, yet completely absent from our own solar system. Understanding what these alien worlds are made of is crucial because they represent the most abundant type of planet we've discovered so far. Are they rocky planets with thick atmospheres, or mini gas giants? The answer could reshape our understanding of how planetary systems form and evolve.\n\n**What They Did**\n\nThe researchers developed a clever detective technique by studying hydrogen and helium gas streaming away from these planets into space—like observing steam rising from a hot cup of coffee. When planets lose atmosphere to space, they need a large reservoir of light gases to sustain this escape over long periods. The team used this principle as a cosmic scale: if a planet is losing gas at the rates we observe, it must contain enough hydrogen and helium to keep this process going. They then applied this method to several well-studied sub-Neptunes, including planets orbiting stars called GJ-436, TOI-776, and the intriguing world K2-18 b, which some scientists thought might be an ocean planet with a habitable environment.\n\n**Key Findings**\n\nThe analysis revealed that these sub-Neptunes likely have atmospheres dominated by lightweight hydrogen and helium, rather than heavier gases like water vapor or carbon dioxide. For the TOI-776 planets, the evidence strongly suggests their atmospheres are hydrogen-rich but obscured by high-altitude clouds or hazes that hide their true composition from our telescopes. Most surprisingly, the results cast serious doubt on K2-18 b being a habitable ocean world—if the hydrogen loss measurements are accurate, this planet appears to have far too much hydrogen in its atmosphere to support the watery environment scientists had hoped for.\n\n**Looking Forward**\n\nThis research provides astronomers with a powerful new tool for studying distant worlds by connecting atmospheric escape with planetary composition. As we discover more sub-Neptunes and observe them with advanced telescopes, this technique could help solve one of exoplanet science's biggest puzzles: understanding the nature of the galaxy's most common planets and how they fit into the story of planetary formation.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to figure out what's inside a wrapped gift just by watching steam escape from it. That's essentially what astronomers are doing with a mysterious class of planets called sub-Neptunes—worlds larger than Earth but smaller than Neptune that are surprisingly common throughout our galaxy, yet completely absent from our own solar system. Understanding what these alien worlds are made of is crucial because they represent the most abundant type of planet we've discovered so far. Are they rocky planets with thick atmospheres, or mini gas giants? The answer could reshape our understanding of how planetary systems form and evolve.</p>\n<h4>What They Did</h4>\n<p>The researchers developed a clever detective technique by studying hydrogen and helium gas streaming away from these planets into space—like observing steam rising from a hot cup of coffee. When planets lose atmosphere to space, they need a large reservoir of light gases to sustain this escape over long periods. The team used this principle as a cosmic scale: if a planet is losing gas at the rates we observe, it must contain enough hydrogen and helium to keep this process going. They then applied this method to several well-studied sub-Neptunes, including planets orbiting stars called GJ-436, TOI-776, and the intriguing world K2-18 b, which some scientists thought might be an ocean planet with a habitable environment.</p>\n<h4>Key Findings</h4>\n<p>The analysis revealed that these sub-Neptunes likely have atmospheres dominated by lightweight hydrogen and helium, rather than heavier gases like water vapor or carbon dioxide. For the TOI-776 planets, the evidence strongly suggests their atmospheres are hydrogen-rich but obscured by high-altitude clouds or hazes that hide their true composition from our telescopes. Most surprisingly, the results cast serious doubt on K2-18 b being a habitable ocean world—if the hydrogen loss measurements are accurate, this planet appears to have far too much hydrogen in its atmosphere to support the watery environment scientists had hoped for.</p>\n<h4>Looking Forward</h4>\n<p>This research provides astronomers with a powerful new tool for studying distant worlds by connecting atmospheric escape with planetary composition. As we discover more sub-Neptunes and observe them with advanced telescopes, this technique could help solve one of exoplanet science's biggest puzzles: understanding the nature of the galaxy's most common planets and how they fit into the story of planetary formation.</p>",
      "tweet_hook": {
        "hook": "🧵 THREAD: We cracked the code on what sub-Neptune atmospheres are actually made of",
        "claim": "By watching planets lose their atmospheres, we can determine if they have heavy or light gases - revolutionizing how we study distant worlds",
        "evidence": "Applied to K2-18b: if hydrogen escape is real, it rules out the 'hycean world' scenario at ~4σ confidence - it's not the ocean world we thought",
        "question": "Could atmospheric escape be the key to unlocking exoplanet composition mysteries? 🌌"
      },
      "figure_url": "https://arxiv.org/html/2601.14254v1/x1.png"
    },
    {
      "id": "2601.14214v1",
      "title": "The PAIRS project: a global formation model for planets in binaries. I. Effect of disc truncation on the growth of S-type planets",
      "abstract": "Binary stars are as common as single stars. The number of detected planets orbiting binaries is rapidly increasing thanks to the synergy between transit surveys, Gaia and high-resolution direct imaging campaigns. However, global planet formation models around binary stars are still underdeveloped, which limits the theoretical understanding of planets orbiting binary star systems. Hereby we introduce the PAIRS project, which aims at building a global planet formation model for planets in binaries, and to produce planet populations synthesis to statistically compare theory and observations. In this first paper, we present the adaptation of the circumstellar disc to simulate the formation of S-type planets. The presence of a secondary star tidally truncates and heats the outer part of the circumprimary disc (and vice-versa for the circumsecondary disc), limiting the material to form planets. We implement and quantify this effect for a range of binary parameters by adapting the Bern Model of planet formation in its pebble-based form and for in-situ planet growth. We find that the disc truncation has a strong impact on reducing the pebble supply for core growth, steadily suppressing planet formation for binary separations below 160 au, when considering all the formed planets more massive than Mars. We find as well that S-type planets tend to form close to the central star with respect to the binary separation and disc truncation radius. Our newly developed model will be the basis of future S-type planet population synthesis studies.",
      "authors": [
        "Julia Venturini",
        "Arianna Nigioni",
        "Maria Paula Ronco",
        "Natacha Jungo",
        "Alexandre Emsenhuber"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-20",
      "updated": "2026-01-20",
      "pdf_link": "https://arxiv.org/pdf/2601.14214v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.14214v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 20,
      "summary": "**Why It Matters**\n\nWhen we think of planets like Earth, we picture them orbiting a single star like our Sun. But here's a cosmic plot twist: about half of all stars in our galaxy actually come in pairs, dancing around each other in what astronomers call binary star systems. As our planet-hunting telescopes get better, we're discovering more and more worlds orbiting these stellar duos. Yet scientists have struggled to understand how planets actually form in these crowded cosmic neighborhoods. This research tackles that puzzle, helping us understand whether Earth-like worlds could exist in the most common type of star system in our galaxy—and what that might mean for life beyond our solar system.\n\n**What They Did**\n\nThe researchers created a sophisticated computer model to simulate how planets grow around binary stars, focusing on \"S-type\" planets—worlds that orbit just one star in the pair, like the fictional planet Tatooine from Star Wars (though Tatooine actually orbits both stars). Think of it like modeling how a garden grows when there's a neighbor's house casting shade and creating wind—the second star disrupts the disk of dust and gas around the first star, much like that neighbor affects growing conditions. The team used something called the Bern Model, adapting it to account for how the second star truncates (cuts short) and heats up the planet-forming disk, limiting the raw materials available for building worlds.\n\n**Key Findings**\n\nThe results reveal just how dramatically a stellar companion can crash the planet-formation party. When the two stars are closer than 160 astronomical units apart (about four times the distance from our Sun to Pluto), planet formation gets seriously hampered. The second star essentially steals building materials—tiny particles called pebbles that would normally clump together to form planetary cores. The closer the stellar pair, the more severe this cosmic interference becomes. Interestingly, the planets that do manage to form tend to huddle close to their host star, staying as far as possible from the disruptive influence of the stellar neighbor.\n\n**Looking Forward**\n\nThis breakthrough model opens the door to predicting what kinds of planet populations we should expect to find around binary stars. As space missions like TESS and future telescopes discover more of these worlds, scientists will finally have a theoretical framework to make sense of the observations and determine whether planets in binary systems could harbor the conditions necessary for life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>When we think of planets like Earth, we picture them orbiting a single star like our Sun. But here's a cosmic plot twist: about half of all stars in our galaxy actually come in pairs, dancing around each other in what astronomers call binary star systems. As our planet-hunting telescopes get better, we're discovering more and more worlds orbiting these stellar duos. Yet scientists have struggled to understand how planets actually form in these crowded cosmic neighborhoods. This research tackles that puzzle, helping us understand whether Earth-like worlds could exist in the most common type of star system in our galaxy—and what that might mean for life beyond our solar system.</p>\n<h4>What They Did</h4>\n<p>The researchers created a sophisticated computer model to simulate how planets grow around binary stars, focusing on \"S-type\" planets—worlds that orbit just one star in the pair, like the fictional planet Tatooine from Star Wars (though Tatooine actually orbits both stars). Think of it like modeling how a garden grows when there's a neighbor's house casting shade and creating wind—the second star disrupts the disk of dust and gas around the first star, much like that neighbor affects growing conditions. The team used something called the Bern Model, adapting it to account for how the second star truncates (cuts short) and heats up the planet-forming disk, limiting the raw materials available for building worlds.</p>\n<h4>Key Findings</h4>\n<p>The results reveal just how dramatically a stellar companion can crash the planet-formation party. When the two stars are closer than 160 astronomical units apart (about four times the distance from our Sun to Pluto), planet formation gets seriously hampered. The second star essentially steals building materials—tiny particles called pebbles that would normally clump together to form planetary cores. The closer the stellar pair, the more severe this cosmic interference becomes. Interestingly, the planets that do manage to form tend to huddle close to their host star, staying as far as possible from the disruptive influence of the stellar neighbor.</p>\n<h4>Looking Forward</h4>\n<p>This breakthrough model opens the door to predicting what kinds of planet populations we should expect to find around binary stars. As space missions like TESS and future telescopes discover more of these worlds, scientists will finally have a theoretical framework to make sense of the observations and determine whether planets in binary systems could harbor the conditions necessary for life.</p>",
      "tweet_hook": {
        "hook": "🌌 Half of all stars are in binaries, but we barely understand how planets form around them! 🧵",
        "claim": "New research shows binary companions act like cosmic bulldozers, truncating planet-forming discs and suppressing planet formation below 160 AU separation.",
        "evidence": "The PAIRS project found that tidal truncation dramatically reduces pebble supply for planet cores, forcing S-type planets to huddle close to their host stars.",
        "question": "Could this explain why we find fewer planets in tight binary systems? What do you think? 🤔"
      },
      "figure_url": "https://images.unsplash.com/photo-1506318137071-a8e063b4bec0?w=800"
    },
    {
      "id": "2601.12586v1",
      "title": "The ALMA survey to Resolve exoKuiper belt Substructures (ARKS) V: Comparison between scattered light and thermal emission",
      "abstract": "Debris discs are analogues to our own Kuiper belt around main-sequence stars and are therefore referred to as exoKuiper belts. They have been resolved at high angular resolution at wavelengths spanning the optical to the submillimetre-millimetre regime. Short wavelengths probe the light scattered by such discs, which is dominated by micron-sized dust particles, while millimetre wavelengths probe the thermal emission of millimetre-sized particles. Determining differences in the dust distribution between millimetre- and micron-sized dust is fundamental to revealing the dynamical processes affecting the dust in debris discs. We aim to compare the scattered light from the discs of the ALMA survey to Resolve exoKuiper belt Substructures (ARKS) with the thermal emission probed by ALMA. We focus on the radial distribution of the dust. We used high-contrast scattered light observations obtained with VLT/SPHERE, GPI, and the HST to uniformly study the dust distribution in those systems and compare it to the dust distribution extracted from the ALMA observations carried out in the course of the ARKS project. We also set constraints on the presence of planets by using these high-contrast images combined with exoplanet evolutionary models. 15 of the 24 discs comprising the ARKS sample are detected in scattered light, with TYC9340-437-1 being imaged for the first time at near-infrared wavelengths. For 6 of those 15 discs, the dust surface density seen in scattered light peaks farther out compared to that observed with ALMA. These 6 discs except one are known to also host cold CO gas. Conversely, the systems without significant offsets are not known to host gas, except one. This observational study suggests that the presence of gas in debris discs may affect the small and large grains differently, pushing the small dust to greater distances where the gas is less abundant.",
      "authors": [
        "J. Milli",
        "J. Olofsson",
        "M. Bonduelle",
        "R. Bendahan-West",
        "J. P. Marshall",
        "E. Choquet",
        "A. A. Sefilian",
        "Y. Han",
        "B. Zawadzki",
        "S. Mac Manamon",
        "E. Mansell",
        "C. del Burgo",
        "J. M. Carpenter",
        "A. M. Hughes",
        "M. Booth",
        "E. Chiang",
        "S. Ertel",
        "Th. M. Esposito",
        "Th. Henning",
        "J. Hom",
        "M. R. Jankovic",
        "A. V. Krivov",
        "J. B. Lovell",
        "P. Luppe",
        "M. A. MacGregor",
        "S. Marino",
        "B. C. Matthews",
        "L. Matrà",
        "A. Moór",
        "N. Pawellek",
        "T. D. Pearce",
        "S. Pérez",
        "V. Squicciarin",
        "P. Weber",
        "D. J. Wilner",
        "M. C. Wyatt"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-18",
      "updated": "2026-01-18",
      "pdf_link": "https://arxiv.org/pdf/2601.12586v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.12586v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 16,
      "summary": "**Why It Matters**\n\nImagine if we could peer into other star systems and see cosmic debris fields similar to the icy region beyond Neptune in our own solar system. That's exactly what astronomers are doing when they study \"debris discs\"—the leftover material orbiting distant stars that represents alien versions of our Kuiper Belt. These cosmic junkyards aren't just space curiosities; they're treasure troves of information about how planetary systems form and evolve. By studying the dust and debris swirling around other stars, we can better understand the forces that shaped our own cosmic neighborhood billions of years ago, and potentially discover hidden planets that are stirring up the debris.\n\n**What They Did**\n\nResearchers used a clever detective approach, studying the same debris discs with different types of \"space eyes\" to see what secrets they might reveal. Think of it like examining a dusty room with both a flashlight and a thermal camera—each tool shows you different things. They used powerful telescopes to capture light reflected off tiny dust particles (like seeing dust motes in sunlight), and also used radio telescopes to detect heat given off by larger pebble-sized chunks. By comparing these two views across 24 different star systems, they could map where different sizes of debris were located and see if the patterns matched up or told different stories.\n\n**Key Findings**\n\nThe results were surprising: in 6 out of 15 systems where both types of dust could be seen, the smaller particles were scattered much farther from their stars than the larger chunks—like finding that powder from a demolished building had blown much farther than the rubble. Even more intriguingly, nearly all of these mismatched systems also contained gas, while the systems where small and large debris stayed together were mostly gas-free. This suggests that gas in these debris discs acts like a cosmic wind, pushing lightweight dust particles to the outer edges while leaving heavier material closer in.\n\n**Looking Forward**\n\nThese findings could revolutionize how we search for planets around other stars. Gas-filled debris discs might be cosmic signposts pointing to planetary systems in the making, or indicating invisible planets whose gravity influences how dust and gas move through space. This research brings us closer to understanding the messy, dynamic process of planetary system evolution—and perhaps finding more worlds like our own.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine if we could peer into other star systems and see cosmic debris fields similar to the icy region beyond Neptune in our own solar system. That's exactly what astronomers are doing when they study \"debris discs\"—the leftover material orbiting distant stars that represents alien versions of our Kuiper Belt. These cosmic junkyards aren't just space curiosities; they're treasure troves of information about how planetary systems form and evolve. By studying the dust and debris swirling around other stars, we can better understand the forces that shaped our own cosmic neighborhood billions of years ago, and potentially discover hidden planets that are stirring up the debris.</p>\n<h4>What They Did</h4>\n<p>Researchers used a clever detective approach, studying the same debris discs with different types of \"space eyes\" to see what secrets they might reveal. Think of it like examining a dusty room with both a flashlight and a thermal camera—each tool shows you different things. They used powerful telescopes to capture light reflected off tiny dust particles (like seeing dust motes in sunlight), and also used radio telescopes to detect heat given off by larger pebble-sized chunks. By comparing these two views across 24 different star systems, they could map where different sizes of debris were located and see if the patterns matched up or told different stories.</p>\n<h4>Key Findings</h4>\n<p>The results were surprising: in 6 out of 15 systems where both types of dust could be seen, the smaller particles were scattered much farther from their stars than the larger chunks—like finding that powder from a demolished building had blown much farther than the rubble. Even more intriguingly, nearly all of these mismatched systems also contained gas, while the systems where small and large debris stayed together were mostly gas-free. This suggests that gas in these debris discs acts like a cosmic wind, pushing lightweight dust particles to the outer edges while leaving heavier material closer in.</p>\n<h4>Looking Forward</h4>\n<p>These findings could revolutionize how we search for planets around other stars. Gas-filled debris discs might be cosmic signposts pointing to planetary systems in the making, or indicating invisible planets whose gravity influences how dust and gas move through space. This research brings us closer to understanding the messy, dynamic process of planetary system evolution—and perhaps finding more worlds like our own.</p>",
      "tweet_hook": {
        "hook": "🌌 We just discovered something surprising about alien Kuiper belts around other stars!",
        "claim": "Small dust particles are being pushed to outer regions of debris discs by cold gas, while larger particles stay closer to the star.",
        "evidence": "In 6 out of 15 discs studied, small dust peaked farther out than large dust - and these same systems host cold CO gas.",
        "question": "Could invisible gas be sculpting the dust in planetary systems we can't even see? 🤔"
      },
      "figure_url": "https://arxiv.org/html/2601.12586v1/x1.png"
    },
    {
      "id": "2601.13391v1",
      "title": "Turbulence Can Persist in the Inner Regions of Weakly-Ionized Planet Forming Disks",
      "abstract": "Identifying the mechanisms responsible for angular momentum transport in protoplanetary disks, and the extent to which those mechanisms produce turbulence, is a crucial problem in understanding planet formation. The bulk of the gas in protoplanetary disks is weakly ionized, which leads to the emergence of three non-ideal effects, Ohmic diffusion, ambipolar diffusion, and the Hall effect. These low-ionization processes can in some cases suppress turbulence driven by the magnetorotational instability (MRI). However, it has recently been shown that these non-ideal terms can also affect the dynamics of the gas in fundamentally different ways than simple diffusion. In order to further study the role of low-ionization on disk gas dynamics, we carry out a 3D local shearing box simulation with both Ohmic diffusion and ambipolar diffusion and an additional simulation with the Hall effect included. The strength of each non-ideal term, when present, is representative of gas at a radius of 5 AU in a realistic protoplanetary disk. We find the Hall effect increases the saturation strength of the magnetic field, but does not necessarily drive turbulence, consistent with previous work. However, interactions between ambipolar diffusion and the Keplerian shear lead to the ambipolar diffusion shear instability (ADSI), which can drive the initial growth, not damping, of magnetic perturbations. To our knowledge, this is the first work that explicitly demonstrates the viability of the ADSI in the non-linear regime within protoplanetary disks. At later times in the disk, the MRI (reduced in strength by ambipolar-diffusion), may also be present in regions of weak magnetic field between strong concentrations of vertical magnetic flux and sustain turbulence locally in protoplanetary disks.",
      "authors": [
        "David G. Rea",
        "Jacob B. Simon"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-19",
      "updated": "2026-01-19",
      "pdf_link": "https://arxiv.org/pdf/2601.13391v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.13391v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 15,
      "summary": "**Why It Matters**\n\nPicture a cosmic construction zone where planets are being built from scratch. These \"planet-forming disks\" are spinning clouds of gas and dust that surround young stars, and they're the birthplaces of every planet in the universe—including the thousands of exoplanets we've discovered orbiting other stars. But there's a fundamental mystery: how does the material in these disks move around and clump together to actually form planets? Understanding this process is crucial because it tells us not only how our own solar system came to be, but also why exoplanetary systems can look so dramatically different from ours. Some have giant planets orbiting closer to their stars than Mercury does to our Sun, while others have Earth-like worlds in completely unexpected arrangements.\n\n**What They Did**\n\nThe researchers used powerful computer simulations to model a slice of a planet-forming disk, like studying a small section of a spinning pizza to understand how the whole thing behaves. They focused on conditions similar to what you'd find about 5 astronomical units from a young star—roughly where Jupiter sits in our solar system. The key was examining how the gas behaves when it's only weakly electrified (ionized), which is the normal state for most of the material in these disks. They ran their virtual experiments twice: once including two important physical effects called Ohmic diffusion and ambipolar diffusion, and once adding a third effect called the Hall effect.\n\n**Key Findings**\n\nThe team discovered that these weakly-ionized conditions don't just calm things down as previously thought—they can actually create their own form of turbulence. Specifically, they found that ambipolar diffusion combined with the disk's rotation can trigger something called the \"ambipolar diffusion shear instability,\" which makes the gas churn and mix rather than settle into smooth layers. This was the first time researchers demonstrated this effect working in realistic disk conditions. Additionally, they found that even when the main turbulence-driving mechanism (called magnetorotational instability) is weakened, pockets of turbulence can persist in regions between strong magnetic field concentrations.\n\n**Looking Forward**\n\nThis research reshapes how we think about planet formation. Turbulence in these disks acts like a cosmic mixer, stirring up dust and gas in ways that directly affect how and where planets can form. The discovery that turbulence can persist even in the inner regions of these disks—where rocky planets like Earth typically form—suggests that planet formation might be more dynamic and complex than our current models predict. This could help explain the incredible diversity of exoplanetary systems we observe and guide us toward better understanding which types of systems are most likely to harbor Earth-like worlds.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Picture a cosmic construction zone where planets are being built from scratch. These \"planet-forming disks\" are spinning clouds of gas and dust that surround young stars, and they're the birthplaces of every planet in the universe—including the thousands of exoplanets we've discovered orbiting other stars. But there's a fundamental mystery: how does the material in these disks move around and clump together to actually form planets? Understanding this process is crucial because it tells us not only how our own solar system came to be, but also why exoplanetary systems can look so dramatically different from ours. Some have giant planets orbiting closer to their stars than Mercury does to our Sun, while others have Earth-like worlds in completely unexpected arrangements.</p>\n<h4>What They Did</h4>\n<p>The researchers used powerful computer simulations to model a slice of a planet-forming disk, like studying a small section of a spinning pizza to understand how the whole thing behaves. They focused on conditions similar to what you'd find about 5 astronomical units from a young star—roughly where Jupiter sits in our solar system. The key was examining how the gas behaves when it's only weakly electrified (ionized), which is the normal state for most of the material in these disks. They ran their virtual experiments twice: once including two important physical effects called Ohmic diffusion and ambipolar diffusion, and once adding a third effect called the Hall effect.</p>\n<h4>Key Findings</h4>\n<p>The team discovered that these weakly-ionized conditions don't just calm things down as previously thought—they can actually create their own form of turbulence. Specifically, they found that ambipolar diffusion combined with the disk's rotation can trigger something called the \"ambipolar diffusion shear instability,\" which makes the gas churn and mix rather than settle into smooth layers. This was the first time researchers demonstrated this effect working in realistic disk conditions. Additionally, they found that even when the main turbulence-driving mechanism (called magnetorotational instability) is weakened, pockets of turbulence can persist in regions between strong magnetic field concentrations.</p>\n<h4>Looking Forward</h4>\n<p>This research reshapes how we think about planet formation. Turbulence in these disks acts like a cosmic mixer, stirring up dust and gas in ways that directly affect how and where planets can form. The discovery that turbulence can persist even in the inner regions of these disks—where rocky planets like Earth typically form—suggests that planet formation might be more dynamic and complex than our current models predict. This could help explain the incredible diversity of exoplanetary systems we observe and guide us toward better understanding which types of systems are most likely to harbor Earth-like worlds.</p>",
      "tweet_hook": {
        "hook": "🌍 The birthplaces of planets are more turbulent than we thought! New research reveals surprise...",
        "claim": "Turbulence can persist in planet-forming disks even when conditions should suppress it, thanks to a newly-demonstrated instability mechanism.",
        "evidence": "First simulation to show ambipolar diffusion shear instability (ADSI) can actually grow magnetic perturbations instead of damping them.",
        "question": "What does this mean for how quickly planets can form in these chaotic stellar nurseries? 🤔"
      },
      "figure_url": "https://arxiv.org/html/2601.13391v1/x1.png"
    },
    {
      "id": "2601.12396v1",
      "title": "Revisiting the exoplanet radius valley with host stars from SWEET-Cat",
      "abstract": "The radius valley,a deficit of planets near 2 R_(⊕), was observed among exoplanets of radius 5 R_(⊕) with periods < 100 days by NASA's Kepler mission. It separates super-Earths (rocky, 1.9 R_(⊕)) from sub-Neptunes (volatile-rich, 2 R_(⊕)) and may arise from formation conditions or atmospheric loss. Disentangling these mechanisms has led to numerous studies of population-level trends, although the resulting interpretations remain sensitive to sample selection and the robustness of host-star parameters. We re-examine its existence, depth, and dependence on period, flux, stellar mass, and age. Using SWEET-Cat and MAISTEP tool, we derived stellar parameters for 1,221 main-sequence stars (1,405 planets), with effective temperatures 4400--7500 K and radii 0.62--2.75 R_(☉), achieving 2\\% precision in radius and mass. Planetary radii were recomputed from radius ratios, yielding 5\\% median uncertainty. The valley is partially filled near 2 R_(⊕) and depends on period, flux, and stellar mass, with slopes -0.12 (+0.02/-0.01), 0.10 (+0.02/-0.03), and 0.19 (+0.09/-0.07). Sub-Neptunes show a stronger stellar mass-dependent trend than super-Earths (0.17 (+0.04/-0.04) vs 0.11 (+0.05/-0.05)). With stellar age, the super-Earth/sub-Neptune ratio rises from 0.51 (+0.11/-0.08) (<3 Gyr) to 0.64 (+0.11/-0.11) (3 Gyr), and the valley becomes shallower and shifts to larger radii. A 4D fit shows consistent slopes with 2D analyses and a weaker age trend (0.07 (+0.03/-0.04)). These results suggest prolonged atmospheric loss, which is consistent with a core-powered mass loss scenario and emphasize the need for improved determinations, a goal expected to be achieved by future missions like PLATO.",
      "authors": [
        "Juma Kamulali",
        "Vardan Adibekyan",
        "Benard Nsamba",
        "Sergio G. Sousa",
        "Tiago. L. Campante",
        "Achim Weiss",
        "Bridget Kabugho",
        "Nuno Moedas",
        "Nuno C. Santos",
        "Otto Trust"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-18",
      "updated": "2026-01-18",
      "pdf_link": "https://arxiv.org/pdf/2601.12396v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.12396v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 13,
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>",
      "tweet_hook": {
        "hook": "",
        "claim": "",
        "evidence": "",
        "question": ""
      },
      "figure_url": "https://arxiv.org/html/2601.12396v1/figures/kiel_rv.png",
      "hidden": true
    },
    {
      "id": "2601.13200v1",
      "title": "Timescales diagnostics for saving viscous and MHD-driven dusty discs from external photoevaporation",
      "abstract": "The evolution of protoplanetary discs is a function of their internal processes and of their environment. It is unclear if angular momentum is mainly removed viscously or by magnetic winds, or by a combination of the two. While external photoevaporation is expected to influence disc evolution and dispersal, there are observational limitations towards highly irradiated discs. The interplay between these ingredients and their effect on the gas and dust distributions are poorly understood. We investigate the evolution of both the gaseous and solid components of viscous, MHD-wind or hybrid discs, in combination with external FUV-driven mass loss. We test which combinations of parameters protect discs from external irradiation, allowing the solid component to live long enough to allow planet formation to succeed. We run a suite of 1D simulations of smooth discs with varying initial sizes, levels of viscous and MHD-wind stresses modeled via an α parametrisation, and strengths of the external FUV environment. We track disc radii, various lifetime diagnostics, and the amount of dust removed by the photoevaporative wind, as a function of the underlying parameters. The biggest role in determining the fate of discs is played by a combination of its ability to spread radially outwards and the strength of FUV-driven erosion. While MHD wind-driven discs experience less FUV erosion due to the lack of spread, they do not live for longer compared to viscously evolving discs, especially at low-to-moderate FUV fluxes, while higher fluxes yield disc lifetimes that are insensitive to the disc's angular momentum transport mechanism. For the solid component, the biggest role is played by a combination of inward drift and removal by FUV winds. This points to the importance of other physical ingredients, such as disc substructures, even in highly-irradiated disc regions, in order to retain solids.",
      "authors": [
        "Gabriele Pichierri",
        "Giovanni Rosotti",
        "Rossella Anania",
        "Giuseppe Lodato"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-19",
      "updated": "2026-01-19",
      "pdf_link": "https://arxiv.org/pdf/2601.13200v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.13200v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 12,
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>",
      "tweet_hook": {
        "hook": "",
        "claim": "",
        "evidence": "",
        "question": ""
      },
      "figure_url": "https://arxiv.org/html/2601.13200v1/dotMs_FUV=1000_ALPHA=1e-03_lam=3.png",
      "hidden": true
    },
    {
      "id": "2601.14215v1",
      "title": "The PAIRS project: a global formation model for planets in binaries. II. Gravitational perturbation effects from secondary stars",
      "abstract": "Roughly half of Sun-like stars have at least one stellar companion, whereas it is widely assumed that most known exoplanets orbit single stars, largely due to observational biases. However, astrometric surveys, direct imaging, and speckle interferometry are steadily increasing the number of confirmed exoplanets in binaries. A stellar companion introduces additional effects, such as circumstellar disk truncation and gravitational perturbations, which can strongly impact planet formation. While global planet formation models, for example the Bern model, have been broadly applied to single stars, modeling S-type binaries requires key modifications to capture these effects. This study extends the Bern model by incorporating the gravitational influence of a stellar companion into its N-body integrator, allowing us to quantify how this perturbation affects planetary formation and final system architecture across a range of binary configurations. By comparing binary and single-star systems under identical initial conditions, we can assess the specific impact of binary-induced dynamics. We ran three sets of simulations: (i) a grid of in situ single-embryo cases to quantify gravitational effects; (ii) formation simulations with and without migration to compare outcomes with single-star analogs; and (iii) multi-embryo runs to evaluate impacts on multi-planetary systems. Planets forming beyond half the host star's Hill radius are much more likely to become unbound especially in systems with high binary eccentricity. Even within stable zones, growth is suppressed by both reduced material availability and increased eccentricity from stellar perturbations. Both disk truncation and stellar perturbations must be included to model planet formation in S-type binaries accurately. Neglecting either one will end up misrepresenting planetary growth and survival.",
      "authors": [
        "Arianna Nigioni",
        "Julia Venturini",
        "Emeline Bolmont",
        "Diego Turrini",
        "Yann Alibert",
        "Alexandre Emsenhuber"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-20",
      "updated": "2026-01-20",
      "pdf_link": "https://arxiv.org/pdf/2601.14215v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.14215v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 12,
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>",
      "tweet_hook": {
        "hook": "",
        "claim": "",
        "evidence": "",
        "question": ""
      },
      "figure_url": "https://arxiv.org/html/2601.14215v1/x1.png",
      "hidden": true
    },
    {
      "id": "2601.12074v1",
      "title": "Interior dynamics of envelopes around disk-embedded planets",
      "abstract": "In the core accretion scenario, forming planets start to acquire gaseous envelopes while accreting solids. Conventional one-dimensional models assume envelopes to be static and isolated. However, recent three-dimensional simulations demonstrate dynamic gas exchange from the envelope to the surrounding disk. This process is controlled by the balance between heating, through the accretion of solids, and cooling, which is regulated by poorly-known opacities. In this work, we systemically investigate a wide range of cooling and heating rates, using three-dimensional hydrodynamical simulations. We identify three distinct cooling regimes. Fast-cooling envelopes (β1, with β the cooling time in units of orbital time) are nearly isothermal and have inner radiative layers that are shielded from recycling flows. In contrast, slow cooling envelopes (β10^3) become fully convective. In the intermediate regime (1β300), envelopes are characterized by a three-layer structure, comprising an inner convective, a middle radiative, and an outer recycling layer. The development of this radiative layer traps small dust and vapour released from sublimated species. In contrast, fully convective envelopes efficiently exchange material from inner to outer envelope. Such fully convective envelopes are likely to emerge in the inner parts of protoplanetary disks (1 au) where cooling times are long, implying that inner-disk super-Earths may see their growth stalled and be volatile depleted.",
      "authors": [
        "Ayumu Kuwahara",
        "Michiel Lambrechts"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-17",
      "updated": "2026-01-17",
      "pdf_link": "https://arxiv.org/pdf/2601.12074v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.12074v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 8,
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>",
      "tweet_hook": {
        "hook": "",
        "claim": "",
        "evidence": "",
        "question": ""
      },
      "figure_url": "https://arxiv.org/html/2601.12074v1/den_temp_entropy.png",
      "hidden": true
    },
    {
      "id": "2601.13450v1",
      "title": "Four Cold Super-Jupiters Revealed by Extended and Complex Microlensing Signals",
      "abstract": "We present the analysis of four microlensing events, KMT-2020-BLG-0202, KMT-2022-BLG-1551, KMT-2023-BLG-0466, and KMT-2025-BLG-0121, which exhibit extended and complex anomalies in their light curves. These events were identified through a systematic reanalysis of KMTNet data aimed at detecting planetary signals that deviate from the typical short-term anomaly morphology. Detailed modeling indicates that all four anomalies were produced by planetary companions to low-mass stellar hosts. The events have mass ratios of q ~ (5--14)×10^(-3) and Einstein timescales of t_(E) ~ 20--43 days. Bayesian analyses based on Galactic models show that the companions are super-Jupiters with masses of a few to approximately 10 M_(J), orbiting sub-solar-mass hosts located at distances of D_(L) ~ 4--7~kpc. All planets lie well beyond the snow line of their hosts, placing them in the regime of cold giant planets. These detections demonstrate that extended and complex microlensing anomalies, which are often challenging to recognize as planetary in origin, can nonetheless contain planetary signals. This work underscores the unique sensitivity of microlensing to cold, massive planets beyond the snow line and highlights the importance of systematic reanalyses of survey data for achieving a more complete and unbiased census of exoplanets in the Galaxy.",
      "authors": [
        "Cheongho Han",
        "Chung-Uk Lee",
        "Michael D. Albrow",
        "Sun-Ju Chung",
        "Andrew Gould",
        "Youn Kil Jung",
        "Kyu-Ha Hwang",
        "Yoon-Hyun Ryu",
        "Yossi Shvartzvald",
        "In-Gu Shin",
        "Jennifer C. Yee",
        "Weicheng Zang",
        "Hongjing Yang",
        "Doeon Kim",
        "Dong-Jin Kim",
        "Sang-Mok Cha",
        "Seung-Lee Kim",
        "Dong-Joo Lee",
        "Yongseok Lee",
        "Byeong-Gon Park",
        "Richard W. Pogge"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "published": "2026-01-19",
      "updated": "2026-01-19",
      "pdf_link": "https://arxiv.org/pdf/2601.13450v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.13450v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 8,
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>",
      "tweet_hook": {
        "hook": "",
        "claim": "",
        "evidence": "",
        "question": ""
      },
      "figure_url": "https://arxiv.org/html/2601.13450v1/x1.png",
      "hidden": true
    },
    {
      "id": "2601.10811v2",
      "title": "The impact of disc photoevaporation on the long-term evolution of giant planets in mean motion resonances",
      "abstract": "We investigate the long-term impact of disc photoevaporation on the dynamical stability and evolution of giant planet pairs in mean motion resonances. Using two-dimensional hydrodynamical simulations with FARGO3D, in which we have included mass-loss due to photoevaporation, we explore a parameter space covering disc mass, viscosity, planet mass, and resonance type. We find that strong photoevaporation depletes gas in the common gap between the planets, slowing migration and suppressing planet-disc interactions that typically lead to resonance breaking and eccentricity damping. This stabilising effect is most significant for 3:2 resonances, which are more prone to disruption due to the reduced planet spacing. In contrast, 2:1 resonances are generally more robust but can still be destabilised at high disc mass and moderate-to-strong photoevaporation due to asymmetric torques. Photoevaporation can therefore stabilise resonances that would otherwise break, or conversely disrupt resonances that are natively more stable. Even in cases where photoevaporation does not directly affect resonance stability, it typically results in increased planetary eccentricities. These results highlight the complex, system-dependent nature of resonance evolution, with implications for the final orbital architectures of giant planet systems and their detectability via astrometry from missions such as Gaia.",
      "authors": [
        "Emmanuel J. Greenfield",
        "James E. Owen"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15",
      "updated": "2026-01-20",
      "pdf_link": "https://arxiv.org/pdf/2601.10811v2.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10811v2",
      "is_exoplanet_focused": true,
      "tweetability_score": 8,
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>",
      "tweet_hook": {
        "hook": "",
        "claim": "",
        "evidence": "",
        "question": ""
      },
      "figure_url": "https://arxiv.org/html/2601.10811v2/x1.png",
      "hidden": true
    },
    {
      "id": "2601.14076v1",
      "title": "RV×TESS I: Modeling Asteroseismic Signals with Simultaneous Photometry and RVs",
      "abstract": "Detecting small planets via the radial velocity method remains challenged by signals induced by stellar variability, versus the effects of the planet(s). Here, we explore using Gaussian Process (GP) regression with Transiting Exoplanet Survey Satellite (TESS) photometry in modeling radial velocities (RVs) to help to mitigate stellar jitter from oscillations and granulation for exoplanet detection. We applied GP regression to simultaneous TESS photometric and RV data of HD 5562, a G-type subgiant (M_★=1.09M_(☉), R_★=1.88R_(☉)) with a V magnitude of 7.17, using photometry to inform the priors for RV fitting. The RV data is obtained by the Magellan Planet Finder Spectrograph (PFS). The photometry-informed GP regression reduced the RV scatter of HD~5562 from 2.03 to 0.51 m/s. We performed injection and recovery tests to evaluate the potential of GPs for discovering small exoplanets around evolved stars, which demonstrate that the GP provides comparable noise reduction to the binning method. We also found that the necessity of photometric data depends on the quality of the RV dataset. For long baseline and high-cadence RV observations, GP regression can effectively mitigate stellar jitter without photometric data. However, for intermittent RV observations, incorporating photometric data improves GP fitting and enhances detection capabilities.",
      "authors": [
        "Jiaxin Tang",
        "Sharon X. Wang",
        "Yaguang Li",
        "Timothy R. Bedding",
        "Guang-Yao Xiao",
        "Fabo Feng",
        "Jie Yu",
        "Zun Wang",
        "Jennifer A. Burt",
        "R. Paul Butler",
        "Brad Carter",
        "Jeffrey D. Crane",
        "Matías R. Díaz",
        "Samuel K. Grunblatt",
        "Daniel Huber",
        "Hugh R. A. Jones",
        "Stephen R. Kane",
        "Jacob K. Luhn",
        "Stephen A. Shectman",
        "Johanna Teske",
        "Rob Wittenmyer",
        "Jason T. Wright",
        "Jeremy Bailey",
        "Simon J. O'Toole",
        "Chris G. Tinney"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "published": "2026-01-20",
      "updated": "2026-01-20",
      "pdf_link": "https://arxiv.org/pdf/2601.14076v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.14076v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 5,
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>",
      "tweet_hook": {
        "hook": "",
        "claim": "",
        "evidence": "",
        "question": ""
      },
      "figure_url": "https://arxiv.org/html/2601.14076v1/lc.png",
      "hidden": true
    },
    {
      "id": "2601.12669v1",
      "title": "PyIRD: A Python-Based Data Reduction Pipeline for Subaru/IRD and REACH",
      "abstract": "PyIRD is a Python-based pipeline for reducing spectroscopic data obtained with IRD (InfraRed Doppler; Kotani et al. (2018)) and REACH (Rigorous Exoplanetary Atmosphere Characterization with High dispersion coronagraphy; Kotani et al. (2020)) on the Subaru Telescope. It is designed to process raw images into one-dimensional spectra in a semi-automatic manner. Unlike traditional methods, it does not rely on IRAF (Tody, 1986; 1993), a software used for astronomical data reduction. This approach simplifies the workflow while maintaining efficiency and accuracy. Additionally, the pipeline includes an updated method for removing readout noise patterns from raw images, enabling efficient extraction of spectra even for faint targets such as brown dwarfs. The code is open source and available at https://github.com/prvjapan/pyird .",
      "authors": [
        "Yui Kasagi",
        "Hajime Kawahara",
        "Ziying Gu",
        "Teruyuki Hirano",
        "Takayuki Kotani",
        "Masayuki Kuzuhara",
        "Kento Masuda"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-19",
      "updated": "2026-01-19",
      "pdf_link": "https://arxiv.org/pdf/2601.12669v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.12669v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 5,
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>",
      "tweet_hook": {
        "hook": "",
        "claim": "",
        "evidence": "",
        "question": ""
      },
      "figure_url": "https://arxiv.org/html/2601.12669v1/orcid-ID.png",
      "hidden": true
    },
    {
      "id": "2601.11695v1",
      "title": "Exoplanet atmospheres and demographics in the 2040s",
      "abstract": "Direct observations of exoplanets probe the demographics and atmospheric composition of young self-luminous companions, yielding insight into their formation and early evolution history. In the near future, Gaia will reveal hundreds of nearby young exoplanets amenable to direct follow-up observations. Long-baseline interferometry with current and future facilities is best capable of exploiting this unique synergy which is poised to deliver a statistical sample of benchmark planets with precise dynamical masses and in-depth atmospheric characterization. This will enable tackling the longstanding question of how giant planets form from multiple angles simultaneously, shining light on the complex physical processes underlying planet formation.",
      "authors": [
        "Jens Kammerer",
        "Sydney Vach",
        "Sylvestre Lacour",
        "Mathias Nowak",
        "Thomas Winterhalder",
        "Antoine Mérand",
        "Akke Corporaal",
        "Guillaume Bourdarot",
        "Stefan Kraus",
        "Sasha Hinkley"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-16",
      "updated": "2026-01-16",
      "pdf_link": "https://arxiv.org/pdf/2601.11695v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.11695v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 5,
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>",
      "tweet_hook": {
        "hook": "",
        "claim": "",
        "evidence": "",
        "question": ""
      },
      "figure_url": "https://arxiv.org/html/2601.11695v1/x1.png",
      "hidden": true
    },
    {
      "id": "2601.11737v1",
      "title": "Using Astrometry to Break Degeneracies in Stellar Surface Mapping",
      "abstract": "Astrometric jitter noise arises when starspots on a rotating stellar surface move in and out of view, shifting the photocenter. This noise may limit our ability to detect and weigh small, sub-Neptune-sized planets around active stars. By deriving a linear forward model for the astrometric jitter signal of a rotating star in a spherical-harmonic coordinate system, we show that jitter noise can be used to reconstruct surface-brightness maps and, in principle, disentangle jitter from stellar reflex motion due to an orbiting planet. Furthermore, we show that astrometry and photometry probe complementary surface information: photometry measures even-degree spherical harmonic surfaces that are symmetric about the equator, while astrometry measures odd-degree modes. Their joint use, therefore, breaks degeneracies in surface mapping. Our model further quantifies the variation in the astrometric signal with inclination angle, which is foundational for studies of worst-case configurations of astrometric star-spot noise. For example, we show that pole-on stellar inclinations lead to poorly constrained inversions, as any stellar surface produces a purely circular astrometric jitter signal. We characterize the degeneracy in jointly identifying the stellar surface and stellar inclination, and develop a surface estimation approach. Using this approach, we present example simulations and reconstructions that demonstrate the use of astrometry data alongside light-curve data to improve stellar surface mapping and localize spot positions in latitude and longitude. With forthcoming high-precision Gaia astrometry, astrometric surface mapping provides a promising new approach to probe stellar activity.",
      "authors": [
        "Jamila Taaki",
        "Lia Corrales",
        "Alfred O. Hero"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "published": "2026-01-16",
      "updated": "2026-01-16",
      "pdf_link": "https://arxiv.org/pdf/2601.11737v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.11737v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>",
      "tweet_hook": {
        "hook": "",
        "claim": "",
        "evidence": "",
        "question": ""
      },
      "figure_url": "https://images.unsplash.com/photo-1419242902214-272b3f66ee7a?w=800",
      "hidden": true
    }
  ]
}