{
  "updated_at": "2026-01-17T12:13:14.814656+00:00",
  "category": "astro-ph.EP",
  "paper_count": 100,
  "papers": [
    {
      "id": "2601.06233v1",
      "title": "Exoplanet characterization with NASA's Habitable Worlds Observatory",
      "abstract": "Exoplanet atmosphere characterization has seen revolutionary advances over the last few years, providing us with unique insights into atmospheric chemistry, dynamics and planet formation mechanisms. However, true solar system analog planets remain inaccessible. A major goal for exoplanet science over the coming decades is to observe, and characterize, temperate rocky planets and cool gas giants in orbit around solar-type stars, with the prospect of detecting signs of habitability or even life. Characterization and categorization of these planets relies on direct spectroscopic observations capable of identifying molecular species in their atmospheres; however, these observations represent a substantial engineering challenge due to the extreme contrast between a temperate, Earth-sized exoplanet and its parent star. NASA's next flagship mission, the Habitable Worlds Observatory (HWO) - planned for launch in the mid-2040s - will boast a coronagraphic instrument capable of reaching the needed 10$^{-10}$ contrast, on an ultrastable platform enabling long integration times to achieve the required signal to noise. HWO will cover near-ultraviolet to the near-infrared wavelengths, enabling detections of key biosignature molecules and habitability indicators such as ocean glint and a vegetation `red edge'. Via early involvement in this groundbreaking observatory, including a potential UK instrument contribution, the UK exoplanet community now has an important opportunity to influence the telescope's design. To maintain our international competitiveness, we must be at the forefront of observational campaigns with HWO when it eventually launches, and this comes with the need for parallel development in laboratory astrophysics and computational modelling. Maximising our exploitation of this transformative NASA mission requires consistent financial support in these areas across the next two decades.",
      "authors": [
        "Joanna K. Barstow",
        "Beth Biller",
        "Mei Ting Mak",
        "Sarah Rugheimer",
        "Amaury Triaud",
        "Hannah R. Wakeford"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-09T14:18:25Z",
      "updated": "2026-01-09T14:18:25Z",
      "pdf_link": "https://arxiv.org/pdf/2601.06233v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.06233v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 19
    },
    {
      "id": "2601.08883v1",
      "title": "Habitable Worlds Observatory Living Worlds Working Group: Surface Biosignatures on Potentially Habitable Exoplanets",
      "abstract": "The Habitable Worlds Observatory (HWO) is the first NASA Astrophysics flagship mission with a key science goal of searching for signs of life on rocky habitable exoplanets beyond our solar system. The Living Worlds Community Working Group was charged with investigating how HWO could characterize planets orbiting stars in the solar neighborhood, search for signs of life, and interpret potential biosignatures within a false positive and false negative framework. The Surface Biosignatures Task assessed the measurement requirements and instrument needs to detect these biosignatures under an 'Earth through time' scenario. Surface biosignatures are planetary-scale spectral features resulting from absorption and/or scattering of radiation by organisms containing photosynthetic and non-photosynthetic pigments. This secondary class of biosignature can be used to corroborate atmospheric biosignatures by providing multiple lines of evidence to aid in assessing their biogenicity. Furthermore, surface biopigments are the only way to detect more primitive forms of anoxygenic photosynthesis if oxygenic photosynthesis never evolved. Key Findings: To detect biopigments on the surface of planets under Archean, Proterozoic, and Modern atmospheric compositions (15 percent coverage, 50 percent cloud cover), an SNR of 20-40 would be needed over 500-1100 nm. However, there may be some cases in which lower SNR is required; studies are ongoing. Coronagraph requirements: (1) The detection of surface biosignatures would be greatly enhanced by having as many parallel coronagraph channels as possible across the entire wavelength range with no or minimal gaps between channels. (2) Retrieval studies revealed that restricted wavelength ranges (e.g., 0.4 - 0.7 microns), such as may be used during initial survey strategies, are not sufficient to deconvolve the biopigment features from the abiotic background.",
      "authors": [
        "Niki Parenteau",
        "Anna Grace Ulses",
        "Connor Metz",
        "Nancy Y. Kiang",
        "Ligia F. Coelho",
        "Edward Schwieterman",
        "Jonathan Grone",
        "Giulia Roccetti",
        "Svetlana Berdyugina",
        "Eleonora Alei",
        "Lucas Patty",
        "Emilie Lafleche",
        "Taro Matsuo",
        "Dawn Cardace",
        "Schuyler Borges",
        "Avi Mandel",
        "Kenneth Gordon",
        "Joshua Krissansen-Totton",
        "Giada Arney"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-12T20:34:11Z",
      "updated": "2026-01-12T20:34:11Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08883v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08883v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 18
    },
    {
      "id": "2601.07414v1",
      "title": "Characterization of two new transiting sub-Neptunes and a terrestrial planet around M-dwarf hosts",
      "abstract": "We report the confirmation of three transiting exoplanets orbiting TOI-1243 (LSPM~J0902+7138), TOI-4529 (G~2--21), and TOI-5388 (Wolf~346) that were initially detected by TESS through ground-based photometry and radial velocity follow-up measurements with CARMENES. The planets present short orbital periods of $4.65$, $5.88$, and $2.59$ days, and they orbit early-M dwarfs (M2.0V, M1.5V, and M3.0V, respectively). We were able to precisely determine the radius of all three planets with a precision of $< 7\\, \\%$, the mass of TOI-1243 b with a precision of $19\\, \\%$, and upper mass limits for TOI-4529 b and TOI-5388 b. The radius of TOI-1243 b is $2.33\\pm0.12\\, {R_{\\oplus}}$, its mass is $7.7 \\pm 1.5\\,{M_{\\oplus}}$, and the mean density is $0.61 \\pm 0.15 \\, {ρ_\\oplus}$. The radius of TOI-4529 b is $1.77 ^{+0.09}_{-0.08} \\, {R_{\\oplus}}$, the $3 σ$ upper mass limit is $4.9 \\, {M_{\\oplus}}$, and the $3 σ$ upper density limit is $0.88\\, {ρ_\\oplus}$. The third planet, TOI-5388 b, is Earth-sized with a radius of $0.99 ^{+0.07}_{-0.06} \\, {R_{\\oplus}}$, a $3 σ$ upper mass limit of $2.2 \\, {M_{\\oplus}}$, and a $3 σ$ upper density limit of $2.2\\, {ρ_\\oplus}$. While TOI-5388 b is most probably rocky, given its Earth-like radius, TOI-1243 b and TOI-4529 b are located in a highly degenerate region in the mass-radius space. TOI-4529 b appears to lean toward a water-world composition. TOI-1243 b has enough mass to host a significant H-He envelope, although a water-world and pure rocky compositions are also consistent with the data. Our analysis indicates that future atmospheric observations using JWST can aid in determining their real composition. The sample of small planets around M dwarfs is widely used to understand planet formation and composition theories, and our study adds three planets to this sample.",
      "authors": [
        "E. Poultourtzidis",
        "G. Lacedelli",
        "E. Pallé",
        "I. Carleo",
        "C. Magliano",
        "S. Geraldía-González",
        "J. A. Caballero",
        "G. Morello",
        "J. Orell-Miquel",
        "H. M. Tabernero",
        "F. Murgas",
        "G. Covone",
        "F. J. Pozuelos",
        "P. J. Amado",
        "V. J. S. Béjar",
        "S. Chairetas",
        "C. Cifuentes",
        "D. R. Ciardi",
        "K. A. Collins",
        "I. J. M. Crossfield",
        "E. Esparza-Borges",
        "G. Fernández-Rodríguez",
        "A. Fukui",
        "Y. Hayashi",
        "A. P. Hatzes",
        "Th. Henning",
        "E. Herrero",
        "K. Horne",
        "S. B. Howell",
        "K. Isogai",
        "J. M. Jenkins",
        "Y. Kawai",
        "F. Libotte",
        "E. Matthews",
        "P. Meni-Gallardo",
        "I. Mireles",
        "J. C. Morales",
        "N. Narita",
        "B. B. Ogunwale",
        "H. Parviainen",
        "A. Quirrenbach",
        "A. Reiners",
        "I. Ribas",
        "R. Sefako",
        "A. Shporer",
        "R. P. Schwarz",
        "G. Srdoc",
        "L. Tal-Or",
        "S. Vanaverbeke",
        "N. Watanabe",
        "C. N. Watkins",
        "F. Zong Lang"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-12T10:56:09Z",
      "updated": "2026-01-12T10:56:09Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07414v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07414v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 18
    },
    {
      "id": "2601.05387v1",
      "title": "Paving the Road to the Habitable Worlds Observatory with High-Resolution Imaging I: New and Archival Speckle Observations of Potential HWO Target Stars",
      "abstract": "One of the key goals of the Habitable Worlds Observatory (HWO) is to directly image about 25 potentially habitable exoplanets and determine their properties. This challenge will require a large survey of nearby, bright stars -- ~100 according to the Astro2020 Decadel Survey. To ensure the success of the mission and to help guide design decisions, the stellar multiplicity of the target stars must be well-understood. To this end, we present optical speckle imaging of stars in the NASA Exoplanet Exploration Program (ExEP) provisional HWO star list, which is currently the Tier 1 target list for the HWO Target Stars and Systems Sub-Working Group. We obtained new observations using `Alopeke and Zorro at Gemini Observatory and queried the Exoplanet Follow-up Observing Program Archive for archival observations, resulting in speckle imaging data for 80 of the 164 stars. We confirmed one candidate companion detected previously by Gaia (HD 90089) and obtained an ambiguous detection of a known companion (HD 212330). To examine our sensitivity to companions, we simulated stellar companions down to ~0.1 $M_{\\odot}$ for each target and found that 75%-85% would be detected in our speckle images; the remaining simulated companions are either too faint or too close-in, and will require follow-up using other methods such as long-term spectroscopic measurements and space-based techniques. This work represents a first step towards surveying potential HWO targets for close-in stellar companions and helping to inform the target selection process for the HWO direct-imaging survey, bringing us closer towards the discovery of potential habitable worlds.",
      "authors": [
        "Zachary D. Hartman",
        "Catherine A. Clark",
        "Michael B. Lund",
        "Kathryn V. Lester",
        "José A. Caballero",
        "Steve B. Howell",
        "David Ciardi",
        "Sarah Deveny",
        "Mark E. Everett",
        "Elise Furlan",
        "Venu Kalari",
        "Colin Littlefield",
        "Andrew W. Stephens",
        "Jennifer A. Burt",
        "Guillaume Huber",
        "Rachel Matson",
        "Eric E. Mamajek",
        "Noah Tuchow"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "published": "2026-01-08T21:27:40Z",
      "updated": "2026-01-08T21:27:40Z",
      "pdf_link": "https://arxiv.org/pdf/2601.05387v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.05387v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 18
    },
    {
      "id": "2601.06386v1",
      "title": "NASA Decadal Astrobiology Research and Exploration Strategy (NASA-DARES 2025) White Paper -- Habitable Worlds Observatory Living Worlds Science Cases: Research Gaps and Needs",
      "abstract": "Executive Summary: The Habitable Worlds Observatory (HWO) is the first astrophysics flagship mission with a key cross-divisional astrobiology science goal of searching for signs of life on rocky planets beyond our solar system. The Living Worlds Working Group under the Science, Technology, and Architecture Review Team (START) was charged with investigating how HWO could characterize potentially habitable exoplanets orbiting stars in the solar neighborhood, search for signs of life, and interpret potential biosignatures within a false positive and false negative framework. In particular, we focused on (1) identifying biosignatures that have spectral features in the UV-Vis-NIR wavelength range and defining their measurement requirements, (2) determining additional information needed from the planet and planet system to interpret biosignatures and assess the likelihood of false positives, and (3) assembling current knowledge of likely HWO target stars and identify which properties of host stars and systems are most critical to know in advance of HWO. The Living Worlds atmospheric biosignatures science case is considered one of the key drivers in the design of the observatory. An additional 10 astrobiology science cases were developed that collectively revealed key research gaps and needs required to fully explore the observatory parameter space and perform science return analyses. Investment in these research gaps will require coordination across the Science Mission Directorate and fall under the purview of the new Division-spanning astrobiology strategy.",
      "authors": [
        "Niki Parenteau",
        "Giada Arney",
        "Eleanora Alei",
        "Ruslan Belikov",
        " Svetlana",
        " Berdyugina",
        "Dawn Cardace",
        "Ligia F. Coelho",
        "Kevin Fogarty",
        "Kenneth Gordon",
        "Jonathan Grone",
        "Natalie Hinkel",
        "Nancy Kiang",
        "Ravi Kopparapu",
        "Joshua Krissansen-Totton",
        "Emilie LaFleche",
        "Jacob Lustig-Yaeger",
        "Eric Mamajek",
        "Avi Mandell",
        "Taro Matsuo",
        "Connor Metz",
        "Mark Moussa",
        "Stephanie Olson",
        "Lucas Patty",
        "Bill Philpot",
        "Sukrit Ranjan",
        "Edward Schwieterman",
        "Clara Sousa-Silva",
        "Anna Grace Ulses",
        "Sara Walker",
        "Daniel Whitt"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-10T02:14:07Z",
      "updated": "2026-01-10T02:14:07Z",
      "pdf_link": "https://arxiv.org/pdf/2601.06386v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.06386v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 16
    },
    {
      "id": "2601.08390v1",
      "title": "Direct detection of hydrogen reveals a new macroscopic crustal water reservoir on early Mars",
      "abstract": "The next great leap in Martian exploration will be the return of samples to Earth. To ensure the maximum scientific return from studying these samples, the development and utilisation of nondestructive analytical techniques are essential to enable early three-dimensional characterisation of their interiors. Neutron computed tomography is a powerful method in this context: it is highly sensitive to hydrogen and complements the more conventional X-ray computed tomography. Because the distribution and nature of hydrous phases are central to understanding the habitability, the climatic and geological evolution, and potential biosignatures of Mars, identifying hydrogenbearing phases in Martian crustal rocks is of particular importance. Using the only Martian crustal material available on Earth, the NWA 7034 meteorite and its pairs, we show that combined neutron and X-ray computed tomography enables non-destructive sample-wide mapping of hydrogen and reveals the distribution and petrographic contexts of hydrous phases. We identify hydrogen-rich iron oxyhydroxides within ancient igneous clasts, forming a macroscopic mineralogical water reservoir within the meteorite. These alteration assemblages closely resemble those observed in samples collected by the Perseverance rover in Jezero crater, where hydrated iron oxyhydroxides are also present. This similarity suggests that such phases may represent a widespread near-surface water reservoir on early Mars.",
      "authors": [
        "Estrid Buhl Naver",
        "Katrine Wulff Nikolajsen",
        "Martin Sæbye Carøe",
        "Domenico Battaglia",
        "Jens Frydenvang",
        "Martin Bizzarro",
        "Jakob Sauer Jørgensen",
        "Kim Lefmann",
        "Anders Kaestner",
        "David Christian Mannes",
        "Phil Cook",
        "Henrik Birkedal",
        "Thorbjørn Erik Køppen Christensen",
        "Innokenty Kantor",
        "Henning Friis Poulsen",
        "Luise Theil Kuhn"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T09:58:02Z",
      "updated": "2026-01-13T09:58:02Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08390v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08390v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 15
    },
    {
      "id": "2601.05799v1",
      "title": "Two temperate Earth- and Neptune-sized planets orbiting fully convective M dwarfs",
      "abstract": "As the diversity of exoplanets continues to grow, it is important to revisit assumptions about habitability and classical HZ definitions. In this work, we introduce an expanded 'temperate' zone, defined by instellation fluxes between $0.1<S/\\mathrm{S}_\\oplus<5$, thus encompassing a broader range of potentially habitable worlds. We also introduce the TEMPOS survey, which aims to produce a catalogue of precise radii for temperate planets orbiting M dwarfs with $T_\\mathrm{eff}\\leq3400\\,$ K. This work reports the discovery and characterisation of two planets in this temperate regime orbiting mid-type M dwarfs: TOI-6716\\,b, a $0.98\\pm0.07\\,\\mathrm{R}_\\oplus$ planet orbiting its M4 host star ($R_\\star=0.231\\,\\pm0.015\\mathrm{R}_\\odot$, $M_\\star=0.223\\pm0.011\\,\\mathrm{M}_\\odot$, $T_\\mathrm{eff}=3110\\pm80\\,\\mathrm{K}$) with a period $P=4.7185898^{+0.0000054}_{-0.0000041}\\,\\mathrm{d}$, and TOI-7384 b, a $3.56\\pm0.21\\,\\mathrm{R}_\\oplus$ planet orbiting an M4 ($R_\\star=0.319\\,\\pm0.018\\mathrm{R}_\\odot$, $M_\\star=0.318\\pm0.016\\,\\mathrm{M}_\\odot$, $T_\\mathrm{eff}=3185\\pm75\\,\\mathrm{K}$) star every $P=6.2340258^{+0.0000034}_{-0.0000036}\\,\\mathrm{d}$. The radii of TOI-6716 b and TOI-7384 b have precisions of $6.8\\%$ and $5.9\\%$ respectively. We validate these planets with multi-band ground-based photometric observations, high-resolution imaging and statistical analyses. We find these planets to have instellation fluxes close to the inner (hotter) edge of the temperate zone, with $4.4\\pm1.1\\,\\mathrm{S}_\\oplus$ and $4.9\\pm1.1\\,\\mathrm{S}_\\oplus$ for TOI-6716 b and TOI-7384 b respectively. Also, with a predicted TSM similar to the TRAPPIST-1 planets, TOI-6716 b is likely to be a good rocky-world JWST target, should it have retained its atmosphere.",
      "authors": [
        "Madison G. Scott",
        "Georgina Dransfield",
        "Mathilde Timmermans",
        "Amaury H. M. J. Triaud",
        "Benjamin V. Rackham",
        "Khalid Barkaoui",
        "Adam J. Burgasser",
        "Karen A. Collins",
        "Michaël Gillon",
        "Steve B. Howell",
        "Alan M. Levine",
        "Francisco J. Pozuelos",
        "Keivan G. Stassun",
        "Carl Ziegler",
        "Yilen Gomez Maqueo Chew",
        "Catherine A. Clark",
        "Yasmin Davis",
        "Fatemeh Davoudi",
        "Tansu Daylan",
        "Brice-Olivier Demory",
        "Dax Feliz",
        "Akihiko Fukui",
        "Maximilian N. Günther",
        "Emmanuël Jehin",
        "Florian Lienhard",
        "Andrew W. Mann",
        "Clàudia Janó Muñoz",
        "Norio Narita",
        "Peter P. Pedersen",
        "Richard P. Schwarz",
        "Avi Shporer",
        "Abderahmane Soubkiou",
        "Sebastián Zúñiga-Fernández"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-09T13:57:46Z",
      "updated": "2026-01-09T13:57:46Z",
      "pdf_link": "https://arxiv.org/pdf/2601.05799v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.05799v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 14
    },
    {
      "id": "2601.07465v1",
      "title": "Exoplanet transit search at the detection limit: detection and false alarm vetting pipeline",
      "abstract": "One of the primary mission goals of the Kepler space telescope was to detect Earth-like terrestrial planets in the habitable zone around Sun-like stars. These planets are at the detection limit, where the Kepler detection and vetting pipeline produced unreliable planet candidates. We present a novel pipeline that improves the removal of localized defects prior to the planet search, improves vetting at the level of individual transits and introduces a Bayes factor test statistic and an algorithm for extracting multiple candidates from a single detection run. We show with injections in the Kepler data that the introduced novelties improve pipeline's completeness at a fixed false alarm rate. We apply the pipeline to the stars with previously identified planet candidates and show that our pipeline successfully recovers the previously confirmed candidates, but flags a considerable portion of unconfirmed candidates as likely false alarms, especially in the long period, low signal-to-noise ratio regime. In particular, several known Earth-like candidates in the habitable zone, such as KOI 8063.01, 8107.01 and 8242.01, are identified as false alarms, which could have a significant impact on the estimates of $η_{\\oplus}$, i.e., the occurrence of Earth-like planets in the habitable zone.",
      "authors": [
        "Jakob Robnik",
        "Uroš Seljak",
        "Jon M. Jenkins",
        "Steve Bryson"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-12T12:21:18Z",
      "updated": "2026-01-12T12:21:18Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07465v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07465v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 13
    },
    {
      "id": "2601.08227v1",
      "title": "Jupiter-like uniform metal enrichment in a system of multiple giant exoplanets",
      "abstract": "The accretion of icy and rocky solids during the formation of a gas giant planet is poorly constrained and challenging to model. Refractory species, like sulfur, are only present in solids in the protoplanetary disk where planets form. Measuring their abundance in planetary atmospheres is one of the most direct ways of constraining the extent and mechanism of solid accretion. Using the unprecedented sensitivity of NASA's James Webb Space Telescope (JWST), we measure a detailed chemical make-up of three massive gas giants orbiting the star HR~8799 including direct detections of H$_2$O, CO, CH$_4$, CO$_2$, H$_2$S, $^{13}$CO, and C$^{18}$O. We find these planets are uniformly and highly enriched in heavy elements compared to the star irrespective of their volatile (carbon and oxygen) or refractory (sulfur) nature, which strongly suggests efficient accretion of solids during their formation. This composition closely resembles that of Jupiter and Saturn and demonstrates that this enrichment also occurs in systems of multiple gas giant planets orbiting stars beyond the Solar System. This discovery hints at a shared origin for the heavy element enrichment of giant planets across a wider range of planet masses and orbital separations than previously anticipated.",
      "authors": [
        "Jean-Baptiste Ruffio",
        "Jerry W. Xuan",
        "Yayaati Chachan",
        "Aurora Kesseli",
        "Eve J. Lee",
        "Charles Beichman",
        "Klaus Hodapp",
        "William O. Balmer",
        "Quinn Konopacky",
        "Marshall D. Perrin",
        "Dimitri Mawet",
        "Heather A. Knutson",
        "Geoffrey Bryden",
        "Thomas P. Greene",
        "Doug Johnstone",
        "Jarron Leisenring",
        "Michael Meyer",
        "Marie Ygouf"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T05:16:12Z",
      "updated": "2026-01-13T05:16:12Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08227v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08227v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 12
    },
    {
      "id": "2601.05480v1",
      "title": "Stellar control on atmospheric carbon chemistry, CO runaway, and organic synthesis on lifeless Earth-like planets",
      "abstract": "The abundances of atmospheric carbon species--carbon dioxide (CO2), carbon monoxide (CO), and methane (CH4)--exert fundamental controls on the climate, redox state, and prebiotic environment of terrestrial planets. As exoplanet atmospheric characterization advances, it is essential to understand how these species are regulated on habitable terrestrial planets across a wide range of stellar and planetary conditions. Here, we develop an integrated numerical model that couples atmospheric chemistry, climate, and the long-term carbon cycle to investigate the atmospheric compositions of lifeless, Earth-like planets orbiting Sun-like (F-, G-, and K-type) stars. Our simulations demonstrate that CO2, CO, and CH4 generally increase with orbital distance, and that planets near the outer edge of the habitable zone may undergo CO runaway--a photochemical instability driven by severe depletion of OH radicals. The threshold for CO runaway depends strongly on stellar spectral type and is most easily triggered around cooler, lower-mass stars. In contrast, the atmospheric production of formaldehyde (H2CO)--a key precursor for prebiotic organic chemistry--peaks around planets orbiting more massive, UV-luminous stars and is maximized at orbital distances just interior to the CO-runaway threshold. These results establish a quantitative framework linking observable system properties--stellar type and orbital distance--and the atmospheric carbon chemistry of lifeless Earth-like planets, providing new context for interpreting future spectroscopic observations and for evaluating the potential of such planets to sustain prebiotic chemistry.",
      "authors": [
        "Yoshiaki Endo",
        "Yasuto Watanabe",
        "Kazumi Ozaki"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-09T02:30:30Z",
      "updated": "2026-01-09T02:30:30Z",
      "pdf_link": "https://arxiv.org/pdf/2601.05480v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.05480v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 11
    },
    {
      "id": "2601.03408v1",
      "title": "Estimation of the tidal heating in the TRAPPIST-1 planets. Influence of the internal structure",
      "abstract": "With the arrival of JWST observations of the TRAPPIST-1 planets, it is timely to reassess the contribution of tidal heating to their heat budget. JWST thermal phase curves could reveal endogenic heating through an anomalously high nightside temperature, providing an opportunity to estimate tidal heating. In this study, we revisit the tidal heating of these planets and propose a simple method to compute the tidal heating profile across a broad range of parameters. Our approach leverages a known formulation for synchronously rotating planets on low-eccentricity orbits and the fact that the profile shape depends solely on internal structure. We calculate the tidal heating contributions for all T-1 planets, with a particular focus on the impact of internal structure and eccentricity uncertainties on their total heat budget. Although the masses and radii of these planets are well constrained, degeneracies remain in their internal structure and composition. For volatile-poor planets of silicate-rock compositions, we investigate the role of core iron content by exploring a range of core sizes. For each structure, we compute the degree-two gravitational Love number, $k_2$, and the corresponding tidal heating profiles. We assume sub-solidus temperatures profiles that are decoupled from interior heat production, which means our estimates are conservative and likely represent minimum values. We find that the tidal heat flux for T-1b and c can exceed Io's heat flux, with uncertainties primarily driven by eccentricity. These high fluxes may be detectable with JWST. For T-1f to g, the tidal flux remains below Earth's geothermal flux, suggesting that tidal heating is unlikely to be the dominant energy source. For planets d and e, however, tidal heating likely dominates their heat budget, potentially driving intense volcanic and tectonic activity, which could enhance their habitability prospects.",
      "authors": [
        "Emeline Bolmont",
        "Mariana Sastre",
        "Alexandre Revol",
        "Mathilde Kervazo",
        "Gabriel Tobie"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-06T20:51:06Z",
      "updated": "2026-01-06T20:51:06Z",
      "pdf_link": "https://arxiv.org/pdf/2601.03408v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.03408v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 11
    },
    {
      "id": "2601.09766v1",
      "title": "Habitable Worlds Observatory (HWO): Living Worlds Community Working Group: The Search for Life on Potentially Habitable Exoplanets",
      "abstract": "The discovery of a biosphere on another planet would transform how we view ourselves, and our planet Earth, in relation to the rest of the cosmos. We now know Earth is one planet among eight circling our sun; our sun is part of a swirling galaxy of over one hundred billion other suns; and our galaxy is one of untold billions in the universe. While we do not yet know how many, if any, other biospheres exist on the countless worlds orbiting countless other suns, we stand at the precipice of a new era of discovery, enabled by powerful new facilities able to peer across the light years into the atmospheres of planets similar to our own. This article is an adaptation of a science case document (SCDD) developed for the NASA Astrophysics Flagship mission the Habitable Worlds Observatory (HWO) Science, Technology, and Architecture Review Team (START) Living Worlds Community Working Group.",
      "authors": [
        "Giada Arney",
        "Niki Parenteau",
        "Natalie Hinkel",
        "Eric Mamajek",
        "Joshua Krissansen-Totton",
        "Stephanie Olson",
        "Edward Schwieterman",
        "Sara Walker",
        "Kevin Fogarty",
        "Ravi Kopparapu",
        "Jacob Lustig-Yaeger",
        "Mark Moussa",
        "Sukrit Ranjan",
        "Garima Singh",
        "Clara Sousa-Silva",
        "Ruslan Belikov",
        "Maxwell Frissell",
        "Samantha Gilbert-Janziek",
        "Vincent Kofman",
        "Natasha Latouf",
        "Mary Anne Limbach",
        "Rhonda Morgan",
        "Christopher Stark",
        "Armen Tokadjian",
        "Anna Grace Ulses",
        "Nicholas Wogan",
        "Mike Wong",
        "Amber Young"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-14T09:44:50Z",
      "updated": "2026-01-14T09:44:50Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09766v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09766v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 10
    },
    {
      "id": "2601.08397v1",
      "title": "Anatomy of Empirical Transit Spectra of Mars based on TGO/NOMAD",
      "abstract": "Transit spectroscopy is a powerful tool for probing atmospheric structures of exoplanets. Accurately accounting for the effects of aerosols is key to reconstructing atmospheric properties from transit spectra, yet this remains a significant challenge. To advance this effort, it is invaluable to examine the spectral features of well-characterized planetary atmospheres. Here, we synthesize empirical transit spectra of Mars across different seasons based on data from the NOMAD's Solar Occultation channel onboard ExoMars/TGO, which operates at wavelengths of 0.2-0.65 and 2-4 micron. In the generated empirical transit spectra, the atmosphere below 25 km is found to be largely opaque due to the presence of micron-sized dust and water ice clouds, both of which substantially weaken spectral features. The spectra exhibit CO2 absorption features at 2.7-2.8 micron and signatures of sub-micron-sized mesospheric water ice clouds around 3.1 micron, accompanied by a continuum slope. The amplitudes of these spectral features are found to vary with the Martian seasons, where the dust storms weaken the CO2 signatures and strengthen the water ice features, which serve as potential indicators of a dusty planet like Mars. If TRAPPIST-1f possessed a Mars-like atmospheric structure, both CO2 and water ice features would be detectable at a noise level of 3 ppm, a level likely beyond current observational capabilities. Nevertheless, the 3.1 micron feature produced by sub-micron-sized mesospheric water ice clouds offers a novel avenue for characterizing the atmospheres of habitable-zone exoplanets.",
      "authors": [
        "Shohei Aoki",
        "Yuka Fujii",
        "Hideo Sagawa",
        "Geronimo L. Villanueva",
        "Ian Thomas",
        "Bojan Ristic",
        "Frank Daerden",
        "Miguel Angel López-Valverde",
        "Manish R. Patel",
        "Jonathon Mason",
        "Yannick Willame",
        "Giancarlo Bellucci",
        "Ann Carine Vandaele"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "published": "2026-01-13T10:05:41Z",
      "updated": "2026-01-13T10:05:41Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08397v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08397v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 10
    },
    {
      "id": "2601.10508v1",
      "title": "sponchpop II: Population Synthesis to Investigate Volatile Sulfur as a Fingerprint of Gas Giant Formation Histories",
      "abstract": "Planet population synthesis is an integral tool for linking exoplanets to their formation environments. Most planet population synthesis studies have focused on the carbon-to-oxygen ratio (C/O) in gas or solids, yet more insight into planet formation may be afforded by considering a wider suite of elements. Sulfur is one such key element. It has been assumed to be entirely refractory in population synthesis models, restricting it to being a tracer of accreted rocky solids. However, sulfur also has a volatile reservoir dominant at the onset of star and planet formation. We investigate sulfur's wider potential as a formation history tracer by implementing the first multi-phase treatment of S in a planet population synthesis model. We present the planet formation module of \\textsc{sponchpop} and its first predicted planet growth tracks and populations. We explore the diversity of planet compositions in terms of their sulfur budget, including both refractory and volatile components, and apply a novel gas-grain conversion of sulfur to study how formation trajectories of giant planets relate to final core and envelope compositions. We show that planets inherit a wide range of core and envelope sulfur content related to accretion history while considering late-stage planetesimal infall, providing a new diagnostic tool for planet formation. The diverse sulfur content of planet cores suggests some rocky planets may be born sulfur-poor, with implications for their geochemistry and habitability. Enhanced sulfur abundances in gas-giant atmospheres can be attributed to formation beyond the H2S iceline, such as the giants in our Solar System.",
      "authors": [
        "Anna Sommerville-Thomas",
        "Mihkel Kama",
        "Oliver Shottle",
        "Jason Ran"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T15:34:21Z",
      "updated": "2026-01-15T15:34:21Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10508v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10508v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 9
    },
    {
      "id": "2601.09330v1",
      "title": "NIRPS tightens the mass estimate of GJ 3090 b and detects a planet near the stellar rotation period",
      "abstract": "We present an updated characterization of the planetary system orbiting the nearby M2 dwarf GJ 3090 (TOI-177; $d = 22$ pc), based on new high-precision radial velocity (RV) observations from NIRPS and HARPS. With an orbital period of 2.85 d, the transiting sub-Neptune GJ 3090 b has a mass we refine to $4.52 \\pm 0.47 M_{\\oplus}$, which, combined with our derived radius of $2.18 \\pm 0.06 R_{\\oplus}$, yields a density of $2.40^{+0.33}_{-0.30}$ g cm$^{-3}$. The combined interior structure and atmospheric constraints indicate that GJ 3090 b is a compelling water-world candidate, with a volatile-rich envelope in which water likely represents a significant fraction. We also confirm the presence of a second planet, GJ 3090 c, a sub-Neptune with a 15.9 d orbit and a minimum mass of $10.0 \\pm 1.3 M_{\\oplus}$, which does not transit. Despite its proximity to the star's 18 d rotation period, our joint analysis using a multidimensional Gaussian process (GP) model that incorporates TESS photometry and differential stellar temperature measurements distinguishes this planetary signal from activity-induced variability. In addition, we place new constraints on a non-transiting planet candidate with a period of 12.7 d, suggested in earlier RV analyses. This candidate remains a compelling target for future monitoring. These results highlight the crucial role of multidimensional GP modelling in disentangling planetary signals from stellar activity, enabling the detection of a planet near the stellar rotation period that could have remained undetected with traditional approaches.",
      "authors": [
        "Pierrot Lamontagne",
        "Drew Weisserman",
        "Charles Cadieux",
        "David Lafrenière",
        "Alexandrine L'Heureux",
        "Mykhaylo Plotnykov",
        "Léna Parc",
        "Atanas K. Stefanov",
        "Leslie Moranta",
        "René Doyon",
        "François Bouchy",
        "Jean-Baptiste Delisle",
        "Louise D. Nielsen",
        "Gaspare Lo Curto",
        "Frédérique Baron",
        "Susana C. C. Barros",
        "Björn Benneke",
        "Xavier Bonfils",
        "Marta Bryan",
        "Bruno L. Canto Martins",
        "Ryan Cloutier",
        "Nicolas B. Cowan",
        "Daniel Brito de Freitas",
        "Jose Renan De Medeiros",
        "Xavier Delfosse",
        "Elisa Delgado-Mena",
        "Xavier Dumusque",
        "David Ehrenreich",
        "Pedro Figueira",
        "Jonay I. González Hernández",
        "Izan de Castro Leão",
        "Christophe Lovis",
        "Lison Malo",
        "Claudio Melo",
        "Lucile Mignon",
        "Christoph Mordasini",
        "Francesco Pepe",
        "Rafael Rebolo",
        "Jason Rowe",
        "Nuno C. Santos",
        "Damien Ségransan",
        "Alejandro Suárez Mascareño",
        "Stéphane Udry",
        "Diana Valencia",
        "Gregg Wade",
        "Manuel Abreu",
        "José Luan A. Aguiar",
        "Khaled Al Moulla",
        "Guillaume Allain",
        "Romain Allart",
        "Jose Manuel Almenara",
        "Tomy Arial",
        "Hugues Auger",
        "Luc Bazinet",
        "Nicolas Blind",
        "David Bohlender",
        "Étienne Artigau",
        "Isabelle Boisse",
        "Anne Boucher",
        "Vincent Bourrier",
        "Sébastien Bovay",
        "Pedro Branco",
        "Christopher Broeg",
        "Denis Brousseau",
        "Alexandre Cabral",
        "Andres Carmona",
        "Yann Carteret",
        "Zalpha Challita",
        "David Charbonneau",
        "Bruno Chazelas",
        "Catherine A. Clark",
        "João Coelho",
        "Marion Cointepas",
        "Karen A. Collins",
        "Kevin I. Collins",
        "Uriel Conod",
        "Eduardo Cristo",
        "Ana Rita Costa Silva",
        "Antoine Darveau-Bernier",
        "Laurie Dauplaise",
        "Roseane de Lima Gomes",
        "João Faria",
        "Dasaev O. Fontinele",
        "Thierry Forveille",
        "Yolanda G. C. Frensch",
        "Jonathan Gagné",
        "Frédéric Genest",
        "Ludovic Genolet",
        "João Gomes da Silva",
        "Félix Gracia Témich",
        "Nicole Gromek",
        "Nolan Grieves",
        "Olivier Hernandez",
        "Melissa J. Hobson",
        "H. Jens Hoeijmakers",
        "Norbert Hubin",
        "Neil J. Cook",
        "Marziye Jafariyazani",
        "Farbod Jahandar",
        "Ray Jayawardhana",
        "Hans-Ulrich Käufl",
        "Dan Kerley",
        "Johann Kolb",
        "Vigneshwaran Krishnamurthy",
        "Benjamin Kung",
        "Pierre Larue",
        "Henry Leath",
        "Olivia Lim",
        "Allan M. Martins",
        "Elisabeth C. Matthews",
        "Jaymie Matthews",
        "Jean-Sébastien Mayer",
        "Stan Metchev",
        "Lina Messamah",
        "Yuri S. Messias",
        "Dany Mounzer",
        "Nicola Nari",
        "Ares Osborn",
        "Mathieu Ouellet",
        "Jon Otegi",
        "Luca Pasquini",
        "Vera M. Passegger",
        "Stefan Pelletier",
        "Céline Peroux",
        "Caroline Piaulet-Ghorayeb",
        "Emanuela Pompei",
        "Anne-Sophie Poulin-Girard",
        "José Luis Rasilla",
        "Vladimir Reshetov",
        "Jonathan Saint-Antoine",
        "Mirsad Sarajlic",
        "Ivo Saviane",
        "Robin Schnell",
        "Alex Segovia",
        "Julia Seidel",
        "Armin Silber",
        "Peter Sinclair",
        "Michael Sordet",
        "Danuta Sosnowska",
        "Avidaan Srivastava",
        "Márcio A. Teixeira",
        "Simon Thibault",
        "Philippe Vallée",
        "Thomas Vandal",
        "Valentina Vaulato",
        "Joost P. Wardenier",
        "Bachar Wehbe",
        "Ivan Wevers",
        "François Wildi",
        "Vincent Yariv",
        "Gérard Zins"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T10:04:56Z",
      "updated": "2026-01-14T10:04:56Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09330v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09330v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 9
    },
    {
      "id": "2601.08952v1",
      "title": "Formation and evolution of planetary systems",
      "abstract": "Various problems of the formation and evolution of planetary systems are studied. Most of the studies are devoted to the Solar System. The collapse of the presolar cloud and the accumulation of planets are studied. The author considers the formation of the Earth-Moon system, binary trans-Neptunian objects, and the axial rotations of planets. He discusses the formation of asteroid and trans-Neptunian belts, including the evolution of resonant asteroid orbits and the formation of the Kirkwood gaps in the asteroid belt. The book discusses the migration of bodies during the formation of the Solar System and at present, including a discussion of the delivery of icy bodies from beyond the ice line to the terrestrial planets and the formation of craters on the Moon. The Deep Impact mission is discussed; during this mission the impact module of the spacecraft collided with the comet Tempel 1. The book studies the migration of dust in the Solar System and the formation of the zodiacal belt, as well as the migration of bodies and dust particles ejected from the terrestrial planets and the Moon. The author considers the migration of bodies in some exoplanetary systems (Proxima Centauri, Trappist 1, and Gliese 581), the spectra of Earth-like exoplanets with different rotation periods, as well as the efficiency of exoplanet searches using microlensing observations with various telescopes. English text is only in the list of publications and in the contents. An English reader can look the contents to find an interesting section. In this section he can find the numbers for relative publications. Using these numbers and the list of publications, he can find the websites where he can upload free files with these publications, and then he can read relevant papers in English and can get more detailed information than in this book.",
      "authors": [
        "S. I. Ipatov"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T19:43:28Z",
      "updated": "2026-01-13T19:43:28Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08952v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08952v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 9
    },
    {
      "id": "2601.02548v1",
      "title": "Dearth of Photosynthetically Active Radiation Suggests No Complex Life on Late M-Star Exoplanets",
      "abstract": "The rise of oxygen in the Earth's atmosphere during the Great Oxidation Event (GOE) occurred about 2.3 billion years ago. There is considerably greater uncertainty for the origin of oxygenic photosynthesis, but it likely occurred significantly earlier, perhaps by 700 million years. Assuming this time lag is proportional to the rate of oxygen generation, we can estimate how long it would take for a GOE-like event to occur on a hypothetical Earth-analog planet orbiting the star TRAPPIST-1 (a late M star with Teff 2560 K). Although in the habitable zone, an Earth-analog planet located in TRAPPIST-1e's orbit would receive only 0.9% of the Photosynthetically Active Radiation (PAR) that the Earth gets from the Sun. This is because most of the star's light is emitted at wavelengths longer than the 400-700 nm PAR range. Thus it would take 63 Gyrs for a GOE to occur. But the linear assumption is problematic; as light levels increase, photosynthesis saturates then declines, an effect known as photoinhibition. Photoinhibition varies from species to species and depends on a host of environmental factors. There is also sensitivity to the upper wavelength limit of the PAR: extending just 50 nm increases the number of photons by a factor of 2.5. Including these and other factors greatly reduces the timescale to roughly 1-5 Gyrs for a GOE. However, non-oxygenic photosynthetic bacteria can thrive in low-light environments and can use near-IR light out to 1100 nm, providing 22 times as many photons. With this huge light advantage, and because they evolved earlier, anoxygenic photosynthesizers would likely dominate the ecosystem. On a late M-star Earth-analog planet, oxygen may never reach significant levels in the atmosphere and a GOE may never occur, let alone a Cambrian Explosion. Thus complex animal life is unlikely.",
      "authors": [
        "Joseph J. Soliz",
        "William F. Welsh"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-05T20:49:01Z",
      "updated": "2026-01-05T20:49:01Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02548v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02548v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 9
    },
    {
      "id": "2601.08890v1",
      "title": "Planet-Host Stars Across the Galaxy in the 2040s",
      "abstract": "By the 2040s, the exoplanet field will have moved from the discovery of a few thousand planets to hundreds of thousands, thanks to Gaia DR5, TESS, PLATO, Roman, and their successors. At that stage, the key bottleneck will no longer be planet detection, but our ability to understand how planetary systems form, evolve, and diversify across different stellar and Galactic environments. To address this, we need a large-scale, high-resolution spectroscopic survey of planet-host stars, spanning a broad range of Galactic environments (thin and thick disks, bulge, halo, clusters, associations), and including a well-defined control sample of non-hosts. Such a survey must deliver homogeneous stellar parameters, detailed abundance determinations, ages, and kinematics for tens of thousands of hosts, extending to the faint magnitudes probed by future missions but are beyond the reach of existing and currently planned spectroscopic facilities.",
      "authors": [
        "M. Tsantaki",
        "K. Biazzo",
        "F. Zahra Majidi",
        "G. Tautvaisiene",
        "I. Busa"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "published": "2026-01-13T10:20:31Z",
      "updated": "2026-01-13T10:20:31Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08890v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08890v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 8
    },
    {
      "id": "2601.06263v1",
      "title": "Ultraviolet observations of atmospheric escape in exoplanets with the Habitable Worlds Observatory",
      "abstract": "Among the many recommendations of the Decadal Survey on Astronomy and Astrophysics 2020, we found that a priority area of research is to pave the pathways towards finding and characterizing habitable worlds. In this context, we aim to understand how planetary systems evolve through atmospheric escape, and develop techniques to identify potentially Earth-like worlds. Using the ultraviolet (UV) capabilities of the Habitable Worlds Observatory, we can use transit spectroscopy observations to determine what processes drive the evolution of exoplanets, how well can small exoplanets retain atmospheres, and search for Earth-like atmospheres. We advocate the development of a UV spectrograph that is capable of moderate- to high-resolution spectroscopy of point sources, access to key spectral features between 1000 and 3000 Angstrom, and UV detectors that are resilient to high count rates.",
      "authors": [
        "Leonardo A. Dos Santos",
        "Eric D. Lopez"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "published": "2026-01-09T19:18:03Z",
      "updated": "2026-01-09T19:18:03Z",
      "pdf_link": "https://arxiv.org/pdf/2601.06263v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.06263v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 8
    },
    {
      "id": "2601.04593v1",
      "title": "Investigating the High-energy Radiation Environment of Planets in Sun-like Binary Systems",
      "abstract": "Far-ultraviolet (FUV) radiation is a driving source of photochemistry in planetary atmospheres. Proper interpretation of atmospheric observations requires a full understanding of the radiation environment that a planet is exposed to. Using the Suborbital Imaging Spectrograph for Transition-region Irradiance from Nearby Exoplanet host stars (SISTINE) rocket-borne spectrograph, we observed the Sun-like binary system $α$ Centauri AB and captured the FUV spectrum of both stars simultaneously. Our spectra cover 980--1570 Å, providing the broadest FUV wavelength coverage taken in a single exposure and spanning several key stellar emission features which are important photochemical drivers. Combining the SISTINE spectrum with archival observations, model spectra, and a novel stellar activity model, we have created spectral energy distributions (SEDs) spanning 5 Å--1 mm for both $α$ Centauri A and B. We use the SEDs to estimate the total high-energy flux (X-ray--UV) incident on a hypothetical exoplanet orbiting $α$ Centauri A. Because the incident flux varies over time due to the orbit of the stellar companion and the activity level of each star, we use the VULCAN photochemical kinetics code to estimate atmospheric chemical abundances in the case of minimum and maximum flux exposure. Our results indicate that enhanced atmospheric mass loss due to stellar binarity will likely not be an issue for future exoplanet-hunting missions such as the Habitable Worlds Observatory when searching for Earth-like planets around Sun-like stars.",
      "authors": [
        "Patrick R. Behr",
        "Kevin France",
        "Nicholas Kruczek",
        "Nicholas Nell",
        "Brian Fleming",
        "Stefan Ulrich",
        "Girish M. Duvvuri",
        "Amy Louca",
        "Yamila Miguel"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "published": "2026-01-08T04:44:15Z",
      "updated": "2026-01-08T04:44:15Z",
      "pdf_link": "https://arxiv.org/pdf/2601.04593v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.04593v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 8
    },
    {
      "id": "2601.09492v1",
      "title": "Demographics of Close-In TESS Exoplanets Orbiting FGK Main-sequence Stars",
      "abstract": "Understanding the demographics of close-in planets is crucial for insights into exoplanet formation and evolution. We present a detailed analysis of occurrence rates for close-in (0.5-16 day) planets with radii between 2 and 20$\\,R_{\\oplus}$ around FGK main-sequence stars. Our study uses a comprehensive sample from four years of TESS Science Processing Operations Center full-frame image data cross-matched with Gaia, analysed through our rigorous detection, vetting, and validation pipeline. Using high-confidence planet candidates, we apply a hierarchical Bayesian model to determine occurrence rates in the two-dimensional orbital period-radius plane. Our results are presented using 10-by-10 bins across the period-radius parameter space, offering unprecedented resolution and statistical precision. We find an overall occurrence rate of $9.4^{+0.7}_{-0.6}\\%$. When using identical binning, our occurrence rate posteriors distributions align with Kepler's but have a magnitude smaller uncertainties on average. For hot Jupiters, we estimate the overall occurrence rate of $0.39^{+0.03}_{-0.02}\\%$. This value is consistent with the previous Kepler FGK-type result within $1σ$. We find an overall occurrence rate of Neptunian desert planets of $0.08\\pm0.01\\%$, to our knowledge the first such determination. Additionally, in a volume-limited Gaia subsample within 100 pc in the same parameter region, we measure an overall planet occurrence rate of $15.4^{+1.6}_{-1.5}\\%$ and a hot Jupiter occurrence rate of $0.42^{+0.16}_{-0.12}\\%$. Our results establishes an improved foundation for constraining theoretical models of exoplanet populations.",
      "authors": [
        "Kaiming Cui",
        "David J. Armstrong",
        "Andreas Hadjigeorghiou",
        "Marina Lafarga",
        "Vedad Kunovac",
        "Lauren Doyle",
        "Luis Agustín Nieto",
        "Rodrigo F. Díaz"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T13:59:49Z",
      "updated": "2026-01-14T13:59:49Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09492v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09492v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 7
    },
    {
      "id": "2601.06236v1",
      "title": "Transiting exoplanets as the immediate future for population-level atmospheric science",
      "abstract": "The transit method, during which a planet's presence is inferred by measuring the reduction in flux as it passes in front of its parent star, is a highly successful exoplanet detection and characterization technique. During transit, the small fraction of starlight that passes through a planet's atmosphere emerges with the fingerprints of atmospheric gases, aerosols and structure. During eclipse, the relatively small contribution of light from the planet itself may be observed as the planet is occulted by the star. For planets in near-edge-on, short-period orbits, observing the system throughout an entire orbit allows the varying flux from the planet to be extracted as the illuminated `dayside' rotates in and out of view. With spectroscopic observations, we can characterize not only the overall composition of the atmosphere, but also glean insights into atmospheric structure and dynamics. With over 6,000 transiting planets now discovered, such observations are currently our only window into a consistent sample of planetary atmospheres large enough to attempt a population-level study, a critical next step for our understanding of atmospheric science. The vast exoplanet population provides a laboratory for atmospheric physics, including chemistry, dynamics, cloud processes and evolution; extending these results to a larger number of targets will allow us to explore the effects of equilibrium temperature, gravity, mass and parent star type on atmospheric properties, as well as map observable trends to formation scenarios. These findings are critical for addressing STFC's Science Vision Challenge B: how do stars and planetary systems develop and how do they support the existence of life?. Here we outline how the UK must fit within this strategic context, suggest approaches and development for the future, and outline the unique capabilities and leadership of scientists across the UK.",
      "authors": [
        "Joanna K. Barstow",
        "Hannah R. Wakeford",
        "Sarah L. Casewell",
        "Vatsal Panwar"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-09T15:15:15Z",
      "updated": "2026-01-09T15:15:15Z",
      "pdf_link": "https://arxiv.org/pdf/2601.06236v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.06236v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 7
    },
    {
      "id": "2601.03350v1",
      "title": "The SOL $\\textit{(Solar Origin and Life)}$ Project: Detailed characterization of candidates for the ZAMS and Subgiant stages",
      "abstract": "The context of the Sun in the galactic neighborhood is not well understood, especially when we compare its physical properties to those of nearby stars. Thereby, we still cannot fully comprehend whether or not the Sun is a typical star. This work aims to identify and characterize stars aligned with the solar evolutionary track that could represent it at the ZAMS and subgiant stages. We performed a spectroscopic analysis of 18 photometrically selected candidates using high-resolution and high-SNR spectra as well as the classical spectroscopic method, based on the excitation and ionization equilibria of Fe I and Fe II lines. Additionally, we derived evolutionary parameters using isochrones, and kinematic parameters. We also estimated chromospheric activity levels and performed age estimates through 3 additional independent methods: activity-age relations using the Ca II H $\\&$ K and H$α$ lines, and rotation periods estimated from TESS light curves. We identified three candidates that provide a good match to the Sun at $\\approx$ 0.5 Gyr (HD 13531 and HD 61033) and subgiant (HD 148577) stages. Moreover, HD 197210 could be of interest when studying the Sun at $\\approx$ 2 Gyr, when the Earth's atmosphere started having a significant amount of oxygen. Our selection method was successful and we were able to identify stars similar to the Sun at different evolutionary stages, which is essential for future research in the search of exoplanets and understand habitability, especially with the advent of the next generation of exoplanet-hunting instruments.",
      "authors": [
        "C. Eduardo-Oliveira S.",
        "L. Ghezzi",
        "G. F. Porto de Mello",
        "D. Lorenzo-Oliveira",
        "P. V. Souza dos Santos",
        "E. Costa-Almeida"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-06T19:00:07Z",
      "updated": "2026-01-06T19:00:07Z",
      "pdf_link": "https://arxiv.org/pdf/2601.03350v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.03350v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 7
    },
    {
      "id": "2601.02665v1",
      "title": "TOI-4495: A Pair of Aligned, Near-Resonant Sub-Neptunes that Likely Experienced Overstable Migration",
      "abstract": "We report the discovery of a sub-Neptune and a Neptune-like planet ($R_b = 2.48^{+0.14}_{-0.10}\\,R_\\oplus$, $R_c = 4.03^{+0.23}_{-0.15}\\,R_\\oplus$) orbiting the F-type star TOI-4495. The planets have orbital periods of 2.567 days and 5.185 days, lying close to a 2:1 mean-motion resonance (MMR). Our photodynamical analysis of the TESS light curves constrains the planetary masses to $M_b = 7.7 \\pm 1.4\\,M_\\oplus$ and $M_c = 23.2 \\pm 4.7\\,M_\\oplus$. The measured masses and radii indicate the presence of volatile-rich gaseous envelopes on both planets. The Rossiter-McLaughlin effect and the Doppler shadow of TOI-4495 c reveal a well-aligned orbit with a projected stellar obliquity of $λ= -2.3^{+8.3}_{-7.8}\\,\\mathrm{deg}$. Combined with the low mutual inclination constrained by the photodynamical analysis ($ΔI < 8.7\\,\\mathrm{deg}$), the planetary orbits are likely coplanar and aligned with the host star's spin axis. We show that the planets are near, but not in, the 2:1 MMR, with a circulating resonant angle. We also find substantial free eccentricity for the inner planet, TOI-4495 b ($e_b = 0.078^{+0.020}_{-0.013}$). Given the observed proximity to the 2:1 resonance and the more massive outer planet, TOI-4495 b and c are particularly susceptible to resonant overstability, which can convert resonantly excited eccentricity into free eccentricity. However, additional mechanisms (e.g., planetesimal scattering) may be required to further excite the eccentricity by $\\sim 4\\%$. To prevent tidal damping from reducing the eccentricity below the observed level over the star's lifetime (1.9 Gyr), the reduced tidal quality factor of TOI-4495 b must be $Q' \\gtrsim 10^5$, consistent with the presence of a thick envelope on the planet.",
      "authors": [
        "Mu-Tian Wang",
        "Fei Dai",
        "Hui-Gen Liu",
        "Kento Masuda",
        "Andrew W. Howard",
        "Samuel Halverson",
        "Howard Isaacson",
        "Elina Y. Zhang",
        "Max Goldberg",
        "Huan-Yu Teng",
        "Ryan A. Rubenzahl",
        "Benjamin Fulton",
        "Erik A. Petigura",
        "Steven Giacalone",
        "Luke Handley",
        "David W. Latham",
        "Allyson Bieryla",
        "Ashley Baker",
        "Jerry Edelstein",
        "Steven R. Gibson",
        "Kodi Rider",
        "Arpita Roy",
        "Chris Smith",
        "Josh Walawender",
        "David Rapetti",
        "Jon M. Jenkins",
        "Joshua N. Winn"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-06T02:25:13Z",
      "updated": "2026-01-06T02:25:13Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02665v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02665v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 6
    },
    {
      "id": "2601.09438v1",
      "title": "Mass estimates of the young TOI-451 transiting planets: Multidimensional Gaussian Process on stellar spectroscopic and photometric signals",
      "abstract": "The young TOI-451 planetary system, aged 125 Myr, provides a unique opportunity to test theories of planetary internal structures and atmospheric mass loss through examination of its three transiting planets. We present an exhaustive photometric and spectroscopic follow-up to determine the orbital and physical properties of the system. We perform multidimensional Gaussian Process regression with the code pyaneti on spectroscopic time-series and NGTS/LCO light curves to disentangle the stellar and planetary signal in ESPRESSO radial velocities. We show how contemporaneous photometry serves as an activity indicator to inform RV modelling within a multidimensional Gaussian Processes framework. We argue that this can be exploited when spectroscopic observations are adversely affected by low signal-to-noise and/or poor sampling. We estimate the Doppler semi-amplitudes of Kb = 2.6(+1.1,-1.2) m/s, Kc = 1.2(+1.0,-0.8) m/s and Kd = 2.7 +/- 1.2 m/s. This translates into 2-sigma mass estimates for TOI-451 b and d of Mb = 4.7(+2.1,-2.2) Earth masses and Md = 10.2(+4.6,-4.5) Earth masses, as well as a mass upper limit for TOI-451 c of Mc < 11.5 Earth masses. The derived planetary properties suggest that planets c and d contain significant hydrogen-rich envelopes. The inferred parameters of TOI-451 b are consistent with either a rocky world that still retains a small hydrogen envelope or a water world. These insights make the TOI-451 system an ideal laboratory for future follow-up studies aimed at measuring atmospheric compositions, detecting atmospheric mass-loss signatures, and further exploring planetary formation and evolution processes.",
      "authors": [
        "Oscar Barragán",
        "Manuel Mallorquín",
        "Jorge Fernández-Fernández",
        "Faith Hawthorn",
        "Alix V. Freckelton",
        "Marina Lafarga",
        "Michael Cretignier",
        "Yoshi N. E. Eschen",
        "Samuel Gill",
        "Víctor J. S. Béjar",
        "Nicolas Lodieu",
        "Haochuan Yu",
        "Thomas G. Wilson",
        "David Anderson",
        "Ioannis Apergis",
        "Matthew Battley",
        "Edward M. Bryant",
        "Pía Cortés-Zuleta",
        "Edward Gillen",
        "James S. Jenkins",
        "Baptiste Klein",
        "James McCormac",
        "Annabella Meech",
        "Erik Meier-Valdés",
        "Maximiliano Moyano",
        "Annelies Mortier",
        "Felipe Murgas",
        "Louise D. Nielsen",
        "Suman Saha",
        "José I. Vines",
        "Richard West",
        "Peter J. Wheatley",
        "Suzanne Aigrain"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T12:39:48Z",
      "updated": "2026-01-14T12:39:48Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09438v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09438v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 5
    },
    {
      "id": "2601.04255v1",
      "title": "Charge Migration and Residual Non-Linearity in NIRSpec BOTS Observations",
      "abstract": "We investigate the effect of charge migration and residual non-linearity on the JWST/NIRSpec G395H NRS1 and NRS2 detectors using Bright Object Time Series (BOTS) observations of the ultra-hot Jupiter WASP-121b. These full-orbit phase curve observations were taken over 37.8 hours (1.57 days), and provide an excellent testbed of the non-linearity behavior of NRS1 and NRS2 over long timescales. For both detectors, our analysis demonstrates charge losses at the center of the spectral trace and charge excesses at the trace edges. We find that the NRS1 detector displays ~3x larger deviations from linearity compared to NRS2. Given the large transit (~1.5%) and eclipse (~0.5%) signals for WASP-121b, we also investigate variations in the distribution of charge throughout the time-series observation. Our results show that charge distribution varies at different planetary orbital phases for NRS1, which manifests as a change in the morphology and shape of the spectral trace over the course of the time-series. The effect of charge distribution on the trace shape is not evident for NRS2.",
      "authors": [
        "Munazza K. Alam",
        "Leonardo Ubeda",
        " Qinyan",
        " Lu",
        "Nestor Espinoza",
        "Nikolay Nikolov"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-06T22:16:44Z",
      "updated": "2026-01-06T22:16:44Z",
      "pdf_link": "https://arxiv.org/pdf/2601.04255v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.04255v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 5
    },
    {
      "id": "2601.03932v1",
      "title": "The uncertainty in water mass fraction of wet planets",
      "abstract": "Planets with masses between Earth and Neptune often have radii that imply the presence of volatiles, suggesting that water may be abundant in their interiors. However, directly observing the precise water mass fraction and water distribution remains unfeasible. In our study, we employ an internal structure code MAGRATHEA to model planets with high water content and explore potential interior distributions. Departing from traditional assumptions of a layered structure, we determine water and rock distribution based on water-rock miscibility criteria. We model {wet planets} with an iron core and a homogeneous mixture of rock and water above it. At the outer regions of the planet, the pressure and temperature are below the rock-water miscibility point (the second critical point), causing the segregation of water and rock. Consequently, a shell of water is formed in the outermost layers. By considering the water-rock miscibility and the vapor state of water, our approach highlights the uncertainty in estimating the water mass fraction of detected exoplanets.",
      "authors": [
        "Michael Lozovsky"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-07T13:51:31Z",
      "updated": "2026-01-07T13:51:31Z",
      "pdf_link": "https://arxiv.org/pdf/2601.03932v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.03932v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 4
    },
    {
      "id": "2601.10450v1",
      "title": "TOI-3862 b: A dense super-Neptune deep in the hot Neptune desert",
      "abstract": "The structure and evolution of close-in exoplanets are shaped by atmospheric loss and migration processes, which give rise to key population features such as the hot Neptune desert, ridge, and savanna - regions of the period-radius space whose boundaries offer critical insights into planetary formation and survival. As part of the KESPRINT collaboration, we selected the TESS transiting planet candidate TOI-3862.01 for radial velocity follow-up to confirm its planetary nature and characterize its mass and bulk properties. This planet candidate is of particular interest due to its position in the middle of the hot Neptune desert, making it a valuable probe for testing theories of planet migration and atmospheric loss. We confirmed the planetary nature and determined the mass of TOI-3862.01 (hereinafter TOI-3862b) by performing a joint fit with both transit and radial velocity data, precisely characterizing the bulk properties of this planet. TOI-3862b is a super-Neptune on a 1.56-day orbit around a Sun-like star with an effective temperature of 5300$\\pm$50K. It has a mass of 53.7$_{-2.9}^{+2.8}$ M$_{\\oplus}$ and a radius of 5.53$\\pm$0.18 R$_{\\oplus}$, corresponding to a density of 1.7$\\pm$0.2 g/cm^3. This places it among the rare population of hot and dense super-Neptune desert planets. TOI-3862b, residing deep in the hot Neptune desert, represents a rare occurrence in an otherwise sparsely populated region, offering a valuable opportunity to probe the processes that may allow planets to survive in such environments.",
      "authors": [
        "Ilaria Carleo",
        "Amadeo Castro-González",
        "Enric Pallé",
        "Felipe Murgas",
        "Grzegorz Nowak",
        "Gaia Lacedelli",
        "Thomas Masseron",
        "Emily W. Wong",
        "Patrick Eggenberger",
        "Vincent Bourrier",
        "Dawid Jankowski",
        "Krzysztof Goździewski",
        "Douglas R. Alves",
        "James S. Jenkins",
        "Sergio Messina",
        "Keivan G. Stassun",
        "Jose I. Vines",
        "Matteo Brogi",
        "David R. Ciardi",
        "Catherine A. Clark",
        "William Cochran",
        "Karen A. Collins",
        "Hans J. Deeg",
        "Elise Furlan",
        "Davide Gandolfi",
        "Samuel Geraldía González",
        "Artie P. Hatzes",
        "Coel Hellier",
        "Steve B. Howell",
        "Judith Korth",
        "Jorge Lillo-Box",
        "John H. Livingston",
        "Jaume Orell-Miquel",
        "Carina M. Persson",
        "Seth Redfield",
        "Boris Safonov",
        "David Baker",
        "Rafael Delfin Barrena Delgado",
        "Allyson Bieryla",
        "Andrew Boyle",
        "Pau Bosch-Cabot",
        "Núria Casasayas Barris",
        "Stavros Chairetas",
        "Jerome P. de Leon",
        "Izuru Fukuda",
        "Akihiko Fukui",
        "Pere Guerra",
        "Kai Ikuta",
        "Kiyoe Kawauchi",
        "Emil Knudstrup",
        "Florence Libotte",
        "Michael B. Lund",
        "Rafael Luque",
        "Eduardo Lorenzo Martín Guerrero de Escalante",
        "Bob Massey",
        "Edward J. Michaels",
        "Giuseppe Morello",
        "Norio Narita",
        "Hannu Parvianien",
        "Richard P. Schwarz",
        "Avi Shporer",
        "Monika Stangret",
        "Noriharu Watanabe",
        "Cristilyn N. Watkins"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T14:39:32Z",
      "updated": "2026-01-15T14:39:32Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10450v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10450v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 3
    },
    {
      "id": "2601.05994v1",
      "title": "Setting up the physical principles of resilience in a model of the Earth System",
      "abstract": "Resilience is a property of social, ecological, social-ecological and biophysical systems. It describes the capacity of a system to cope with, adapt to and innovate in response to a changing surrounding. Given the current climate change crisis, ensuring conditions for a sustainable future for the habitability on the planet is fundamentally dependent on Earth System (ES) resilience. It is thus particularly relevant to establish a model that captures and frames resilience of the ES, most particularly in physical terms that can be influenced by human policy\\footnote{See page 4 for examples of strategies}. In this work we propose that resilience can serve as a theoretical foundation when unpacking and describing metastable states of equilibrium and energy dissipation in any dynamic description of the variables that characterise the ES. Since the impact of the human activities can be suitably gauged by the planetary boundaries (PBs) and the planet's temperature is the net result of the multiple PB variables, such as $\\text{CO}_2$ concentration and radiative forcing, atmospheric aerosol loading, atmospheric ozone depletion, etc, then resilience features arise once conditions to avoid an ES runaway to a state where the average temperature is much higher than the current one. Our model shows that this runaway can be prevented by the presence of metastable states and dynamic friction built out of the interaction among the PB variables once suitable conditions are satisfied. In this work these conditions are specified. As humanity moves away from Holocene conditions, we argue that resilience features arising from metastable states might be crucial for the ES to follow sustainable trajectories in the Anthropocene that prevent it run into a much hotter potential equilibrium state.",
      "authors": [
        "Orfeu Bertolami",
        "Magnus Nyström"
      ],
      "categories": [
        "astro-ph.EP",
        "physics.geo-ph",
        "physics.soc-ph"
      ],
      "published": "2026-01-09T18:21:33Z",
      "updated": "2026-01-09T18:21:33Z",
      "pdf_link": "https://arxiv.org/pdf/2601.05994v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.05994v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 3
    },
    {
      "id": "2601.05313v1",
      "title": "Overestimated Pressure Broadening Misleads Model Spectra in Cool M Dwarf Stars",
      "abstract": "Available one-dimensional stellar models fail to reproduce the observed spectrum of the ultracool M dwarf TRAPPIST-1. In particular, current models predict strong iron hydride (FeH) absorption due to the Wing-Ford bands at 0.99$μ$m, yet this spectral feature is only weakly present in TRAPPIST-1 and other mid-to-late M dwarf stars. Additionally, the shape of the continuum between the water bands in the near-infrared does not match between models and observations. Here, we show that assumptions about pressure broadening, specifically van der Waals broadening, have a dramatic effect on modeled broadband spectral features. We use Merged Parallelized Simplified-ATLAS to generate synthetic spectra over a range of van der Waals broadening strengths, adopting 1D PHOENIX temperature-pressure structures. We find that minimal broadening best matches the observed FeH profile at 0.99$μ$m and in the pseudocontinuum between the large water bands. These results suggest that broadening prescriptions derived for Sun-like stars are not valid for lower-mass stars and that pressure broadening for molecular lines in cool stellar atmospheres must be reevaluated. Refining pressure broadening treatments will improve the accuracy of M dwarf spectral models, enabling more reliable determinations of stellar properties and atmospheric compositions of planets orbiting M dwarfs.",
      "authors": [
        "Ana Glidden",
        "Veronika Witzke",
        "Alexander I. Shapiro",
        "Sara Seager"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-08T19:00:01Z",
      "updated": "2026-01-08T19:00:01Z",
      "pdf_link": "https://arxiv.org/pdf/2601.05313v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.05313v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 3
    },
    {
      "id": "2601.02171v3",
      "title": "Vetting and False Positive Analysis of TOI 864.01: Evidence for a Likely Hierarchical Eclipsing Binary Masked by Dilution",
      "abstract": "We present a detailed vetting analysis of the TESS candidate TOI 864.01, initially identified as a potential ultra-short-period ($P \\approx 0.52$ d) Earth-sized planet orbiting an M-dwarf. Using 12 sectors of TESS photometry spanning a multi-year baseline, we recover a robust periodic transit-like signal. While the recovered transit depth is attenuated by detrending ($\\approx 158$ ppm), the SPOC pipeline reports an undiluted depth of $\\approx 640$ ppm. Stellar characterization based on Gaia DR3 astrometry yields a nominally single-star solution (RUWE = 1.18), highlighting the limitations of astrometric vetting for tight companions. Incorporating archival high-resolution imaging from the TESS Follow-up Observing Program (TFOP SG1) reveals a stellar companion at a separation of 0.04\", unresolved by both Gaia and TESS. Accounting for this close contaminant renders statistical validation inapplicable, as False Positive Probability calculations fail to converge in this regime of extreme dilution. Bayesian model comparison between planetary and eclipsing binary scenarios yields an inconclusive result ($Δ\\ln Z \\approx 0.09$), consistent with the strong degeneracy introduced by unresolved blending. Ground-based follow-up photometry further supports significant dilution, with a measured transit depth ($\\approx 0.37$ ppt) shallower than predicted under an undiluted planetary scenario ($\\approx 0.64$ ppt). Notably, ground-based observations also reveal a transit timing offset of 6.3 minutes late compared to the SPOC ephemeris, further supporting a non-planetary interpretation. Taken together, the available evidence favors a hierarchical eclipsing binary interpretation. We therefore classify TOI 864.01 as a probable False Positive and recommend its retirement from planetary candidate lists.",
      "authors": [
        "Biel Escolà-Rodrigo"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-05T14:47:52Z",
      "updated": "2026-01-11T19:03:49Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02171v3.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02171v3",
      "is_exoplanet_focused": true,
      "tweetability_score": 3
    },
    {
      "id": "2601.10598v1",
      "title": "A young progenitor for the most common planetary systems in the Galaxy",
      "abstract": "The Galaxy's most common known planetary systems have several Earth-to-Neptune-size planets in compact orbits. At small orbital separations, larger planets are less common than their smaller counterparts by an order of magnitude. The young star V1298 Tau hosts one such compact planetary system, albeit with four planets that are uncommonly large (5 to 10 Earth radii). The planets form a chain of near-resonances that result in transit-timing variations of several hours. Here we present a multi-year campaign to characterize this system with transit-timing variations, a method insensitive to the intense magnetic activity of the star. Through targeted observations, we first resolved the previously unknown orbital period of the outermost planet. The full 9-year baseline from these and archival data then enabled robust determination of the masses and orbital parameters for all four planets. We find the planets have low, sub-Neptune masses and nearly circular orbits, implying a dynamically tranquil history. Their low masses and large radii indicate that the inner planets underwent a period of rapid cooling immediately after dispersal of the protoplanetary disk. Still, they are much less dense than mature planets of comparable size. We predict the planets will contract to 1.5-4.0 Earth radii and join the population of super-Earths and sub-Neptunes that nature produces in abundance.",
      "authors": [
        "John H. Livingston",
        "Erik A. Petigura",
        "Trevor J. David",
        "Kento Masuda",
        "James Owen",
        "David Nesvorný",
        "Konstantin Batygin",
        "Jerome de Leon",
        "Mayuko Mori",
        "Kai Ikuta",
        "Akihiko Fukui",
        "Noriharu Watanabe",
        "Jaume Orell Miquel",
        "Felipe Murgas",
        "Hannu Parviainen",
        "Judith Korth",
        "Florence Libotte",
        "Néstor Abreu García",
        "Pedro Pablo Meni Gallardo",
        "Norio Narita",
        "Enric Pallé",
        "Motohide Tamura",
        "Atsunori Yonehara",
        "Andrew Ridden-Harper",
        "Allyson Bieryla",
        "Alessandro A. Trani",
        "Eric E. Mamajek",
        "David R. Ciardi",
        "Varoujan Gorjian",
        "Lynne A. Hillenbrand",
        "Luisa M. Rebull",
        "Elisabeth R. Newton",
        "Andrew W. Mann",
        "Andrew Vanderburg",
        "Guðmundur Stefánsson",
        "Suvrath Mahadevan",
        "Caleb Cañas",
        "Joe Ninan",
        "Jesus Higuera",
        "Kamen Todorov",
        "Jean-Michel Désert",
        "Lorenzo Pino"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T17:07:23Z",
      "updated": "2026-01-15T17:07:23Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10598v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10598v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 2
    },
    {
      "id": "2601.02479v1",
      "title": "Towards a global model for planet formation in layered MHD wind-driven discs: A population synthesis approach to investigate the impact of low viscosity and accretion layer thickness",
      "abstract": "Planet formation is inherently linked to protoplanetary disc evolution, which recent developments suggest is driven by magnetised winds rather than turbulent viscosity. We study planet formation in magnetohydrodynamic (MHD) wind-driven discs, assuming accretion occurs in a laminar surface layer above a weakly turbulent midplane. Our goal is to assess the global consequences of recent hydrodynamical results, including inefficient midplane heating and the existence of two Type II migration regimes: slow viscosity-dominated and fast wind-driven migration. We perform single-embryo planetary population syntheses with varying initial disc conditions (i.e. disc mass, size and angular momentum transport), and embryo starting locations, testing different prescriptions for the accretion layer thickness $Σ_\\text{active}$. Thin ($\\lesssim0.01\\mathrm{g\\,cm^{-2}}$) or fast ($\\gtrsim12\\%$ sonic velocity) accretion layers result in slow, viscosity-dominated regime which strongly limits the extent of Type II migration. For thick ($\\gtrsim1\\mathrm{g\\,cm^{-2}}$) or slow ($\\lesssim3\\%$ sonic velocity) accretion layers, fast wind-driven Type II migration occurs frequently, leading to long-range inward migration that sets in once planets reach masses sufficient to block the accreting layer. Disk-limited gas accretion is also strongly affected by deep and early gap opening, limiting maximum giant planet masses. These effects strongly influence the final mass-distance distribution. For thin layers, giant planets form nearly in situ once they have entered Type II migration, which happens already at a few Earth masses, while thick layers lead to numerous migrated Hot Jupiters. Overall, we find that while the global properties of the emerging planet population are strongly modified relative to classical viscous discs, key properties of the observed population can be reproduced within this new paradigm.",
      "authors": [
        "Jesse Weder",
        "Christoph Mordasini"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-05T19:00:06Z",
      "updated": "2026-01-05T19:00:06Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02479v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02479v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 2
    },
    {
      "id": "2601.02324v1",
      "title": "Hunting for \"Oddballs\" with Machine Learning: Detecting Anomalous Exoplanets Using a Deep-Learned Low-Dimensional Representation of Transit Spectra with Autoencoders",
      "abstract": "This study explores the application of autoencoder-based machine learning techniques for anomaly detection to identify exoplanet atmospheres with unconventional chemical signatures using a low-dimensional data representation. We use the Atmospheric Big Challenge (ABC) database, a publicly available dataset with over 100,000 simulated exoplanet spectra, to construct an anomaly detection scenario by defining CO2-rich atmospheres as anomalies and CO2-poor atmospheres as the normal class. We benchmarked four different anomaly detection strategies: Autoencoder Reconstruction Loss, One-Class Support Vector Machine (1 class-SVM), K-means Clustering, and Local Outlier Factor (LOF). Each method was evaluated in both the original spectral space and the autoencoder's latent space using Receiver Operating Characteristic (ROC) curves and Area Under the Curve (AUC) metrics. To test the performance of the different methods under realistic conditions, we introduced Gaussian noise levels ranging from 10 to 50 ppm. Our results indicate that anomaly detection is consistently more effective when performed within the latent space across all noise levels. Specifically, K-means clustering in the latent space emerged as a stable and high-performing method. We demonstrate that this anomaly detection approach is robust to noise levels up to 30 ppm (consistent with realistic space-based observations) and remains viable even at 50 ppm when leveraging latent space representations. On the other hand, the performance of the anomaly detection methods applied directly in the raw spectral space degrades significantly with increasing the level of noise. This suggests that autoencoder-driven dimensionality reduction offers a robust methodology for flagging chemically anomalous targets in large-scale surveys where exhaustive retrievals are computationally prohibitive.",
      "authors": [
        "Alexander Roman",
        "Emilie Panek",
        "Roy T. Forestano",
        "Eyup B. Unlu",
        "Katia Matcheva",
        "Konstantin T. Matchev"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "cs.LG"
      ],
      "published": "2026-01-05T18:15:53Z",
      "updated": "2026-01-05T18:15:53Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02324v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02324v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 2
    },
    {
      "id": "2601.04484v1",
      "title": "Transit Photometry and Ephemeris Refinement of WASP-12 b Using TESS Data",
      "abstract": "We present a detailed transit photometric analysis of the ultra-hot Jupiter WASP-12 b using data from the Transiting Exoplanet Survey Satellite (TESS). The study is based on publicly available calibrated light curves and target pixel files accessed through the Mikulski Archive for Space Telescopes (MAST) cloud infrastructure. After extracting and normalizing the photometric time series, the light curve was phase-folded using an initial ephemeris and modeled with a physical transit model to determine the system's geometric parameters. From the transit modeling, we measure the planet-to-star radius ratio, orbital inclination, impact parameter, and transit duration. Adopting stellar parameters from the literature, we derive the planetary radius and transit depth, confirming the highly inflated nature of WASP-12 b. Individual mid-transit times were measured and used to refine the orbital ephemeris through a weighted linear fit. The resulting refined orbital period and reference epoch improve the predictive accuracy of future transit times over the TESS observational baseline. An observed-minus-calculated (O-C) analysis reveals no statistically significant transit timing variations, indicating that the timing data are consistent with a linear ephemeris within the measurement uncertainties. This work demonstrates the capability of TESS photometry to provide precise transit characterization and ephemeris refinement for well-studied exoplanet systems, and provides updated parameters that are relevant for future atmospheric and dynamical investigations of WASP-12 b.",
      "authors": [
        "Chinedu Jude Nnaji"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-08T01:36:01Z",
      "updated": "2026-01-08T01:36:01Z",
      "pdf_link": "https://arxiv.org/pdf/2601.04484v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.04484v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 1
    },
    {
      "id": "2601.02621v2",
      "title": "Where does the simplified Stellar Contamination Model fail in Exoplanet Transmission Spectroscopy?",
      "abstract": "Stellar photospheric heterogeneities (e.g., starspots, faculae) distort the stellar spectrum in transit and imprint wavelength-dependent biases on the planet-to-star radius ratio (Transit Light Source Effect, TLSE). The Rackham-TLSE (R-TLSE) prescription applies a disc-averaged correction based solely on filling factor and spectral contrast, but transmission spectroscopy also depends on limb darkening, active-region distribution, and transit geometry. We include these in a pixel-resolved framework, ECLIPSE-Xlambda, and run idealised noise-free model-model comparisons to R-TLSE. For LHS 1140 b, K2-18 b, and WASP-69 b, disc-averaged corrections differ from the pixel model by up to about 400 ppm in the optical for active hosts and non-equatorial transits, but stay below about 10 ppm in the near-infrared where limb darkening is weak. We then apply both approaches to the JWST/NIRISS SOSS spectrum of LHS 1140 b. With limb darkening set to zero, ECLIPSE-Xlambda recovers stellar-contamination parameters matching the reference R-TLSE solution, confirming consistency in the disc-averaged limit. With wavelength-dependent limb darkening, reproducing the short-wavelength slope via stellar contamination alone requires hot faculae (delta Tfac about 600 K; ffac about 0.35), equivalent to a circular facular region of radius about 0.6 Rstar (about 60% of the stellar radius) on the disc; such an extended unocculted region is physically unlikely even for an active M dwarf. Purely stellar contamination would therefore require extreme faculae, whereas a genuine atmospheric contribution complementing a more modest facular signal is more plausible. These results delineate the validity regime of R-TLSE and underscore the need for geometry-aware stellar-heterogeneity models including limb darkening in high-precision transmission spectroscopy.",
      "authors": [
        "Viktor Y. D. Sumida",
        "Raissa Estrela",
        "Mark Swain",
        "Adriana Valio"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "published": "2026-01-06T00:40:16Z",
      "updated": "2026-01-07T17:26:26Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02621v2.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02621v2",
      "is_exoplanet_focused": true,
      "tweetability_score": 1
    },
    {
      "id": "2601.10285v1",
      "title": "How disc initial conditions sculpt the atmospheric composition of giant planets",
      "abstract": "Past studies have revealed the dependency of the disc parameters (mass, radius, viscosity, grain fragmentation velocity, dust-to-gas ratio) on the formation of giant planets, where more massive discs seem beneficial for giant planet formation. It is unclear how the different disc properties influence the composition of forming giant planets. The idea that the atmospheric abundances can trace directly the formation location of planets is put into question, due to the chemical evolution of the disc, caused by inward drifting and evaporating pebbles. This complicates the idea of a relation between atmospheric abundances and planet formation locations. We use planet formation simulations that include the effects of pebble drift and evaporation and investigate how the different disc parameters influence the atmospheric composition of giant planets. We focus on the atmospheric C/O, C/H, O/H and S/H ratios allowing us to probe tracers for volatiles and refractories and thus different accretion pathways of giant planets. We find that most of the disc parameters have only a limited influence on the atmospheric abundances of gas giants, except for the dust-to-gas ratio, where a larger value results in higher atmospheric abundances. However the atmospheric abundances are determined by the planetary formation location, even in the pebble drift and evaporation scenario. Our study suggests that volatile-rich giant exoplanets predominantly form in the inner disc regions, where they can accrete large fractions of vapour-enhanced gas. Our study shows that simulations that try to trace the origin of giant planets via their atmospheric abundances do not have to probe all disc parameters, as long as the disc parameters allow the formation of giant planets. Our study thus suggests that the diversity of observed planetary compositions is a direct consequence of their formation location and migration history.",
      "authors": [
        "Angie Daniela Guzmán Franco",
        "Sofia Savvidou",
        "Bertram Bitsch"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T11:01:08Z",
      "updated": "2026-01-15T11:01:08Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10285v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10285v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0
    },
    {
      "id": "2601.09835v1",
      "title": "A Robust Launching Mechanism for Freely-Floating Planets from Host Stars with Close-in Planets",
      "abstract": "Secular perturbations from binary stars and distant massive planets can drive cold planets onto nearly parabolic orbits with pericenter passages extremely close to their host stars. Meanwhile, short-period super-Earths are frequently observed around nearby stars. Gravitational scattering between these two distinct populations can lead to substantial orbital energy exchange, liberating some intruders from the gravitational confinement of their host systems. This process offers a robust formation channel for a subset of the abundant freely floating planet population. It may also significantly perturb the original orbits of close-in planets, induce collisional trajectories between close-in planets and their host stars, and disrupt the dynamical evolution of cold planets toward close stellar encounters.",
      "authors": [
        "Xiaochen Zheng",
        "Zhuoya Cao",
        "Shigeru Ida",
        "Douglas N. C. Lin",
        "Shude Mao"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T19:49:45Z",
      "updated": "2026-01-14T19:49:45Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09835v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09835v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0
    },
    {
      "id": "2601.04315v1",
      "title": "Self-consistent Dynamical and Chaotic Tides in the REBOUNDx framework",
      "abstract": "At high eccentricities, tidal forcing excites vibrational modes within orbiting bodies known as dynamical tides. In this paper, we implement the coupled evolution of these modes with the body's orbit in the \\texttt{REBOUNDx} framework, an extension to the popular $N$-body integrator \\texttt{REBOUND}. We provide a variety of test cases relevant to exoplanet dynamics and demonstrate overall agreement with prior studies of dynamical tides in the secular regime. Our implementation is readily applied to various high-eccentricity scenarios and allows for fast and accurate $N$-body investigations of astrophysical systems for which dynamical tides are relevant.",
      "authors": [
        "Donald J. Liveoak",
        "Sarah C. Millholland",
        "Michelle Vick",
        "Daniel Tamayo"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "published": "2026-01-07T19:00:02Z",
      "updated": "2026-01-07T19:00:02Z",
      "pdf_link": "https://arxiv.org/pdf/2601.04315v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.04315v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0
    },
    {
      "id": "2601.02556v1",
      "title": "The Lazuli Space Observatory: Architecture & Capabilities",
      "abstract": "The Lazuli Space Observatory is a 3-meter aperture astronomical facility designed for rapid-response observations and precision astrophysics across visible to near-infrared wavelengths (400-1700 nm bandpass). An off-axis, freeform telescope delivers diffraction-limited image quality (Strehl $>$0.8 at 633 nm) to three instruments across a wide, flat focal plane. The three instruments provide complementary capabilities: a Wide-field Context Camera (WCC) delivers multi-band imaging over a 35' $\\times$ 12' footprint with high-cadence photometry; an Integral Field Spectrograph (IFS) provides continuous 400-1700 nm spectroscopy at R $\\sim$ 100-500 for stable spectrophotometry; and an ExtraSolar Coronagraph (ESC) enables high-contrast imaging expected to reach raw contrasts of $10^{-8}$ and post-processed contrasts approaching $10^{-9}$. Operating from a 3:1 lunar-resonant orbit, Lazuli will respond to targets of opportunity in under four hours--a programmatic requirement designed to enable routine temporal responsiveness that is unprecedented for a space telescope of this size. Lazuli's technical capabilities are shaped around three broad science areas: (1) time-domain and multi-messenger astronomy, (2) stars and planets, and (3) cosmology. These capabilities enable a potent mix of science spanning gravitational wave counterpart characterization, fast-evolving transients, Type Ia supernova cosmology, high-contrast exoplanet imaging, and spectroscopy of exoplanet atmospheres. While these areas guide the observatory design, Lazuli is conceived as a general-purpose facility capable of supporting a wide range of astrophysical investigations, with open time for the global community. We describe the observatory architecture and capabilities in the preliminary design phase, with science operations anticipated following a rapid development cycle from concept to launch.",
      "authors": [
        "Arpita Roy",
        "Stuart Feldman",
        "Pete Klupar",
        "John DiPalma",
        "Saul Perlmutter",
        "Ewan S. Douglas",
        "Greg Aldering",
        "Gabor Furesz",
        "Patrick Ingraham",
        "Gudmundur Stefansson",
        "Douglas Kelly",
        "Fan Yang Yang",
        "Thomas Wevers",
        "Nicole Arulanantham",
        "James Lasker",
        "Mickael Rigault",
        "Everett Schlawin",
        "Sander R. Zandbergen",
        "S. Pete Worden",
        "Ramya Anche",
        "Heejoo Choi",
        "Ian J. M. Crossfield",
        "Kevin Derby",
        "Jerry Edelstein",
        "Mike Eiklenborg",
        "Suvi Gezari",
        "Paul Giuliano",
        "Justin Hom",
        "Taylor J. Hoyt",
        "Hyukmo Kang",
        "Daewook Kim",
        "Keerthi Kunnumkai",
        "Leander Lacroix",
        "Jared R. Males",
        "Thomas J. Maccarone",
        "Kian Milani",
        "Timothy N. Miller",
        "Kelsey Lynn Miller",
        "Pierre Nicolas",
        "Antonella Palmese",
        "Jason Pero",
        "Laurent Pueyo",
        "Stephanie Rinaldi",
        "David J. Sand",
        "Christian Schneider",
        "Sanchit Sabhlok",
        "Arfon Smith",
        "Irina I. Stefan",
        "Saraswathi Kalyani Subramanian",
        "Kyle Van Gorkom",
        "Andre F. Wong",
        "Jaegun Yoo",
        "Md Abdullah Al Zaman",
        "the Lazuli Science Team"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.CO",
        "astro-ph.EP",
        "astro-ph.HE",
        "astro-ph.SR"
      ],
      "published": "2026-01-05T21:12:43Z",
      "updated": "2026-01-05T21:12:43Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02556v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02556v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0
    },
    {
      "id": "2601.07088v1",
      "title": "On the 3D time evolution of the dust size distribution in protostellar envelopes",
      "abstract": "Dust plays a fundamental role during protostellar collapse, disk and planet formation. Recent observations suggest that efficient dust growth may begin early, in the protostellar envelopes, potentially even before the formation of the disk. Three-dimensional models of protostellar evolution, addressing multi-size dust growth, gas and dust dynamics and magnetohydrodynamics, are required to characterize the dust evolution in the embedded stages of star formation. We aim to establish a new framework for dust evolution models, following in 3D the dust size distribution both in time and space, in MHD models describing the formation and evolution of star-disk systems, at low numerical cost. We present our work coupling the COALA dust evolution module into the code RAMSES, performing the first 3D MHD simulation of protostellar collapse including simultaneously polydisperse dust growth modeled by the Smoluchowski equation as well as dust dynamics in the terminal velocity approximation. Ice-coated micron-sized grains can rapidly grow in the envelope and survive by not entering the fragmentation regime. The evolution of the dust size distribution is highly anisotropic due to the turbulent nature of the collapse and the development of favorable locations such as outflow cavity walls, which enhance locally the dust-to-gas ratio. We analyzed the first 3D non-ideal MHD simulations that self-consistently account for the dust dynamics and growth during the protostellar stage. Very early in the lifetime of a young embedded protostar, micron-sized grains can grow, and locally the dust size distribution deviates significantly from the MRN initial shape. This new numerical method opens the perspective to treat simultaneously gas/dust dynamics and dust growth in 3D simulations at a low numerical cost for several astrophysical environments.",
      "authors": [
        "Maxime Lombart",
        "Ugo Lebreuilly",
        "Anaëlle Maury"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "published": "2026-01-11T22:50:21Z",
      "updated": "2026-01-11T22:50:21Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07088v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07088v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 10
    },
    {
      "id": "2601.06420v1",
      "title": "Simulations of Electron Beam Interactions in Brown Dwarf Atmospheres",
      "abstract": "Over two decades ago, the first detection of electron cyclotron maser instability (ECMI) radio emission from a brown dwarf confirmed the presence of aurorally precipitating electrons on these objects. This detection established that brown dwarfs can exhibit magnetic activity that is planetary and auroral, rather than stellar in nature. This discovery motivated ongoing observational searches for the corresponding optical, ultraviolet (UV), and infrared (IR) auroral emission expected based on solar system analogs. The continuing nondetection of such auroral emission indicates important differences exist between auroral processes on brown dwarfs and solar system planets. In this work, we implement a Monte Carlo simulation of monoenergetic electron beams interacting with brown dwarf atmospheres, as a step towards understanding the physics of brown dwarf auroral emission. We detail the algorithm and underlying assumptions, and validate against previously published Jovian results (Hiraki et al. 2008). Our results agree well with literature, with some discrepancy from our updated interaction cross sections. We demonstrate the applicability of our simulation across the range of surface gravities and effective temperatures of radio-emitting brown dwarfs. We present an analytic parameterization of interaction rates based on our finding that atmospheric column density governs the interaction profiles. We apply this parameterization to calculate the total volumetric interaction rates and energy deposition rate for representative electron beam energy spectra enabling future predictions for spectra of aurorally emitting brown dwarfs. Simulations of high energy electron interactions with substellar hydrogen-dominated atmospheres will guide observational searches for multi-wavelength auroral features beyond the solar system.",
      "authors": [
        "Anna Zuckerman",
        "J. Sebastian Pineda",
        "David Brain",
        "James Mang",
        "Caroline Morley"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-10T04:01:51Z",
      "updated": "2026-01-10T04:01:51Z",
      "pdf_link": "https://arxiv.org/pdf/2601.06420v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.06420v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 10
    },
    {
      "id": "2601.05412v1",
      "title": "Detection of the 2021 Arid Meteor Shower on Maunakea, Hawai'i",
      "abstract": "We report the successful detection of the \"Arid\" Meteor Shower (IAU\\#1130 ARD), predicted to emerge for the first time in 2021, using a publicly accessible YouTube live camera developed by us. This live camera, installed on the Subaru Telescope dome in the summit region of Maunakea, Hawai'i, features a wide field of view (70 deg by 40 deg) and high sensitivity, capable of observing stars fainter than 6th magnitude. Meteor detection was performed in two ways: visual inspection by citizen viewers and subsequent validation through automated detection. As a result, we confirmed that the number of meteors appearing from near the predicted radiant increased by more than six times (~9 sigma) compared to the preceding and following days. Our observation time was 4-5 hours after the predicted peak (solar longitude = 193.9 deg), providing clear data indicating that the activity had not yet declined. Optical observations at this time from the Northern Hemisphere are extremely limited and unique, making our observation point valuable. The meteors are characterized as slow and faint appearance, but several brighter meteors with wakes were also observed. Simulations tracing the dust trails from the parent body, Comet 15P/Finlay, suggest that our detection can be explained by either the dust trails released in 2008 or 2014, both requiring high ejection velocities. However, during the comet's 2008 return, its activity was exceptionally quiet, making a high-velocity dust ejection questionable. On the other hand, multiple large outbursts were observed during the 2014 return, at which time a certain amount of high-velocity dust release is expected. We conclude that the dust source of the meteor shower detected in Hawai'i this time is likely attributable to high-velocity (~67 m s-1) dust ejected during the 2014 outburst.",
      "authors": [
        "Ichi Tanaka",
        "Hitoshi Hasegawa",
        "Toyokazu Uda",
        "Mikiya Sato",
        "Jun-ichi Watanabe",
        "Masanobu Higashiyama"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-08T22:32:54Z",
      "updated": "2026-01-08T22:32:54Z",
      "pdf_link": "https://arxiv.org/pdf/2601.05412v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.05412v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 10
    },
    {
      "id": "2601.08923v1",
      "title": "Origin of asteroid (469219) Kamo`oalewa: the main asteroid belt or the Giordano Bruno crater on the Moon?",
      "abstract": "Asteroid Kamo`oalewa is the target of the Tianwen-2 sample-return mission by CNSA. Because of its orbit and its spectral properties, it was proposed that Kamo`oalewa originated from the Moon as impact ejecta, possibly from the Giordano Bruno crater. We aim at estimating the relative contribution of Kamo`oalewa-like objects originating from the general near-Earth asteroid (NEA) population which originated in the main asteroid belt, and compare it with the relative contribution of Giordano Bruno ejecta. We first estimate the average fraction of quasi-satellite orbits at any given time. By using recently developed NEA population models, we extract the expected number of Earth co-orbitals of the same size of Kamo`oalewa, and then get an estimate of the average number of Kamo`oalewa-like objects using the fraction computed before. Similarly, we obtain an estimate for the number of Kamo`oalewa-like objects that may originate as ejecta from the Giordano Bruno impact. We also performed survey simulations to estimate their efficiency in the detection of Kamo`oalewa-like objects. We found that the main belt accounts for 1.23 \\pm 0.13 Kamo`oalewa-like objects on average. The expected number of Kamo`oalewa-like objects originated as Giordano Bruno ejecta is 0.042, which is more than order of magnitude smaller. We found a discovery efficiency of Earth quasi-satellites between 95% and 70% for absolute magnitude between 22 and 25 for the Pan-STARRS survey, and population models show that this is in agreement with the known population. The Vera Rubin Observatory should reach an efficiency of 92% down to absolute magnitude 25. These estimates show that population models of NEAs are capable to account for Kamo`oalewa-like objects, thus supporting the hypothesis that that Kamo'oalewa originated from the main belt. This will be further investigated by the in-situ exploration of the Tianwen-2 mission.",
      "authors": [
        "M. Fenucci",
        "B. Novaković",
        "M. Granvik",
        "P. Zhang"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T19:02:05Z",
      "updated": "2026-01-13T19:02:05Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08923v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08923v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 8
    },
    {
      "id": "2601.09671v1",
      "title": "Parallaxes, Proper Motions, and Near-Infrared Photometry for 173 L and T Dwarfs From The US Naval Observatory Infrared Astrometry Program",
      "abstract": "We present near-infrared parallax and proper motion astrometry for 74 L-dwarfs and 99 T-dwarfs, as single objects or in binary systems, obtained with the ASTROCAM astrometric imager on the USNO, Flagstaff Station 1.55-m telescope over two observing periods. For all 173 objects the median number of observational epochs was 62 with a median time frame of 5.25 years, resulting in median uncertainties of $σ$($π_{abs}$) = 1.51 mas, $σ$($μ_{abs}$) = 1.02 mas yr$^{-1}$, and $σ$($V_{\\rm tan}$) = 1.01 km s$^{-1}$. Our observations provide the first parallax/proper motion results for 16 objects and the highest precision parallaxes/proper motions for an additional 116 objects. A serendipitous overlap of 40 objects with Gaia DR3 astrometry allows direct comparison and confirmation of our results, along with an investigation on the effects of resolved binarity on astrometric results. We also provide a uniform set of $J$-, $H$-, $K_{S}$-band photometry in the UKIRT/MKO system, most of it being from new observations. We use these results to examine objects included in this study of special-interest populations, consisting of binaries, wide companions, young objects, subdwarfs, and brown dwarf spectral standards.",
      "authors": [
        "Frederick J. Vrba",
        "Adam C. Schneider",
        "Jeffrey A. Munn",
        "Arne A. Henden",
        "Christain B. Luginbuhl",
        "Conard C. Dahn",
        "Harry H. Guetter",
        "Blaise J. Canzian",
        "Trudy M. Tilleman",
        "Scott E. Dahm",
        "Stephen J. Williams",
        "Justice E. Bruursema",
        "J. Davy Kirkpatrick",
        "Adam J. Burgasser"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-14T18:12:18Z",
      "updated": "2026-01-14T18:12:18Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09671v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09671v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 7
    },
    {
      "id": "2601.09639v1",
      "title": "Constraining the size, shape, and albedo of the large Trans-Neptunian Object (28978) Ixion with multi-chord stellar occultations",
      "abstract": "Trans-Neptunian objects (TNOs) are among the most primitive remnants of the early Solar System, and constraining their sizes, shapes, albedos, and surface properties is essential for understanding their origin and evolution. Stellar occultations provide highly accurate size and shape measurements for TNOs, while photometry constrains their albedo and surface colours. (28978) Ixion is one of the largest TNOs and a prominent Plutino, making it a key target for comparative studies. We aim to constrain Ixion's projected size, shape, absolute magnitude, geometric albedo, and surface colours, and to search for evidence of an atmosphere or circum-object material. We analysed stellar occultation campaigns by Ixion conducted between 2020 and 2023 within the Lucky Star collaboration, comprising 51 observations from eight events, including 30 positive detections. Five multi-chord events enabled a global limb fit and an accurate reconstruction of Ixion's projected shape. The occultations reveal a slightly elongated limb well represented by a single projected ellipse, yielding an area-equivalent diameter of $D_{\\mathrm{equiv}} = 696.78^{+10.75}_{-8.87}$ km and an apparent oblateness $ε' = 0.081^{+0.004}_{-0.010}$. Typical radial residuals of order $\\sim$10 km indicate a largely stable shape across epochs, with modest epoch-dependent variations. Calibrated photometric data yield an absolute magnitude of $H_V = 3.845 \\pm 0.006$, a phase-curve slope of $β= 0.1301 \\pm 0.0078$ mag deg$^{-1}$, and a visible geometric albedo of $p_V = 0.106^{+0.003}_{-0.003}$, with colours consistent with moderately red TNO surfaces. No atmosphere or circum-object material is detected down to our sensitivity limits. The best-sampled event also allows a precise measurement of the angular diameter of the occulted star Gaia DR3 4056440205544338944, $θ_\\star = 0.670 \\pm 0.010$ mas.",
      "authors": [
        "Y. Kilic",
        "F. Braga-Ribas",
        "C. L. Pereira",
        "J. L. Ortiz",
        "B. Sicardy",
        "P. Santos-Sanz",
        "O. Erece",
        "J. L. Rizos",
        "J. M. Gómez-Limón",
        "G. Margoti",
        "D. Souami",
        "B. Morgado",
        "A. Gomes-Junior",
        "L. M. Catani",
        "J. Desmars",
        "M. Kretlow",
        "F. Rommel",
        "R. Duffard",
        "A. Alvarez-Candal",
        "J. I. B. Camargo",
        "M. Kaplan",
        "N. Morales",
        "D. Herald",
        "M. Assafin",
        "G. Benedetti-Rossi",
        "R. Sfair",
        "R. Savalle",
        "J. Arcas-Silva",
        "L. Bernasconi",
        "T. Blank",
        "M. Bonavita",
        "N. Carlson",
        "B. Christophe",
        "C. A. Colesanti",
        "M. Collins",
        "G. Columba",
        "R. Dunford",
        "D. W. Dunham",
        "J. Dunham",
        "M. Emilio",
        "W. G. Ferrante",
        "T. George",
        "W. Hanna",
        "G. Isopi",
        "R. Jones",
        "D. A. Kenyon",
        "S. Kerr",
        "V. Kouprianov",
        "P. D. Maley",
        "F. Mallia",
        "J. Mattei",
        "M. Meunier",
        "T. Napoleao",
        "V. F. Peixoto",
        "J. Pollock",
        "C. Snodgrass",
        "A. Stechina",
        "W. Thomas",
        "R. Venable",
        "G. R. Viscome",
        "A. Zapparata",
        "J. Bardecker",
        "N. Castro",
        "C. Cebral",
        "A. Chapman",
        "C. Gao",
        "K. Green",
        "A. Guimaraes",
        "C. Jacques",
        "E. Jehin",
        "M. Konishi",
        "R. Leiva",
        "L. Liberato",
        "C. Magliano",
        "L. A. Mammana",
        "M. Melita",
        "V. Moura",
        "Y. Olivera-Cuello",
        "L. Peiro",
        "J. Spagnotto",
        "P. C. Stuart",
        "L. Vanzi",
        "A. Wilberger",
        "M. Malacarne"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T17:20:09Z",
      "updated": "2026-01-14T17:20:09Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09639v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09639v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 7
    },
    {
      "id": "2601.09401v1",
      "title": "True Masses using RV data with Hipparcos and Gaia Astrometry",
      "abstract": "Long-period companions are detected and characterized thanks to long-baseline radial velocity surveys. Combining Doppler time-series with astrometry, and in particular with proper motion anomalies technique, it is possible to put strong constraints on their orbital inclination and true mass. This work aims to present a model that combines Hipparcos and Gaia astrometric data with radial velocity measurements to constrain the orbital inclinations and true masses of long-period companions. Additionally, we re-analyse a small sample of targets that have not yet been studied using this combined approach. This research leverages the simultaneous modelling of proper motion anomalies and radial velocities, in conjunction with an analysis of the sensitivity curve. This approach serves not only as a verification of the parameters but also as a means to acquire valuable insights into planetary systems. The new analyses reveal that some of the targets classified as brown dwarfs or small-mass stars have a planetary nature. HD 5388 b and HD 6718 b are likely planets. HD 141937 b is likely a planet, but the current dataset does not allow us to firmly constrain its true mass. HD 16760 b belongs to the brown dwarf regime and it has a probable second companion. 30 Ari B b falls within the stellar regime, but the presence of an additional stellar companion could compromise the reliability of the final results. For HD 148427 b, HD 96127 b and HIP 65891 b we determined a range for the orbital inclinations.",
      "authors": [
        "G. Piccinini",
        "A. Petralia",
        "A. Sozzetti",
        "S. Benatti",
        "D. Gandolfi",
        "G. Micela"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T11:44:26Z",
      "updated": "2026-01-14T11:44:26Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09401v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09401v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 7
    },
    {
      "id": "2601.03659v1",
      "title": "Protonic thermoelectric effect of Superionic H2O and magnetic field generation in Uranus and Neptune",
      "abstract": "Uranus and Neptune are characterized by anomalously tilted and multi-dipole magnetic fields, which poses substantial challenges for elucidating the internal mechanisms generating magnetic fields. Recent investigations confirmed that superionic H2O is thermodynamically stable and constitutes the dominant H2O phase within their icy mantles. In this study, we demonstrate that the superionic H2O ice exhibits a pronounced protonic thermoelectric effect, in which the maximum Seebeck coefficient within the interior of Uranus can reach approximately 620 uV/K, whereas that of Neptune is lower, within the range of 570-585 uV/K. Consequently, temperature gradients in the icy mantles can induce proton convection, which in turn drives magnetic field generation. Based on this novel mechanism, the disparities in magnetic field strength between Uranus and Neptune can be accounted for exclusively by their differing internal temperature gradients, and the predicted values are in agreement with observations.",
      "authors": [
        "Daohong Liu",
        "Wei Zhang",
        "Yu He",
        "Xinzhuan Guo",
        "Chuanyu Zhang",
        "Yang Sun"
      ],
      "categories": [
        "astro-ph.EP",
        "cond-mat.mtrl-sci"
      ],
      "published": "2026-01-07T07:16:26Z",
      "updated": "2026-01-07T07:16:26Z",
      "pdf_link": "https://arxiv.org/pdf/2601.03659v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.03659v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 7
    },
    {
      "id": "2601.10631v1",
      "title": "Circumplanetary Disk Candidate in the Disk of HD 163296 Traced by Localized Emission from Simple Organics",
      "abstract": "Atacama Large Millimeter/submillimeter Array observations suggest that the disc of HD 163296 is being actively shaped by embedded, yet unseen protoplanets, as indicated by numerous gas and dust substructures consistent with planet-disc interaction models. We report the first detection of simple organic molecules, HCN and C2H, tracing a candidate circumplanetary disc (CPD) in the HD 163296 system, located at an orbital radius of $R=88\\pm7$ au and azimuth $φ=46\\pm3^\\circ$ (or $R=0.75''$, $\\rm{PA}=350^\\circ$ in projected sky coordinates), and originating near the midplane of the circumstellar disc. The signature is localised but spectrally resolved, and it overlaps with a previously reported planet candidate, P94, identified through kinematic perturbations traced by CO lines. We propose a scenario in which the observed chemical anomalies arise from increased heating driven by the forming planet and ongoing accretion through its CPD, facilitating the thermal desorption of species that would otherwise remain frozen out in the disc midplane, and potentially triggering the activation barriers of chemical reactions that lead to enhanced molecular production. Based on a first-order dynamical analysis of the HCN spectrum from the CPD--isolated with a 7$σ$ significance--we infer an upper limit on the planet mass of 1.8 $M_{\\rm Jup}$, consistent with predictions from CO kinematics and constraints from direct imaging studies. By comparing the CPD sizes derived from our models with theoretical expectations where the CPD radius corresponds to roughly one-third of the planet's Hill radius, we favor CPD gas temperatures $T > 150$ K, planet masses $M_{\\rm p} < 1.0$ $M_{\\rm Jup}$, and CPD radii $R_{\\rm CPD} < 2$ au.",
      "authors": [
        "Andres F. Izquierdo",
        "Jaehan Bae",
        "Maria Galloway-Sprietsma",
        "Ewine F. van Dishoeck",
        "Stefano Facchini",
        "Giovanni Rosotti",
        "Jochen Stadler",
        "Myriam Benisty",
        "Leonardo Testi"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-15T17:50:13Z",
      "updated": "2026-01-15T17:50:13Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10631v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10631v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 6
    },
    {
      "id": "2601.08958v1",
      "title": "Depletion of moderately volatile elements by pebble accretion in Earth-like planets",
      "abstract": "Protoplanets growing by pebble accretion capture massive hydrogen-helium atmospheres from the surrounding nebula. Pebbles settling through such atmospheres continuously release gravitational potential energy, heating both the atmosphere and the pebbles. Under these conditions, atmosphere temperatures above large protoplanets are sufficiently high to melt silicate pebbles, support long-lived magma oceans, and drive evaporation of volatile species. Because these atmospheres are open to the nebula, some amount of volatile loss is inevitable. Here we analyze the depletion of moderately volatile elements from terrestrial protoplanets undergoing pebble accretion. We consider chondrule-size silicate pebbles enriched in Si, Na, K, and Zn relative to Earth, settling through a hydrogen-helium-rich atmosphere containing these same volatiles. We show that volatile depletion depends critically on protoplanet mass, the timescale of atmosphere exhaust, and the pebble composition. The protoplanetary mass effect is especially strong. For exhaust timescales of a few centuries, we find that substantial depletion of Zn begins around 0.4 Earth mass, and for Na and K around 0.6 Earth mass, with negligible depletion of these elements at smaller masses. Using a pebble composition that matches Earth's major element abundances, broad agreement with Earth's depletion trend for moderately volatile elements is found by merging a large (approximately 0.7 Earth mass) volatile-depleted target protoplanet with one or more smaller, less-depleted impactors.",
      "authors": [
        "Peter L. Olson",
        "Zachary D. Sharp",
        "Susmita Garai"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T19:51:51Z",
      "updated": "2026-01-13T19:51:51Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08958v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08958v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 6
    },
    {
      "id": "2601.08507v1",
      "title": "On the estimation of Sulfuric Acid Vapor concentrations below the Venus cloud deck using the Akatsuki Radio Science Experiment",
      "abstract": "We report new constraints on the vertical distribution of sulfuric acid vapor in the Venusian atmosphere, derived from a refined analysis of radio occultation (RO) data. The method estimates the power spectral density (PSD) of the received signal to recover both the signal intensity and the Doppler shift. The received signal power is estimated at 1-sec cadence which enhances the sensitivity and detection of the signal at lower altitudes of Venus, even in regions of high atmospheric opacity. After correcting total attenuation for refractive losses, absorption by known microwave absorbers is removed, leaving a residual signal attributable to sulfuric acid vapor. Two different methods of estimating the absorption due to Sulfur Dioxide have been presented, including one which incorporates in-situ data, which should better constrain the sulfuric acid vapor abundance below the clouds. Retrieved profiles for altitudes of 40 - 50 km reveal an increasing vapor abundance to more than 10 ppm below the clouds, and a sharp decline above 50 km in line with the expected saturation profile. These measurements agree with current models of the Venusian cloud structure and composition, and demonstrate that RO data, when coupled with optimized spectral analysis, can yield quantitative constraints on trace absorbers in optically thick atmospheres.",
      "authors": [
        "S. Banerjee",
        "R. K. Choudhary",
        "K. R. Tripathi",
        "T. Imamura",
        "H. Ando"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T12:42:25Z",
      "updated": "2026-01-13T12:42:25Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08507v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08507v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 6
    },
    {
      "id": "2601.06759v1",
      "title": "SPHEREx Re-Observation of Interstellar Object 3I/ATLAS in December 2025: Detection of Increased Post-Perihelion Activity, Refractory Coma Dust, and New Coma Gas Species",
      "abstract": "In December-2025, the NASA SPHEREx spacecraft re-observed ISO 3I/ATLAS post-perihelion, finding a much more active object compared to August-2025 SPHEREx pre-perihelion observations, with marked evidence for development into an cometary body fully sublimating all its ices. The new imaging spectrophotometry is dominated by spatially resolved features due to dust scattered-light and thermal emission plus gas-emissions from CN (0.93 um), H2O (2.7 um), organic C-H (3.2 to 3.6 um), CO2 (4.25 to 4.27 um), and CO (4.6 to 4.8 um). The CO2 gas-coma continues to be extended out to a 3 arcmin radius. The continuum spectral signature of H2O-ice absorption has mostly disappeared, replaced by scattered-light plus thermal-emission from organo-silicaceous dust grains while the H2O gas-emission is 20 times brighter. All but the organics-gas comae are circularly symmetric, while a weak pear-shaped solar-pointing dust tail consistent with large dust grains is now present. The new appearance of CN and C-H features suggests that these species are contained either in H2O phases or were trapped under them.",
      "authors": [
        "C. M. Lisse",
        "YP. Bach",
        "S. A. Bryan",
        "P. M. Korngut",
        "B. P. Crill",
        "A. J. Cukierman",
        "O. Doré",
        "A. Cooray",
        "B. Fabinsky",
        "A. L. Faisst",
        "H. Hui",
        "G. J. Melnick",
        "C. H. Nguyen",
        "Z. Rustamkulov",
        "V. Tolls",
        "M. W. Werner"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "published": "2026-01-11T03:31:54Z",
      "updated": "2026-01-11T03:31:54Z",
      "pdf_link": "https://arxiv.org/pdf/2601.06759v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.06759v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 6
    },
    {
      "id": "2601.09070v1",
      "title": "Ring-Gap Structures in the Class I Circumstellar Disk of CrA IRS 2 Associated with Magnetic Flux-Driven Bubble",
      "abstract": "Recent ALMA observations with 0''.1 resolution reveal characteristic substructures in circumstellar disks around young Class I sources, providing clues to the early stages of morphological disk evolution. In this paper, we applied PRIISM imaging to ALMA archival Band 6 continuum data of the circumstellar disk around the Class I protostar CrA IRS 2, located in the Corona Australis molecular cloud, which is associated with an extended gas ring attributed to magnetic flux advection driven by interchange instability. The dust continuum image with 1.5 times higher spatial resolution than conventional imaging revealed, for the first time, the early-phase circumstellar disk with both inner central hole and outer ring-gap structures, making CrA IRS 2 the youngest system exhibiting such features based on the bolometric temperature of $T_{\\rm bol}$=235 K. To examine planet-disk interaction as one possible origin of the outer ring-gap structure, we found the measured depth and width to be consistent with planet-disk interaction models, suggesting the existence of a giant planet with a mass of 0.1-1.8 $M_{\\rm Jup}$. The additional mechanism required for rapid planet formation could be the magnetic flux dissipation driven by the interchange instability, which suppresses MRI-driven turbulence and extends the dead zone, allowing efficient dust growth and the early formation of planets. This system thus provides new insight into how substructures and planet formation can emerge during the early, accreting phase of disk evolution.",
      "authors": [
        "Ayumu Shoshi",
        "Masayuki Yamaguchi",
        "Mitsuki Omura",
        "Kazuki Tokuda",
        "Naofumi Fukaya",
        "Kengo Tachihara",
        "Masahiro. N. Machida"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T01:53:03Z",
      "updated": "2026-01-14T01:53:03Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09070v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09070v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 5
    },
    {
      "id": "2601.08938v1",
      "title": "Can photoevaporation open gaps in protoplanetary discs?",
      "abstract": "We investigate whether photoevaporation alone can open and sustain gaps in protoplanetary discs by coupling the evolving disc structure with the photoevaporative flow in two dimensional radiation hydrodynamical simulations. Our results show that once a density depression forms, the local mass-loss rate decreases sharply, suppressing further gap deepening. Viscous inflow and radial mass transport along the disc surface act to partially refill the depleted region, preventing complete clearing. The resulting configuration is a persistent, partially depleted zone whose evolution is largely insensitive to the initial disc morphology. This behaviour challenges the standard paradigm that photoevaporation efficiently carves clean inner cavities and directly produces transition discs. However, the pressure maximum at the outer edge of the depression may still trap dust grains, giving rise to transition disc like observational signatures. We also present a first-order prescription to approximate this behaviour in one dimensional disc evolution models, suitable for use in planet formation and population synthesis studies. Although the prescription improves upon static mass-loss treatments, it remains approximate, underscoring the need for further multidimensional simulations and parameter-space exploration to derive robust recipes for global disc and planet population models.",
      "authors": [
        "Michael L. Weber",
        "Barbara Ercolano",
        "Giovanni Picogna"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-13T19:19:06Z",
      "updated": "2026-01-13T19:19:06Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08938v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08938v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 5
    },
    {
      "id": "2601.07457v1",
      "title": "Functionalization of Benzene Ices by Atomic Oxygen",
      "abstract": "Small aromatic molecules, including functionalized derivatives of benzene, are known to be present throughout the different stages of star and planet formation. In particular, oxygen-bearing monosubstituted aromatics, likely including phenol, have been identified in the coma of comet 67P. This suggests that, earlier in the star and planet formation evolution, icy grains may act as both reservoirs and sites of functionalization for these small aromatics. We investigate the ice-phase reactivity of singlet oxygen atoms (O($^1$D)) with benzene, using ozone as a precursor that is readily photodissociated by relatively low-energy. Our experiments show that O($^1$D) efficiently reacts with benzene, forming phenol, benzene oxide, and oxepine as the main products. Phenol formation is temperature-independent, consistent with a barrierless insertion mechanism. In contrast, the formation of benzene oxide/oxepine shows a slight temperature dependence, suggesting that additional reaction pathways involving either ground-state or excited-state oxygen atoms may contribute. In H$_2$O and \\COO ice matrices we find that dilution does not suppress formation of phenol. We extrapolate an experimental upper limit for the benzene-to-phenol conversion fraction of 27-44$\\%$ during the lifetime of an interstellar cloud, assuming O($^1$D) production rates based on CO$_2$ ice abundances and a cosmic-ray induced UV field. We compare these estimates with a new analysis of data from the comet 67P, where the C$_6$H$_6$O/C$_6$H$_6$ ratio is 20$\\pm$6$\\%$. This value lies within our estimated range, suggesting that O($^1$D)-mediated chemistry is a viable pathway for producing oxygenated aromatics in cold astrophysical ices, potentially enriching icy planetesimals with phenol and other biorelevant compounds.",
      "authors": [
        "Elettra L. Piacentino",
        "Alexandra McKinnon",
        "Nora Hänni",
        "Amit Daniely",
        "Estefania Rossich Molina",
        "Tamar Stein",
        "Jennifer Bergner",
        "Mahesh Rajappan",
        "Karin I. Öberg"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR",
        "physics.chem-ph"
      ],
      "published": "2026-01-12T12:05:44Z",
      "updated": "2026-01-12T12:05:44Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07457v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07457v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 5
    },
    {
      "id": "2601.06563v1",
      "title": "High-order expansions of multi-revolution elliptic Halo orbits in the elliptic restricted three-body problem",
      "abstract": "Multi-revolution elliptic Halo (ME-Halo) orbits are a special class of symmetric and periodic solutions within the framework of the elliptic restricted three-body problem (ERTBP). During a single period, an M:N ME-Halo orbit completes $M$ revolutions around a libration point and the primaries revolve N times around each other. Owing to the repeated configurations, ME-Halo orbits hold great promise as nominal trajectories for space mission design. However, a major challenge associated with ME-Halo orbits lies in their mathematical description. To this end, we propose a novel method to derive high-order analytical expansions of ME-Halo orbits in the ERTBP by introducing two correction terms into the equations of motion in the y- and z-directions. Specifically, both the coordinate variables and correction terms are expanded as power series in terms of the primary eccentricity, the in-plane amplitude, and the out-of-plane amplitude. High-order approximations are constructed using a perturbation method, and their accuracy is validated through numerical analysis. Due to the inherent symmetry, ME-Halo orbits can be classified into four distinct families: southern/northern and periapsis/apoapsis groups. The analytical approximations developed in this study not only provide high-accuracy initial guesses for the numerical computation of ME-Halo orbits, but also offer new insights into the dynamical environment near collinear libration points in the ERTBP, thereby advancing practical applications in mission design.",
      "authors": [
        "Xiaoyan Leng",
        "Hanlun Lei"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-10T13:17:51Z",
      "updated": "2026-01-10T13:17:51Z",
      "pdf_link": "https://arxiv.org/pdf/2601.06563v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.06563v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 5
    },
    {
      "id": "2601.05090v1",
      "title": "Surveying exogenous species in Saturn with ALMA I. Detecting and Mapping CO",
      "abstract": "The origin of carbon monoxide (CO) in Saturn's stratosphere remains uncertain, with proposed sources including internal thermochemical production, cometary impacts, and exogenic material from the rings and icy moons (i.e. Enceladus). We aim to constrain the vertical and meridional distribution of stratospheric CO and assess the relative contributions of these potential sources. Here, we analysed high-spectral-resolution ALMA observations of the CO (J=3-2) line obtained on 25 May 2018, sampling Saturn's limb from 20°S to 69°N. CO vertical profiles were retrieved using a line-by-line radiative transfer model combined with spectral inversion techniques, testing multiple prior scenarios representative of different source hypotheses. CO is confined to a narrow layer between 0.1 and 1 mbar, with a robust negative vertical gradient and mean abundances of (3.7+/- 0.8) x 10$^{-8}$ at 0.1 mbar and (7.2 +/- 0.9) x 10$^{-8}$ at 1 mbar. The meridional distribution is statistically homogeneous, with a marginal enhancement near 60° N plausibly related to Enceladus. No significant equatorial enhancement is detected. The absence of a strong equatorial enhancement rules out a long-lived steady source associated with ring infall. The observations are most consistent with a relatively recent ($\\approx$200-year-old or younger) cometary impact whose material has since been horizontally mixed, while any Cassini Grand Finale ring influx was either too recent or inefficient to affect CO abundances at the probed pressure levels.",
      "authors": [
        "Deborah Bardet",
        "Thierry Fouchet",
        "Thibault Cavalié",
        "Raphaël Moreno",
        "Emmanuel Lellouch",
        "Camille Lefour",
        "Bilal Benmahi",
        "Sandrine Guerlet"
      ],
      "categories": [
        "astro-ph.EP",
        "physics.ao-ph"
      ],
      "published": "2026-01-08T16:37:41Z",
      "updated": "2026-01-08T16:37:41Z",
      "pdf_link": "https://arxiv.org/pdf/2601.05090v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.05090v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 5
    },
    {
      "id": "2601.10666v1",
      "title": "Observation Timelines for the Potential Lunar Impact of Asteroid 2024 YR4",
      "abstract": "The near-Earth asteroid 2024 YR4 -- a $\\sim$60 m rocky object that was once considered a potential Earth impactor -- has since been ruled out for Earth but retained a $\\sim$4.3% probability of striking the Moon in 2032. Such an impact, with equivalent kinetic energy of $\\sim$6.5 Mt TNT, is expected to produce a $\\sim$1 km crater on the Moon, and will be the most energetic lunar impact event ever recorded in human history. Despite the associated risk, this scenario offers a rare and valuable scientific opportunity. Using a hybrid framework combining Monte Carlo orbital propagation, smoothed particle hydrodynamics (SPH) impact modeling, and N-body ejecta dynamics, we evaluate the physical outcomes and propose the observation timelines of this rare event. Our results suggest an optical flash of visual magnitude from -2.5 to -3 lasting several minutes directly after the impact, followed by hours of infrared afterglow from $\\sim$2000 K molten rock cooling to a few hundred K. The associated seismic energy release would lead to a global-scale lunar reverberation (magnitude $\\sim$5.0) that can be detectable by modern seismometers. Furthermore, the impact would eject $\\sim$10$^8$ kg of debris that escapes the lunar gravity, with a small fraction reaching Earth to produce a lunar meteor outburst within 100 years. Finally, we integrate these results into a coordinated observation timeline, identifying the best detection windows for ground-based telescopes, lunar orbiters, and surface stations.",
      "authors": [
        "Yifan He",
        "Yixuan Wu",
        "Yifei Jiao",
        "Wen-Yue Dai",
        "Xin Liu",
        "Bin Cheng",
        "Hexi Baoyin"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T18:33:03Z",
      "updated": "2026-01-15T18:33:03Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10666v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10666v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 4
    },
    {
      "id": "2601.07983v1",
      "title": "Modeling Cosmogenic 10Be During the Heliosphere's Encounter with an Interstellar Cold Cloud",
      "abstract": "Geologic records of cosmogenic 10Be are sensitive to changes in the radiation environment with time. Recent works suggest there are periods when the Sun encountered massive cold clouds which compressed the heliosphere to within Earth's orbit. This would expose Earth to increased galactic cosmic rays and MeV-energy particles of heliospheric origin. We model 10Be production in Earth's atmosphere during possible cold cloud encounters, and estimate their detectability in marine records of variable temporal resolution. We find that an AU-scale cold cloud encounter can be detected using ocean sediment measurements of 10Be if Earth spends time inside the compressed heliosphere. For typical relative speeds between the Sun and local interstellar clouds, this translates to a crossing time of ~100 years. A cloud must have an extension on the scale of parsecs to tens-of-parsecs (crossing time 0.1-1 Myr) to be detectable through 10Be measurements in iron-manganese crusts.",
      "authors": [
        "Anna Nica",
        "Merav Opher",
        "Jesse Miller",
        "Jennifer L. Middleton"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "physics.ao-ph"
      ],
      "published": "2026-01-12T20:30:48Z",
      "updated": "2026-01-12T20:30:48Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07983v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07983v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 4
    },
    {
      "id": "2601.02995v1",
      "title": "Mean opacity tables for probing the interior and atmosphere of giant planets",
      "abstract": "We present new Rosseland and Planck mean opacity tables relevant to the shallow interiors and atmospheres of giant planets. The tables span metallicities from 0.31 to 50 times solar, temperatures from 100 - 6000 K, and pressures from 1e-6 - 1e5 bar, thereby covering a wider parameter space than previous data sets. Our calculations employ the latest molecular and atomic line lists and pressure-broadening treatments, and include contributions from collision-induced absorption, free electrons, and scattering processes. We further provide cloudy mean opacity tables that account for cloud particle extinction across a range of particle sizes and capture the sequential removal of condensates as the gas cools. We benchmark our cloud-free tables against widely used opacity tables and find significant relative differences, exceeding 100% in Rosseland mean opacities at T \\gtrsim 3000 K due to the inclusion of additional short-wavelength absorbers. Differences in Planck mean opacities at high temperatures are even larger, in some cases exceeding two orders of magnitude, which is most likely driven by the inclusion of Ca, Mg, and Fe cross-sections and updated Na D and K I resonance line treatments. Cloud opacities substantially increase Rosseland mean opacities for T \\lesssim 2800 K, while their effect on Planck mean opacities is weaker. We also discuss limitations of our mean opacities at high pressures, where non-ideal effects become important. This work provides improved cloud-free mean opacity tables for giant planets, as well as the first publicly available cloudy mean opacity tables, which will enable more realistic modeling of their atmospheres and interiors.",
      "authors": [
        "Louis Siebenaler",
        "Yamila Miguel"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-06T13:18:22Z",
      "updated": "2026-01-06T13:18:22Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02995v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02995v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 4
    },
    {
      "id": "2601.02533v1",
      "title": "Catching 3I/ATLAS Using a Solar Oberth",
      "abstract": "The third interstellar object to be discovered, 3I/ATLAS, has a unique and continually unfolding story to tell about its nature and origin as it is monitored by telescopes on Earth, orbiting Earth and around the Solar System. Previous research into missions using chemical propulsion have only really addressed the direct case, where the opportunity to launch already expired before 3I/ATLAS's discovery. In contrast, investigations herein exploit 'Optimum Interplanetary Trajectory Software' to simulate an alternative indirect option for chemical propulsion, namely the Solar Oberth Manoeuvre (SOM). For a SOM, a low perihelion burn provides maximum benefit from the Oberth Effect, and accelerates the spacecraft rapidly towards the receding 3I/ATLAS. Though in principle feasible, results indicate this option presents significant challenges. For possible launch years between 2031 and 2037 inclusive, a 2035 launch permits the most efficient transfer to 3I/ATLAS. The reference mission requires a SOM at 3.2 Solar Radii from the Sun's centre, with an intercept after 35-50 years. It is found the SOM can leverage spacecraft masses up to $\\sim{500}$ kg. Two or three solid propellant boosters could deliver the required SOM $Δ$V, and furthermore a refuelled Starship Block 3 in LEO has sufficient performance for such a mission. As inevitable with a SOM, some of the payload mass would be needed for a heat shield to protect against the high solar flux at low perihelion.",
      "authors": [
        "Adam Hibberd",
        "T. Marshall Eubanks"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "published": "2026-01-05T20:12:15Z",
      "updated": "2026-01-05T20:12:15Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02533v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02533v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 4
    },
    {
      "id": "2601.07080v1",
      "title": "Magma Ocean Waves and Thermal Variability on Lava Worlds",
      "abstract": "Lava worlds are rocky planets with dayside skins made molten by stellar irradiation. Tidal heating on these shortest-period planets is more than skin deep. We show how orbital eccentricities of just a few percent (within current observed bounds and maintained secularly by exterior companions) can create deep magma oceans. ``Lava tidal waves'' slosh across these oceans; we compute the multi-modal response of the ocean to tidal forcing, subject to a coastline at the day-night terminator and a parameterized viscous drag. Wave interference produces a dayside heat map that is spatially irregular and highly time-variable; hotspots can wander both east and west of the substellar point, and thermal light curves can vary and spike aperiodically, from orbit to orbit and within an orbit. Heat deposited by tides is removed in steady state by a combination of fluid, mushy, and solid-state convection in the mantle. For Earth-sized planets with sub-day periods, the entire mantle may be tidally liquified.",
      "authors": [
        "Mohammad Farhat",
        "Eugene Chiang"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-11T22:07:11Z",
      "updated": "2026-01-11T22:07:11Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07080v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07080v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 3
    },
    {
      "id": "2601.05932v1",
      "title": "On the orbital evolution of binaries with polar circumbinary disks",
      "abstract": "Binaries occur in many astrophysical systems, from young protostellar binaries in star forming regions to supermassive black hole binaries in galaxy centers. In many cases, a circumbinary disk of gas forms around the binary with an orbit that may be misaligned to the binary plane. Misaligned disks around nearly circular binaries evolve into disks that are either aligned or counteraligned with the binary orbit. However, if the binary is sufficiently eccentric, then it can be more likely that the disk ends up in a polar-aligned configuration in which the disk angular momentum vector aligns with the binary eccentricity vector. We use Smoothed Particle Hydrodynamics simulations, evolved to an approximate steady state under mass injection, to determine the orbital evolution of a binary with a polar-aligned disk for a range of binary-disk parameters. We find that, in all of the cases we have simulated, the binary shrinks with time. The decay rate is larger than for binaries surrounded by aligned or retrograde disks with matched disk parameters. The rate of shrinkage is largely unaltered by the size of the sink radii employed for the binary stars, but for small enough sink radii some of the models exhibit long-lived polar circumprimary disks, which are continually fed mass from the circumbinary disk. We discuss our results in the contexts of planet formation in young polar-aligned disks and merging supermassive black holes in galaxy centers.",
      "authors": [
        "Cheng Chen",
        "Philip J. Armitage",
        "C. J. Nixon"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "published": "2026-01-09T16:45:50Z",
      "updated": "2026-01-09T16:45:50Z",
      "pdf_link": "https://arxiv.org/pdf/2601.05932v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.05932v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 3
    },
    {
      "id": "2601.02593v1",
      "title": "Isotopic Ratios in the Disk of HD 163296",
      "abstract": "Isotopic abundance ratios in protoplanetary disks are critical for understanding volatile inheritance and chemical evolution in planet-forming environments. We present Atacama Large Millimeter/submillimeter Array observations of the rare isotopologue 13C18O(2-1) at approximately 0.3 arcsec resolution from the disk around the Herbig Ae star HD 163296, combined with archival observations of C17O(2-1), C18O(1-0), and C17O(1-0), to empirically constrain carbon and oxygen isotopic ratios without detailed disk modeling. Both the C17O/13C18O(2-1) and C18O/C17O(1-0) flux ratios rise sharply across the CO snowline and flatten beyond 1.5 arcsec (r >= 150 au), where the emission becomes optically thin. This transition, reflecting a steep drop in CO column density set by the disk's thermal structure, makes HD 163296 an optimal case for isotopic analysis. Using beam-averaged intensities of the four transitions measured in this optically thin region, we derive isotopic ratios of 12C/13C = 75.3 (+14.7/-11.4) and 18O/17O = 3.28 (+0.31/-0.26), both consistent with local interstellar medium values. The 16O/18O ratio remains weakly constrained due to moderate optical depth in the C18O(1-0) line and degeneracy with CO column density. These results demonstrate that rare CO isotopologues can provide robust, empirical constraints on isotopic ratios in disks when sharp structural transitions allow for the identification of optically thin regions, and establish HD 163296 as a benchmark for extending such studies to other systems with resolved snowline structures.",
      "authors": [
        "Chunhua Qi",
        "David J. Wilner",
        "Catherine C. Espaillat"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-05T22:50:05Z",
      "updated": "2026-01-05T22:50:05Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02593v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02593v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 3
    },
    {
      "id": "2601.02344v1",
      "title": "Protoplanetary disk cavities with JWST-MIRI: a dichotomy in molecular emission",
      "abstract": "The evolution of planet-forming regions in protoplanetary disks is of fundamental importance to understanding planet formation. Disks with a central deficit in dust emission, a \"cavity\", have long attracted interest as potential evidence for advanced disk clearing by protoplanets and/or winds. Before JWST, infrared spectra showed that these disks typically lack the strong molecular emission observed in full disks. In this work, we combine a sample of 12 disks with millimeter cavities of a range of sizes ($\\sim2$-70 au) and different levels of millimeter and infrared continuum deficits. We analyze their molecular spectra as observed with MIRI on JWST, homogeneously reduced with the new JDISCS pipeline. This analysis demonstrates a stark dichotomy in molecular emission where \"molecule-rich\" (MR) cavities follow global trends between water, CO, and OH luminosity and accretion luminosity as in full disks, while \"molecule-poor\" (MP) cavities are significantly sub-luminous in all molecules except sometimes OH. Disk cavities generally show sub-luminous organic emission, higher OH/H$_2$O ratios, and suggest a lower water column density. The sub-thermal excitation of CO and water vibrational lines suggests a decreased gas density in the emitting layer in all cavities, supporting model expectations for C$_2$H$_2$ photodissociation. We discover a bifurcation in infrared index (lower in MR cavities) suggesting that the molecular dichotomy is linked to residual $μ$m-size dust within millimeter disk cavities. Put together, these results suggest a feedback process between dust depletion, gas density decrease, and molecule dissociation. Disk cavities may have a common evolutionary sequence where MR switch into MP over time.",
      "authors": [
        "Patrick Mallaney",
        "Andrea Banzatti",
        "Colette Salyk",
        "Ilaria Pascucci",
        "Paola Pinilla",
        "Joan Najita",
        "Klaus M. Pontoppidan",
        "Sebastiaan Krijt",
        "Geoffrey A. Blake",
        "Benoit Tabone",
        "Till Kaeufer",
        "Ke Zhang",
        "Feng Long",
        "Jane Huang",
        "Giovanni Rosotti",
        "Karin I. Oberg",
        "Maria Jose Colmenares",
        "Andrew Lay",
        "Lucas A. Cieza",
        "L. Ilsedore Cleeves",
        "Joe Williams",
        "Chengyan Xie",
        "Miguel Vioque",
        "Mayank Narang",
        "Nicholas P. Ballering",
        "Minjae Kim",
        "the JDISCS Collaboration"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-05T18:40:59Z",
      "updated": "2026-01-05T18:40:59Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02344v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02344v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 3
    },
    {
      "id": "2601.10585v1",
      "title": "Canceling Effects of Conjunctions Render Higher Order Mean Motion Resonances Weak",
      "abstract": "Mean motion resonances (MMRs) are a key phenomenon in orbital dynamics. The traditional disturbing function expansion in celestial mechanics shows that, at low eccentricities, $p$:$p-q$ MMRs exhibit a clear hierarchy of strengths, scaling as $e^q$, where $q$ is the order of the resonance. This explains why first-order MMRs (e.g., 3:2 and 4:3) are important, while the infinite number of higher order integer ratios are not. However, this relationship derived from a technical perturbation series expansion provides little physical intuition. In this paper, we provide a simple physical explanation of this result for closely spaced orbits. In this limit, interplanetary interactions are negligible except during close encounters at conjunction, where the planets impart a gravitational \"kick\" to each other's mean motion. We show that while first-order MMRs involve a single conjunction before the configuration repeats, higher order MMRs involve multiple conjunctions per cycle, whose effects cancel out more precisely the higher the order of the resonance. Starting from the effects of a single conjunction, we provide an alternate, physically motivated derivation of MMRs' $e^q$ strength scaling.",
      "authors": [
        "Elizabeth K Jones",
        "Samuel Hadden",
        "Daniel Tamayo"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T16:55:40Z",
      "updated": "2026-01-15T16:55:40Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10585v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10585v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 2
    },
    {
      "id": "2601.10181v1",
      "title": "Reinforcement Learning to Discover a NorthEast Monsoon Index for Monthly Rainfall Prediction in Thailand",
      "abstract": "Climate prediction is a challenge due to the intricate spatiotemporal patterns within Earth systems. Global climate indices, such as the El Niño Southern Oscillation, are standard input features for long-term rainfall prediction. However, a significant gap persists regarding local-scale indices capable of improving predictive accuracy in specific regions of Thailand. This paper introduces a novel NorthEast monsoon climate index calculated from sea surface temperature to reflect the climatology of the boreal winter monsoon. To optimise the calculated areas used for this index, a Deep Q-Network reinforcement learning agent explores and selects the most effective rectangles based on their correlation with seasonal rainfall. Rainfall stations were classified into 12 distinct clusters to distinguish rainfall patterns between southern and upper Thailand. Experimental results show that incorporating the optimised index into Long Short-Term Memory models significantly improves long-term monthly rainfall prediction skill in most cluster areas. This approach effectively reduces the Root Mean Square Error for 12-month-ahead forecasts.",
      "authors": [
        "Kiattikun Chobtham"
      ],
      "categories": [
        "cs.LG",
        "astro-ph.EP"
      ],
      "published": "2026-01-15T08:40:01Z",
      "updated": "2026-01-15T08:40:01Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10181v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10181v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 2
    },
    {
      "id": "2601.08591v1",
      "title": "Dust Properties of the Interstellar Object 3I/ATLAS Revealed by Optical and Near-Infrared Polarimetry",
      "abstract": "We present independent polarimetric observations of the interstellar object 3I/ATLAS, including the first near-infrared polarimetric measurements. Using imaging polarimeters, we measured the degree of linear polarization from the visible RC band (0.64 μm) to the near-infrared KS band (2.25 μm), and investigated its dependence on solar phase angle (polarization phase curve; PPC) and wavelength (polarization color curve; PCC). We confirm that the PPC of 3I/ATLAS differs significantly from those of typical Solar System comets, showing an unusually large polarization amplitude. This PPC shows no significant change in the RC band across perihelion passage, despite the perihelion lying within the water snow line. This indicates that the unusual polarimetric behavior of 3I/ATLAS is unlikely to be driven by transient volatile activity, but instead reflects intrinsic optical properties of refractory dust particles. The PCC increases with wavelength over 0.6-1.2 μm and peaks at 1.5-2.0 μm, suggesting that the dominant scattering units are dust aggregates composed of submicron-sized monomers, broadly consistent with interstellar dust and solar-system cometary aggregates. Taken together, our results indicate that 3I/ATLAS preserves polarimetric properties characteristic of a primitive cometary planetesimal formed in another planetary system, with a refractory dust composition that differs from that typically observed among Solar System comets, despite sharing a similar size scale of the aggregate building blocks.",
      "authors": [
        "Seungwon Choi",
        "Masateru Ishiguro",
        "Jun Takahashi",
        "Tomoki Saito",
        "Yoonsoo P. Bach",
        "Bumhoo Lim",
        "Hiroyuki Naito",
        "Jooyeon Geem",
        "Sunho Jin",
        "Jinguk Seo",
        "Hyeonwoo Ju",
        "Hiroshi Akitakya",
        "Koji S. Kawabata",
        "Mahito Sasada",
        "Kazuya Doi",
        "Hisayuki Kubota",
        "Seiko Takagi",
        "Makoto Watanabe",
        "Tomohiko Sekiguchi",
        "Myungshin Im"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "published": "2026-01-13T14:20:18Z",
      "updated": "2026-01-13T14:20:18Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08591v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08591v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 2
    },
    {
      "id": "2601.08306v1",
      "title": "A youthful Titan implied by improved impact simulations",
      "abstract": "The small number of impact craters found on Titan suggests that its surface is relatively young. Previous work estimated its surface age to be between 200 and 1000 Myr. This estimate, however, is based on crater scaling laws for water and sand, which are not representative of the composition of Titan's icy surface. Titan's surface is likely composed of water ice, methane clathrates, or a combination of both. Here, we perform impact simulations for impactors of various sizes that strike an icy target with a 0-15 km thick methane clathrate cap layer. We derive new crater scaling laws based on our numerical results, and find that Titan's surface age is 300-340 Myr, assuming heliocentric impactors and surface clathrates. This age, which represents the crater retention age, indicates a relatively youthful surface, suggesting that active endogenic and/or exogenic processes have recently reshaped Titan's surface.",
      "authors": [
        "Shigeru Wakita",
        "Brandon C. Johnson",
        "Jason M. Soderblom",
        "Catherine D. Neish"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T07:50:55Z",
      "updated": "2026-01-13T07:50:55Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08306v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08306v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 2
    },
    {
      "id": "2601.05976v1",
      "title": "Distinct Rotational Evolution of Giant Planets and Brown Dwarf Companions",
      "abstract": "We present a rotational velocity (vsini) survey of 32 stellar/substellar objects and giant planets using Keck/KPIC high-resolution spectroscopy, including 6 giant planets (2-7 M$_\\mathrm{Jup}$) and 25 substellar/stellar companions (12-88 M$_\\mathrm{Jup}$). Adding companions with spin measurements from the literature, we construct a curated spin sample for 43 benchmark stellar/substellar companions and giant planets and 54 free-floating brown dwarfs and planetary mass objects. We compare their spins, parameterized as fractional breakup velocities at 10 Myr, assuming constant angular momentum evolution. We find the first clear evidence that giant planets exhibit distinct spins versus low-mass brown dwarf companions (10 to 40 M$_\\mathrm{Jup}$) at 4-4.5 $σ$ significance assuming inclinations aligned with their orbits, while under randomly oriented inclinations the significance is at 1.6-2.1 $σ$. Our findings hold when considering various assumptions about planets, and the mass ratio below 0.8% gives a clean cut for rotation between giant planets and brown dwarf companions. The higher fractional breakup velocities of planets can be interpreted as less angular momentum loss through circumplanetary disk braking during the planet formation phase. Brown dwarf companions exhibit evidence of slower rotation compared to isolated brown dwarfs, while planets and planetary mass objects show similar spins. Finally, our analysis of specific angular momentum versus age of 221 stellar/substellar objects below 0.1 MSun with spin measurements in the literature indicates that the substellar objects of 5-40 M$_\\mathrm{Jup}$ retain much higher angular momenta compared to stellar and substellar objects of 40-100 M$_\\mathrm{Jup}$ after 10 Myr, when their initial angular momenta were set.",
      "authors": [
        "Chih-Chun Hsu",
        "Jason J. Wang",
        "Jerry W. Xuan",
        "Yapeng Zhang",
        "Jean-Baptiste Ruffio",
        "Dimitri Mawet",
        "Luke Finnerty",
        "Katelyn Horstman",
        "Julianne Cronin",
        "Yinzi Xin",
        "Ben Sappey",
        "Daniel Echeverri",
        "Nemanja Jovanovic",
        "Ashley D. Baker",
        "Randy Bartos",
        "Geoffrey A. Blake",
        "Benjamin Calvin",
        "Sylvain Cetre",
        "Jacques-Robert Delorme",
        "Greg W. Doppmann",
        "Michael P. Fitzgerald",
        "Quinn M. Konopacky",
        "Joshua Liberman",
        "Ronald A. Lopez",
        "Evan C. Morris",
        "Jacklyn Pezzato",
        "Tobias Schofield",
        "Andrew Skemer",
        "James K. Wallace",
        "Ji Wang"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-09T17:50:19Z",
      "updated": "2026-01-09T17:50:19Z",
      "pdf_link": "https://arxiv.org/pdf/2601.05976v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.05976v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 2
    },
    {
      "id": "2601.04793v1",
      "title": "A change of the rotation period of asteroid (65803) Didymos caused by the DART impact",
      "abstract": "On 26 September 2022, the NASA Double Asteroid Redirection Test (DART) spacecraft impacted Dimorphos, the secondary component of the binary asteroid (65803)~Didymos. This experiment tested the Kinetic Impactor technology for diverting dangerous asteroids. Due to the impact, the binary system's angular momentum has changed, resulting in a significant change in the orbital period of Dimorphos. Precise values of the pre- and post-impact orbital periods were derived from a large set of photometric light curves measured for the Didymos-Dimorphos system during six apparitions from 2003 to 2023. We used these data to detect a possible change in the rotation period of the primary as a consequence of the impact. We analyzed the binary system's light curves using the binary asteroid light curve decomposition method. We selected parts of the light curves covering orbital phases outside mutual events, which represent the primary rotational light curves. We applied the light curve inversion method to construct a convex shape model of Didymos and determine its rotation period before and after the impact. These two periods were treated as independent free parameters of the modeling. We found a value of 2.2603891 +/- 0.0000002 h for the pre-impact period and 2.260440 +/- 0.000008 h for the post-impact period. Their difference 0.18 +/- 0.03 s is small yet significant, indicating that the rotation of Didymos became slower after the DART impact. The most plausible physical explanation is Didymos's post-impact reshaping, making its shape more oblate.",
      "authors": [
        "Josef Durech",
        "Petr Pravec",
        "Masatoshi Hirabayashi",
        "Derek C. Richardson",
        "Harrison Agrusa",
        "Ryota Nakano"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-08T10:19:37Z",
      "updated": "2026-01-08T10:19:37Z",
      "pdf_link": "https://arxiv.org/pdf/2601.04793v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.04793v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 2
    },
    {
      "id": "2601.04347v1",
      "title": "The Impact of Robotic Telescopes on Time-Domain Astronomy",
      "abstract": "The field of time-domain astronomy has experienced unprecedented growth due to the increasing deployment of robotic telescopes capable of autonomous, round-the-clock sky monitoring. These instruments have revolutionized the detection and characterization of transient phenomena such as supernovae, gamma-ray bursts, variable stars, and gravitational wave counterparts. This paper explores the transformative role of robotic telescopes such as ZTF, ATLAS, and LCOGT in enabling rapid-response observations and building large time-series datasets. We review the design principles and scheduling algorithms behind robotic observatories and assess their scientific contributions across different wavelength regimes. Particular attention is given to the synergy between robotic systems and machine learning pipelines that enable real-time classification of transient events. We also discuss challenges such as data deluge, follow-up prioritization, and observational biases, as well as future directions in global telescope networks",
      "authors": [
        "Yakubu Mu'allim",
        "J. O. Vwavware",
        "A. Ohwofosirai"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-07T19:34:21Z",
      "updated": "2026-01-07T19:34:21Z",
      "pdf_link": "https://arxiv.org/pdf/2601.04347v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.04347v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 2
    },
    {
      "id": "2601.04140v1",
      "title": "Secular Excitation of Polar Neptune Orbits in Pure Disk-Planet Systems",
      "abstract": "The stellar spin-orbit angles of Neptune-sized planets present a primordial yet puzzling view of the planetary formation epoch. The striking dichotomy of aligned and perpendicular orbital configurations are suggestive of obliquity excitation through secular resonance -- a process where the precession of a hot Neptune becomes locked onto a forcing frequency, and is slowly guided into a perpendicular state. Previous models of resonant capture have involved the presence of companion perturbers to the star-planet-disk system, but in most cases, such companions are not confirmed to be present. In this work, we present a mechanism for exciting Neptunes to polar orbits in systems without giant perturbers, where photo-evaporation is the self-contained mechanism. Photo-evaporation opens a gap in the protoplanetary disk at ~1 au, and the inner disk continues to viscously accrete onto the host star, precessing quickly due to the perturbation of the outer disk. As the inner disk shrinks, it precesses more slowly, and encounters a resonance with the J2 precession of the Neptune, quickly exciting it to a polar configuration. While likely not applicable to more massive planets which trigger back-reactions onto the disk, this mechanism reproduces the obliquities of small planets in multiple respects.",
      "authors": [
        "Luke B. Handley",
        "Konstantin Batygin"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-07T17:52:01Z",
      "updated": "2026-01-07T17:52:01Z",
      "pdf_link": "https://arxiv.org/pdf/2601.04140v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.04140v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 2
    },
    {
      "id": "2601.03820v1",
      "title": "Disc fragmentation. II. Ejection of low mass Free Floating Planets from growing binary systems",
      "abstract": "Observations indicate that disc fragmentation due to Gravitational Instability (GI) is the likely origin of massive companions to stars, such as giant planets orbiting M-dwarf stars, Brown Dwarf (BD) companions to FGK stars, and binary stars with separations smaller than 100 au. Additionally, we have recently showed that disc fragmentation in young rapidly evolving binary systems ejects an abundant population of massive Jupiter-mass Free-Floating Planets (FFPs). In this model, a massive disc around an initially single protostar undergoes GI and hatches a number of fragments; the most massive oligarch grows by runaway accretion into the secondary star. As the system rearranges itself from a single to a binary star configuration, a dramatic \"pincer movement\" by the binary ejects planets through dynamical interactions with the stars. Here we propose that the same scenario applies to an even more abundant population of smaller FFPs discovered by the microlensing surveys. Although disc fragmentation is usually believed to form only massive objects, several pathways for forming small core-dominated planets at separations of tens of au exist. We present results from three complementary simulation approaches, all of which confirm planet ejection efficiency as high as 0.5 for secondaries more massive than $\\sim 10$\\% of the primary star mass. On the other hand, Jovian mass planets migrate through the region of tens of au too rapidly to eject planets from that region. We discuss implications of this scenario, concluding that microlensing FFPs may be the most convincing evidence yet that disc fragmentation forms planets much less massive than Jupiter.",
      "authors": [
        "Sergei Nayakshin",
        "Luyao Zhang",
        "Aleksandra Ćalović",
        "Hans Lee",
        "Clement Baruteau",
        "Farzana Meru",
        "Lucio Mayer"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "published": "2026-01-07T11:26:05Z",
      "updated": "2026-01-07T11:26:05Z",
      "pdf_link": "https://arxiv.org/pdf/2601.03820v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.03820v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 2
    },
    {
      "id": "2601.04091v1",
      "title": "Dissecting the dust distribution and polarization around two B213 young stellar objects with ALMA",
      "abstract": "The earliest stages of disk formation and dust evolution during the protostellar phase remain poorly constrained. Millimeter dust emission and its polarization provide key insights into the physical processes and material distribution at the envelope-disk interface. We present ALMA polarimetric observations at 1.4 mm and 3 mm of two young stellar objects in Taurus, IRAS 04166+2706 (K04166) and IRAS 04169+2702 (K04169), probing scales from 25 au to 3000 au. We model the Stokes I emission to separate disk and envelope contributions and analyze the polarization properties to identify the dominant polarization mechanisms. K04166 shows extended Stokes I and polarized emission tracing a tentative hourglass magnetic field morphology in its envelope. In the inner envelope and disk (< 100 au), the properties of the polarized emission change, suggesting either a toroidal magnetic field or the presence of large grains. In contrast, K04169 exhibits compact Stokes I and polarized emission consistent with self-scattering from the disk. Both disks are extremely compact, but only K04166 retains a substantial envelope. Our multiscale ALMA polarimetric observations reveal a transition from magnetically aligned grains in envelopes to self-scattering in disks within the transition region of 20-50 au. These results provide important clues on dust grain growth and magnetic field morphology at the disk-envelope scales. Despite being embedded in the same filament, the two sources display striking differences, indicating that K04166 is a young embedded object with a substantial envelope threaded by relatively organized magnetic fields. Meanwhile, K04169 is more evolved, likely to be a young T-Tauri star. However, in both disks, the presence of large grains already suggests a scenario of early dust evolution in disks of the Class 0 stage.",
      "authors": [
        "Asako Sato",
        "Anaëlle Maury",
        "Josep M. Girart",
        "Andrea Bracco",
        "Patrick Hennebelle",
        "Qizhou Zhang",
        "Valeska Valdivia"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "published": "2026-01-07T16:58:42Z",
      "updated": "2026-01-07T16:58:42Z",
      "pdf_link": "https://arxiv.org/pdf/2601.04091v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.04091v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 1
    },
    {
      "id": "2601.03990v1",
      "title": "Investigation of the dynamics and origin of the NEA pair 2021 PH27 and 2025 GN1",
      "abstract": "We analyse the association between the NEAs 2021 PH27 and 2025 GN1, which share similar heliocentric Keplerian elements and the same taxonomic classification. First, we confirm the spectral similarity by getting independent colours measurements of 2025 GN1 and confirming that they are both X-type. From numerical integration of the orbits up to 100 kyr in the past, taking into account relativistic corrections, we found that the two asteroids experienced five similar flybys with Venus, but none of them were closer than the Roche limit. The perihelion distance also reached values between 0.1 and 0.08 au about 17/21 kyr and 45/48 kyr ago, but still well outside the Roche limit with the Sun. So, the origin of the pair by tidal disruption of a progenitor rubble-pile asteroid appears unlikely. On the other hand, we found periods lasting several thousand years where the perihelion was below 0.1 au, and this can lead to thermal fracturing of the surface. We found that the rotation period of the primary and the mass ratio secondary/primary make the pair indistinguishable from the binary systems known among the NEAs, and the YORP effect can double the rotation period of 2021 PH27 in $150 \\pm 50$ kyr. So it is plausible that the pair was formed by the rotational disintegration of a rubble-pile asteroid due to anisotropic gas emission or the YORP effect, which formed a binary system that later dissolved due to the internal dynamics of the pair. We are unable to give a value for the separation age; we can only say that it occurred more than 10.5 kyr ago and may have occurred between 17/21 kyr ago during the last and longer phase of lower perihelion distance. In this scenario, little meteoroids released in space due to the fragmentation event are still near the pair's orbit and can generate a meteor shower in Venus' atmosphere.",
      "authors": [
        "Albino Carbognani",
        "Marco Fenucci",
        "Toni Santana-Ros",
        "Clara E. Martínez-Vázquez",
        "Marco Micheli"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-07T15:01:47Z",
      "updated": "2026-01-07T15:01:47Z",
      "pdf_link": "https://arxiv.org/pdf/2601.03990v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.03990v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 1
    },
    {
      "id": "2601.03539v1",
      "title": "Perhaps there is no brown dwarf desert? A study of sub-stellar companions with Gaia DR3",
      "abstract": "The brown dwarf desert describes a range of orbital periods (<5 years) in which fewer brown dwarf-mass companions have been observed around Sun-like stars, when compared to planets and low mass stellar companions. It is therefore theorised that brown dwarf companions are unlikely to form or remain in this period range. The Gaia space telescope is uniquely sensitive to companions in this period range, making it an ideal tool to conduct a survey of the brown dwarf desert. In this study, we use Bayesian inference to analyse data from nearby (<200pc) Sun-like stars in Gaia's DR3 catalogue, assuming single companions. From this, we identify 2673 systems (2.41% of the sample) with possible brown dwarf companions in this period range. Accounting for observational biases, we find that 10.4+0.8-0.6% of nearby Sun-like stars have astrometric errors consistent with a brown dwarf-mass companion with a period less than 5 years, significantly higher than previous studies which reported occurrence rates of <1%. However, we acknowledge the limitations of DR3 and are unable to make a definitive statement without epoch data. By simulating epoch data with multiple companions, we find that, while some of the data can be explained by multiple low-mass brown dwarf companions and high-mass planets (>10MJ), high-mass brown dwarfs (>50MJ) in this period range are comparatively rare. Finally, we used our studies of the brown dwarf distribution to predict the number of companions in the brown dwarf desert we can expect to discover in DR4.",
      "authors": [
        "A. L. Wallace",
        "A. R. Casey"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-07T03:07:36Z",
      "updated": "2026-01-07T03:07:36Z",
      "pdf_link": "https://arxiv.org/pdf/2601.03539v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.03539v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 1
    },
    {
      "id": "2601.02545v1",
      "title": "Tracing Pebble Drift History in Two Protoplanetary Disks with CO Enhancement",
      "abstract": "Pebble drift is an important mechanism for supplying the materials needed to build planets in the inner region of protoplanetary disks. Thus, constraining pebble drift's timescales and mass flux is essential to understanding planet formation history. Current pebble drift models suggest pebble fluxes can be constrained from the enhancement of gaseous volatile abundances when icy pebbles sublimate after drifting across key snowlines. In this work, we present ALMA observations of spatially resolved $^{13}$C$^{18}$O J=2-1 line emission inside the midplane CO snowline of the HD 163296 and MWC 480 protoplanetary disks. We use radiative transfer and thermochemical models to constrain the spatial distribution of CO gas column density. We find that both disks display centrally peaked CO abundance enhancement of up to ten times of ISM abundance levels. For HD 163296 and MWC 480, the inferred enhancements require 250-350 and 480-660 Earth Masses of pebbles to have drifted across their CO snowlines, respectively. These ranges fall within cumulative pebble mass flux ranges to grow gas giants in the interior to the CO snowline. The centrally peaked CO enhancement is unexpected in current pebble drift models, which predict CO enhancement peaks at the CO snowline or is uniform inside the snowline. We propose two hypotheses to explain the centrally-peaked CO enhancement, including a large CO desorption distance and CO trapped in water ice. By testing both hypotheses with the 1D gas and dust evolution code chemcomp, we find that volatile trapping (about 30\\%) best reproduces the centrally peaked CO enhancement observed.",
      "authors": [
        "Tayt Armitage",
        "Joe Williams",
        "Ke Zhang",
        "Sebastiaan Krijt",
        "Leon Trapman",
        "Richard A. Booth",
        "Richard Teague",
        "Charles J. Law",
        "Chunhua Qi",
        "David J. Wilner",
        "Karin I. Öberg",
        "Edwin A. Bergin",
        "Sean M. Andrews",
        "Romane Le Gal",
        "Feng Long",
        "Jane Huang",
        "Jaehan Bae",
        "Felipe Alarcón"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-05T20:40:18Z",
      "updated": "2026-01-05T20:40:18Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02545v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02545v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 1
    },
    {
      "id": "2601.02527v1",
      "title": "Scalable Gaussian Processes for Integrated and Overlapping Measurements Via Augmented State Space Models",
      "abstract": "Astronomical measurements are often integrated over finite exposures, which can obscure latent variability on comparable timescales. Correctly accounting for exposure integration with Gaussian Processes (GPs) in such scenarios is essential but computationally challenging: once exposure times vary or overlap across measurements, the covariance matrix forfeits any quasiseparability, forcing O($N^2$) memory and O($N^3$) runtime costs. Linear Gaussian state space models (SSMs) are equivalent to GPs and have well-known O($N$) solutions via the Kalman filter and RTS smoother. In this work, we extend the GP-SSM equivalence to handle integrated measurements while maintaining scalability by augmenting the SSM with an integral state that resets at exposure start times and is observed at exposure end times. This construction yields exactly the same posterior as a fully integrated GP but in O($N$) time on a CPU, and is parallelizable down to O($N/T + \\log T$) on a GPU with $T$ parallel workers. We present smolgp (State space Model for O(Linear/log) GPs), an open-source Python/JAX package offering drop-in compatibiltiy with tinygp while supporting both standard and exposure-aware GP modeling. As SSMs provide a framework for representing general GP kernels via their series expansion, smolgp also brings scalable performance to many commonly used covariance kernels in astronomy that lack quasiseparability, such as the quasiperiodic kernel. The substantial performance boosts at large $N$ will enable massive multi-instrument cross-comparisons where exposure overlap is ubiquitous, and unlocks the potential for analyses with more complex models and/or higher dimensional datasets.",
      "authors": [
        "Ryan A. Rubenzahl",
        "Soichiro Hattori",
        "Simo Särkkä",
        "Will M. Farr",
        "Jacob K. Luhn",
        "Megan Bedell"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-05T20:00:50Z",
      "updated": "2026-01-05T20:00:50Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02527v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02527v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 1
    },
    {
      "id": "2601.09468v1",
      "title": "High-fidelity lunar topographic reconstruction across diverse terrain and illumination environments using deep learning",
      "abstract": "Topographic models are essential for characterizing planetary surfaces and for inferring underlying geological processes. Nevertheless, meter-scale topographic data remain limited, which constrains detailed planetary investigations, even for the Moon, where extensive high-resolution orbital images are available. Recent advances in deep learning (DL) exploit single-view imagery, constrained by low-resolution topography, for fast and flexible reconstruction of fine-scale topography. However, their robustness and general applicability across diverse lunar landforms and illumination conditions remain insufficiently explored. In this study, we build upon our previously proposed DL framework by incorporating a more robust scale recovery scheme and extending the model to polar regions under low solar illumination conditions. We demonstrate that, compared with single-view shape-from-shading methods, the proposed DL approach exhibits greater robustness to varying illumination and achieves more consistent and accurate topographic reconstructions. Furthermore, it reliably reconstructs topography across lunar features of diverse scales, morphologies, and geological ages. High-quality topographic models are also produced for the lunar south polar areas, including permanently shadowed regions, demonstrating the method's capability in reconstructing complex and low-illumination terrain. These findings suggest that DL-based approaches have the potential to leverage extensive lunar datasets to support advanced exploration missions and enable investigations of the Moon at unprecedented topographic resolution.",
      "authors": [
        "Hao Chen",
        "Philipp Gläser",
        "Konrad Willner",
        "Jürgen Oberst"
      ],
      "categories": [
        "astro-ph.EP",
        "cs.LG"
      ],
      "published": "2026-01-14T13:21:09Z",
      "updated": "2026-01-14T13:21:09Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09468v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09468v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.09358v1",
      "title": "Semi-convection in rotating spherical shells: flows, layers and dynamos",
      "abstract": "Large regions of gaseous planets are thought to be stratified with an unstable thermal gradient, but a stabilising gradient of heavy element composition. Fluid in these regions is unstable to semi-convection, with motions driven by differences in the molecular diffusivity of temperature and composition, and could play a role in supporting planetary magnetic fields. Previous studies focus largely on local models in Cartesian boxes; here, we investigate semi-convection in rotating spherical shells. The onset of linear instability shows a transition between the two limits of rotating convection and non-rotating semi-convection. Non-linear simulations evolve into a system of concentric layers of relatively constant density, separated by narrow high-gradient regions. These layers gradually merge, resulting in a statistically steady state dominated by either a single convection region or a narrower convective zone beneath a stably stratified layer (SSL), depending on the strength of the thermal forcing compared to the rotation. When magnetic field generation is considered, our magnetohydrodynamic simulations exhibit self-sustained dynamo action. In cases where the turbulent convective region generates magnetic fields that are smoothed by zonal flows within the overlying SSL, the resulting field is strongly dipolar and axisymmetric, in encouraging agreement with Saturn's observed magnetic field. Within the regimes explored, both the Rossby number and the thickness of the SSL are well predicted by a single combination of control parameters. This enables the identification of a parameter range in which the generated magnetic fields resemble those of planetary dynamos.",
      "authors": [
        "Paul Pružina",
        "Nathanaël Schaeffer",
        "David Cébron"
      ],
      "categories": [
        "physics.flu-dyn",
        "astro-ph.EP"
      ],
      "published": "2026-01-14T10:39:20Z",
      "updated": "2026-01-14T10:39:20Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09358v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09358v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.08916v1",
      "title": "Numerical Insights into Disk Accretion, Eccentricity, and Kinematics in the Class 0 phase",
      "abstract": "The formation and early evolution of protoplanetary disks are governed by a wide variety of physical processes during a gravitational collapse. Observations have begun probing disks in their earliest stages, and have favored the magnetically-regulated disk formation scenario. Disks are also expected to exhibit ellipsoidal morphologies in the early phases, an aspect that has been widely overlooked. We aim to describe the birth and evolution of the disk while accounting for the eccentric motions of fluid parcels. Using 3D radiative magnetohydrodynamic (MHD) simulations with ambipolar diffusion, we self-consistently model the collapse of isolated $1~\\mathrm{M_\\odot}$ and $3~\\mathrm{M_\\odot}$ cores to form a central protostar surrounded by a disk. We account for dust dynamics, and employ gas tracer particles to follow the thermodynamical history of fluid parcels. We find that magnetic fields and turbulence drive highly anisotropic accretion onto the disk via dense streamers. This streamer-fed accretion, occurring from the vertical and radial directions, drives vigorous internal turbulence that facilitates efficient angular momentum transport and rapid radial spreading. Crucially, the anisotropic inflow delivers material with an angular momentum deficit that continuously generates and sustains significant disk eccentricity ($e\\sim 0.1$). Our results reveal ubiquitous eccentric kinematics in Class 0 disks, with direct implications for disk evolution, planetesimal formation, and the interpretation of cosmochemical signatures in Solar System meteorites.",
      "authors": [
        "Adnan Ali Ahmad",
        "Benoît Commerçon",
        "Elliot Lynch",
        "Francesco Lovascio",
        "Sebastien Charnoz",
        "Raphael Marschall",
        "Alessandro Morbidelli"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-13T19:00:57Z",
      "updated": "2026-01-13T19:00:57Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08916v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08916v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.08624v1",
      "title": "Rare Near-Opposition Alignment of 3I/ATLAS on 22 January, 2026",
      "abstract": "We point out that on 22 January 2026, the interstellar object 3I/ATLAS will align to within an exceptionally small angle, alpha= 0.69 degrees, with the Earth-Sun axis. This rare alignment provides unique circumstances for measuring the opposition surge and polarimetric properties of interstellar cometary dust. We characterize the alignment geometry, outline key scientific opportunities, and define the observational requirements for data collection. Observations before and after the alignment time offer an unprecedented opportunity which may not repeat for decades, for characterizing the albedo, structure, and composition of interstellar matter.",
      "authors": [
        "Mauro Barbieri",
        "Abraham Loeb"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "published": "2026-01-13T15:02:00Z",
      "updated": "2026-01-13T15:02:00Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08624v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08624v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.08019v1",
      "title": "Democratic heliocentric coordinates underestimate the rate of instabilities in long-term integrations of the Solar System",
      "abstract": "Wisdom-Holman (WH) integrators are symplectic operator-splitting methods widely used for long-term N-body simulations of planetary systems. Most implementations use either Jacobi coordinates or democratic heliocentric coordinates (DHC) for the Hamiltonian splitting, resulting in slightly different algorithms. In this paper we report results from numerical experiments, which show that integrations of the Solar System using DHC coordinates with typical timesteps of a few days suppress instabilities of the planet Mercury. We further show that this is due to an eccentricity dependent artificial numerical precession introduced by the DHC splitting. While the DHC splitting converges to the correct results at shorter timesteps of ~0.6 days, we argue that Jacobi coordinates remain reliable to significantly longer timesteps when orbits become moderately eccentric, and are thus a better choice when the innermost planet can reach high eccentricities.",
      "authors": [
        "Hanno Rein",
        "Kavi Dey",
        "Daniel Tamayo"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "published": "2026-01-12T21:51:55Z",
      "updated": "2026-01-12T21:51:55Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08019v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08019v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.07471v1",
      "title": "Instantaneous thermally-driven erosion can explain dearth of dark near-Sun asteroids",
      "abstract": "Recent models of the near-Earth asteroid population show that asteroids must be super-catastrophically destroyed when they evolve to orbits with perihelion passages well inside of Mercury's orbit. The heliocentric distances at which the disruptions typically occur are tens of solar radii, which is too far from the Sun for asteroids to be destroyed by sublimation and tidal disruption. The typical disruption distance also appears to be larger for darker asteroids. Here, by carrying out irradiance experiments in vacuum that replicate the conditions in the near-Sun environment, we show that CI meteorite simulants are destroyed within minutes when exposed to the level of solar irradiance encountered at heliocentric distances of up to about 0.2 au. Our results provide an explanation for the scarcity of dark, carbonaceous asteroids with perihelion distances less than 0.2 au, and for the observed mass-loss rate of the asteroid-like object 322P/SOHO~1 assuming its composition is similar to CI carbonaceous chondrites.",
      "authors": [
        "Georgios Tsirvoulis",
        "Mikael Granvik",
        "Leonard Schirner",
        "Athanasia Toliou",
        "Jooyeon Geem",
        "Axel Hagermann"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-12T12:26:03Z",
      "updated": "2026-01-12T12:26:03Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07471v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07471v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.07159v2",
      "title": "Limit cycles and the climate history of Mars",
      "abstract": "Evidence for fluvial features and standing liquid water indicate that Mars was a warmer and wetter place in its past; however, climate models have historically been unable to produce conditions to yield a warm early Mars under the faint young sun. Some models invoke thick greenhouse atmospheres to produce continuously warm conditions, but others have argued that available geologic evidence is more consistent with short-duration and transient warming events on an otherwise cold Mars. One possibility of harmonizing these perspectives is that early Mars experienced climate limit cycles that caused the climate to oscillate between short periods of warmth and prolonged periods of glaciation, due to modulation of greenhouse warming by the carbonate-silicate cycle. This study suggests that episodic limit cycling during the Noachian and Hesperian periods provides a hypothetical explanation for the timing and formation of fluvial features on Mars. A schematic time-forward trajectory of the full history of Mars is calculated using an energy balance climate model, which includes an active carbonate-silicate cycle, instellation changes due to the sun's main sequence evolution, variations in the obliquity of Mars, and supplemental warming from additional greenhouse gases beyond carbon dioxide alone. These calculations demonstrate the viability of a climate history for Mars involving episodic limit cycling to enable the formation of the valley networks at 4.1-3.5 Ga and delta features at 3.3-3.0 Ga, interspersed with cold stable climates and ending in the late Amazonian in a carbon dioxide condensation regime. This schematic climate trajectory provides a plausible narrative that remains consistent with available geologic data, and further exploration of warming mechanisms for the climate of Mars should consider the possibility of episodic transient events driven by carbonate-silicate limit cycling.",
      "authors": [
        "Jacob Haqq-Misra"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-12T03:12:37Z",
      "updated": "2026-01-14T22:01:58Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07159v2.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07159v2",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.06975v1",
      "title": "Rings around irregular bodies. II. Numerical simulations of the 1/3 spin-orbit resonance confinement and applications to Chariklo",
      "abstract": "Rings have been found around Chariklo, Haumea and Quaoar, three small objects of the Solar System. All these rings are observed near the second-order spin-orbit resonances (SORs) 1/3 or 5/7 with the central body, suggesting an active confinement mechanism by these resonances. Our goal is to understand how collisional rings can be confined near second-order SORs in spite of the fact that they force self-intersecting streamlines.We use full 3D numerical simulations that treat rings of inelastically colliding particles orbiting non-axisymmetric central bodies, characterized by a dimensionless mass anomaly parameter mu. While most of our simulations ignore self-gravity, a few runs include gravitational interactions between particles, providing preliminary results on the effect of self-gravity on the ring confinement. The 1/3 SOR can confine ring material, by transferring the forced resonant mode into free Lindblad modes. We derive a criterion ensuring that the 1/3 SOR counteracts viscous spreading. Assuming meter-sized ring particles, and tau~1, this requires a threshold value mu > 1e-3 in Chariklo's case. The confinement is not permanent as a slow outward leakage of particles is observed in our simulations. This leakage can be halted by an outside moonlet with a mass of ~1e-7 - 1e-6 relative to Chariklo, corresponding to subkilometer-sized objects. With self-gravity, the ring viscosity nu increases by a factor of few in low-tau rings due to gravitational encounters. For large tau, self-gravity wakes enhance nu by a factor of ~100 compared to a non-gravitating ring, requiring ~10-fold larger mu since the threshold value increases proportional to square-root of nu.",
      "authors": [
        "Heikki Salo",
        "Bruno Sicardy"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-11T16:15:18Z",
      "updated": "2026-01-11T16:15:18Z",
      "pdf_link": "https://arxiv.org/pdf/2601.06975v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.06975v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.06905v1",
      "title": "Numerical Study of Polytropes with n=1 and Differential Rotation",
      "abstract": "The solution space of differentially rotating polytropes with n=1 has been studied numerically. The existence of three different types of configurations: from spheroids to thick tori, hockey puck-like bodies and spheroids surrounded by a torus, separate from or merging with the central body has been proved. It has been shown that the last two types appear only at moderate degrees of rotation differentiality, sigma~2. Rigid-body or weakly differential rotation, as well as strongly differential, have not led to any \"exotic\" types of configurations. Many calculated configurations have had extremely large values of parameter tau, which has raised the question of their stability with respect to fragmentation.",
      "authors": [
        "T. L. Razinkova",
        "A. V. Yudin",
        "S. I. Blinnikov"
      ],
      "categories": [
        "gr-qc",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-11T13:13:06Z",
      "updated": "2026-01-11T13:13:06Z",
      "pdf_link": "https://arxiv.org/pdf/2601.06905v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.06905v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.05060v2",
      "title": "Energetic particles accelerated via turbulent magnetic reconnection in protoplanetary discs -- I. Ionisation rates",
      "abstract": "Context. Ionisation controls the chemistry, thermal balance, and magnetic coupling in protoplanetary discs. However, standard ionisation vectors such as stellar UV, X-rays, Galactic cosmic rays (GCRs) might not be efficient enough, as UV/X-rays are attenuated rapidly with depth, while GCRs are modulated. Turbulence-induced magnetic reconnection in disc atmospheric layers offers a physically motivated, in situ source of energetic particles (EPs) that has never been considered. Aims. We quantify the ionisation and heating produced by EPs accelerated by turbulent reconnection, identify where they dominate over X-rays and GCRs, and determine energetic thresholds for their relevance. We provide scalable diagnostics tied to the local energy budget. Methods. We adopt a Fermi-like acceleration model with parameters linked to a turbulent reconnection geometry trigger by the magneto-rotational instability, yielding a steady-state energy distribution of the EP forming a power-law of index $p=2.5$. We propagate electrons and protons through the disc and compute primary and secondary ionisation and associated heating on a fiducial T Tauri disc model background. The non-thermal normalisation is set by the fraction of local viscous accretion energy dissipation channelled to EPs, parametrised by $κ$. Results. For $κ\\gtrsim 0.4\\%$, EPs ionisation overpass standard ionisation sources in the disc atmosphere and intermediate/deep layers out to radii of a few tens of astronomical units. Even at $κ\\sim 0.025\\%$, EPs contribute at the few-percent level, thus are chemically and dynamically relevant. These results identify EPs accelerated by turbulence-induced magnetic reconnection as a rather robust, disc-internal ionisation channel that should be included in thermo-chemical models of protoplanetary discs.",
      "authors": [
        "Valentin Brunn",
        "Fulvia Pucci",
        "Alexandre Marcowith",
        "Marco Padovani",
        "Christian Rab",
        "Christophe Sauty"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-08T16:04:35Z",
      "updated": "2026-01-12T13:48:26Z",
      "pdf_link": "https://arxiv.org/pdf/2601.05060v2.pdf",
      "abs_link": "https://arxiv.org/abs/2601.05060v2",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.04032v1",
      "title": "Two-source terrestrial planet formation with a sweeping secular resonance",
      "abstract": "The models that most successfully reproduce the orbital architecture of the Solar System terrestrial planets start from a narrow annulus of material that grows into embryos and then planets. However, it is not clear how this ring model can be made consistent with the chemical structure of the inner Solar System, which shows a reduced-to-oxidized gradient from Mercury to Mars and a parallel gradient in the asteroid belt. We propose that there were two primary reservoirs in the early inner Solar System: a narrow, refractory enriched ring inside of 1 au, and a less massive, extended planetesimal disk outside of 1 au with oxidation states ranging from enstatite chondrites to ordinary chondrites. We show through a suite of N-body simulations that an inwardly sweeping secular resonance, caused by aerodynamic drag and perturbations from a mean-motion resonant Jupiter and Saturn, gathers the outer planetesimal disk into a narrow ring that migrates radially, forms Mars, and contributes oxidized material to proto-Earth. Remaining unaccreted planetesimals can be implanted into the asteroid belt as the parent bodies of aubrites and non-carbonaceous iron meteorites, while the most reduced material is not implanted and thus unsampled in the meteorite collection. This model explains the oxidation and isotopic gradients within the inner Solar System within the context of a low-viscosity, magnetic wind-driven disk.",
      "authors": [
        "Max Goldberg",
        "David Nesvorný",
        "Alessandro Morbidelli"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-07T15:47:09Z",
      "updated": "2026-01-07T15:47:09Z",
      "pdf_link": "https://arxiv.org/pdf/2601.04032v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.04032v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.03963v1",
      "title": "Formation of multi-planetary systems via pebble accretion in externally photoevaporating discs in stellar clusters",
      "abstract": "In this paper, we investigate how external photo-evaporation influences the formation, dynamical evolution and the resultant planetary architecture of multi-planet systems born in stellar clusters. We use a model of N-body simulations of multiple planet formation via pebble accretion coupled with a 1-D viscous disc subject to external photo-evaporation. We found that external photo-evaporation reduces the planet growth by reducing the pebble mass reservoir in discs containing multiple planetary embryos across a wide range of disc masses, and is particularly effective in suppressing planet growth in less initially massive discs (< 0.1 M$_{\\odot}$). However, in more initially massive ($\\geq$ 0.1 M$_{\\oplus}$) discs planets lost due to planet-planet interactions dominate the outcome for final resultant total planet mass, masking the effects of external photo-evaporation in curbing the planet mass growth. In terms of the final resulting planetary architectures, the signature of external photo-evaporation is visible in less massive (< 0.1 M$_{\\odot}$) discs, with fewer numbers and lower masses of planets surviving in discs irradiated with stronger external FUV radiation. External photo-evaporation also leaves a signature for the wide orbit (> 10 au) terrestrial planets (0.1 - 1 M$_{\\oplus}$), with fewer planets populating this region for stronger FUV field. Finally, the 1st-order resonant pairs fraction decreases with stronger FUV radiation, although the resonant pairs occur rarely regardless of the FUV radiation environment, due to the small number of planets that survive gravitational encounters.",
      "authors": [
        "Lin Qiao",
        "Gavin A. L. Coleman",
        "Thomas J. Haworth"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-07T14:24:46Z",
      "updated": "2026-01-07T14:24:46Z",
      "pdf_link": "https://arxiv.org/pdf/2601.03963v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.03963v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.03951v1",
      "title": "Broadband spectroscopy of astrophysical ice analogues: IV. Optical constants of N$_2$ ice in the terahertz and mid-infrared ranges",
      "abstract": "Context. Understanding the optical properties of astrophysical ices is crucial for modeling dust continuum emission and radiative transfer in cold, dense interstellar environments. Molecular nitrogen (N$_2$), a major nitrogen reservoir in protoplanetary disks, plays a key role in nitrogen chemistry, yet the lack of direct terahertz (THz)--infrared (IR) optical constants for N$_2$ ice introduces uncertainties in radiative transfer models, snowline locations, and disk mass estimates. Aims. We present direct measurements of the optical properties of N$_2$ ice over a broad THz--IR spectral range using terahertz pulsed spectroscopy (TPS) and Fourier-transform infrared spectroscopy (FTIR), supported by density functional theory (DFT) calculations and comparison with literature data. Methods. N$_2$ ice was grown at cryogenic temperatures by gas-phase deposition onto a cold silicon window. The THz complex refractive index was directly reconstructed from TPS data, while the IR response was derived from FTIR measurements using Kramers--Kronig relations. The optical response was parameterized with a Lorentz dielectric model and validated by DFT calculations. Results. The complex refractive index of N$_2$ ice is quantified from $ν= 0.3$--$16$~THz ($λ= 1$~mm--$18.75~μ$m). Resonant absorption peaks at $ν_\\mathrm{L} = 1.47$ and $2.13$~THz with damping constants $γ_\\mathrm{L} = 0.03$ and $0.22$~THz are attributed to optically active phonons of the $α$-N$_2$ crystal. Conclusions. We provide a complete set of the THz--IR optical constants for \\ce{N2} ice by combining TPS and FTIR spectroscopy. Our results have implications for future observational and modeling studies of protoplanetary disk evolution and planet formation.",
      "authors": [
        "F. Kruczkiewicz",
        "A. A. Gavdush",
        "F. Ribeiro",
        "D. Campisi",
        "A. Vyjidak",
        "B. M. Giuliano",
        "G. A. Komandin",
        "S. V. Garnov",
        "T. Grassi",
        "P. Theulé",
        "K. I. Zaytsev. A. V. Ivlev",
        "Paola Caselli"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "published": "2026-01-07T14:05:48Z",
      "updated": "2026-01-07T14:05:48Z",
      "pdf_link": "https://arxiv.org/pdf/2601.03951v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.03951v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.02599v1",
      "title": "Meteor observations as a tool to constrain cosmogonic models of the Solar System",
      "abstract": "Recent observations of small bodies of the Solar System showed evidence of the presence of refractory (asteroidal) material in the Oort cloud. Different models of the origin of the Solar System predict different numbers of rocky objects in the Oort cloud, meaning that measurement of this population can be used as an observational constraint for cosmogonic models. The aim of our work is to study how the data obtained from meteor observations can be used as a tool for distinguishing among the existing cosmogonic models. We investigated two meteor databases collected by the cameras of the All-Sky Meteor Orbit System (AMOS) located in the Canary Islands and in Chile. We describe methodology and results of the search for unusually strong rocky meteoroids on cometary orbits with the origin in the Oort cloud. These data will be used to calculate the fluxes of meteors of different compositions in order to constrain the ratio of icy and rocky components of the Oort cloud. For the flux determination, we estimate the observational time and effective area of the AMOS system.",
      "authors": [
        "Vitalii Kuksenko",
        "Juraj Tóth"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM"
      ],
      "published": "2026-01-05T23:28:04Z",
      "updated": "2026-01-05T23:28:04Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02599v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02599v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.02486v1",
      "title": "Models and Observational Predictions of Dust Traps in Protoplanetary Discs",
      "abstract": "This manuscript investigates the impact of key dust evolution parameters on dust retention and trapping in protoplanetary discs. Using models with and without pressure bumps, combined with radiative transfer simulations, images of the dust continuum emission at (sub-)millimeter wavelengths, their fluxes and observed disc sizes are presented. For discs without pressure bumps (smooth discs), significant dust mass can only be retained over Myr timescales when dust fragmentation velocities are low (1m/s) and with viscosity values of $α=10^{-3}$. For such a combination of fragmentation velocity and viscosity, the synthetic images show a bright inner emission follow by a shallow emission with potential gaps if they are present in the gas profile as well. At higher fragmentation velocities (5-10m/s), most dust is lost due to radial drift at million-year timescales unless pressure traps are present, in which case dust masses can increase by orders of magnitude and structures are observed in synthetic images. The viscosity parameter strongly shapes observable features, with low $α$ producing sharper, potentially asymmetric inner wall cavities in inclined discs due to optically thick emission. High $α$ favors the appearance of shoulders around the predominant rings that dust trapping produces. However, distinguishing between different fragmentation velocities observationally remains challenging. The inferred dust disc sizes from synthetic observations do not always correspond directly to dust model sizes or to the location of pressure bumps. Finally, we discuss implications for pebble fluxes and the delivery of volatiles to the inner disc. These results emphasize the strong degeneracies among dust evolution parameters and highlight the need for multi-wavelength, high-resolution observations to disentangle the processes shaping the formation of planets in protoplanetary discs.",
      "authors": [
        "Paola Pinilla"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-05T19:00:15Z",
      "updated": "2026-01-05T19:00:15Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02486v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02486v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.02462v1",
      "title": "Exposure-averaged Gaussian Processes for Combining Overlapping Datasets",
      "abstract": "Physically motivated Gaussian process (GP) kernels for stellar variability, like the commonly used damped, driven simple harmonic oscillators that model stellar granulation and p-mode oscillations, quantify the instantaneous covariance between any two points. For kernels whose timescales are significantly longer than the typical exposure times, such GP kernels are sufficient. For time series where the exposure time is comparable to the kernel timescale, the observed signal represents an exposure-averaged version of the true underlying signal. This distinction is important in the context of recent data streams from Extreme Precision Radial Velocity (EPRV) spectrographs like fast readout stellar data of asteroseismology targets and solar data to monitor the Sun's variability during daytime observations. Current solar EPRV facilities have significantly different exposure times per-site, owing to the different design choices made. Consequently, each instrument traces different binned versions of the same \"latent\" signal. Here we present a GP framework that accounts for exposure times by computing integrated forms of the instantaneous kernels typically used. These functions allow one to predict the true latent oscillation signals and the exposure-binned version expected by each instrument. We extend the framework to work for instruments with significant time overlap (i.e., similar longitude) by including relative instrumental drift components that can be predicted and separated from the stellar variability components. We use Sun-as-a-star EPRV datasets as our primary example, but present these approaches in a generalized way for application to any dataset where exposure times are a relevant factor or combining instruments with significant overlap.",
      "authors": [
        "Jacob K. Luhn",
        "Ryan A. Rubenzahl",
        "Samuel Halverson",
        "Lily L. Zhao"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-05T19:00:00Z",
      "updated": "2026-01-05T19:00:00Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02462v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02462v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 0
    },
    {
      "id": "2601.08164v1",
      "title": "Unraveling Year-Long Radial Velocity Variations in Red Clump Region -- I: Comprehensive analysis of a K0 Giant star, 2 Draconis",
      "abstract": "Slow-rotating evolved stars frequently exhibit radial velocity (RV) variations on annual timescales, complicated by instrumental systematics and aliasing in the one-year regime. Here we investigate the origin of the near-yearly periodicity in 2 Dra, a star located in the red-clump region, assessing possible causes between stellar activity, instrumental profile (IP) effects, sampling alias, and planetary companions. We applied two independent approaches: (1) constraining diagnostic signals and performing a correlation analysis ($r$) between period-confined signals, and (2) evaluating phase stability by partitioning Keplerian fits. These methods enabled us to examine the physical connections and phase coherence among stellar activity indicators, RV measurements, and IP diagnostics. Our analysis suggests a stellar rotation period of $\\simeq270\\text{--}320$\\,d for 2~Dra. The 340-d RV signal does not appear to originate from stellar activity in this chromospherically quiet star ($|r| \\lesssim 0.33$), nor from instrumental systematics near the annual period ($|r| \\lesssim 0.1$). This conclusion is supported by contrasting phase behavior: the RV and stellar activity phases remain stable, whereas the IP phases do not. We therefore propose that the 340-d variation likely arises from either small-amplitude intrinsic variability or a tentative gas giant companion with potential weak activity-induced modulation. The case of 2~Dra provides a framework for distinguishing the origins of $\\sim$1-yr RV variations in other evolved stars.",
      "authors": [
        "Udomlerd Srisuchinwong",
        "Jianzhao Zhou",
        "Huan-Yu Teng",
        "Guang-Yao Xiao",
        "Bun'ei Sato",
        "Takuya Takarada",
        "Masashi Omiya",
        "Hiroki Harakawa",
        "Eiji Kambe",
        "Hideyuki Izumiura",
        "Michitoshi Yoshida",
        "Yoichi Itoh",
        "Hiroyasu Ando",
        "Eiichiro Kokubo",
        "Marc Hon",
        "Yujuan Liu",
        "Fei Zhao",
        "Wei Wang",
        "Meng Zhai",
        "Shaolan Bi",
        "Gang Zhao"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-13T02:54:37Z",
      "updated": "2026-01-13T02:54:37Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08164v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08164v1",
      "is_exoplanet_focused": false,
      "tweetability_score": -1
    },
    {
      "id": "2601.02637v1",
      "title": "Quantifying the Contamination of TESS Ecliptic-Plane Light Curves by Minor Planets",
      "abstract": "Though missions devoted to time series photometry focus primarily on targets far beyond the solar system, their observations can be contaminated by foreground minor planets, especially near the ecliptic plane where solar system objects are most prevalent. Crucially, depending on one's choice of data reduction/background estimation algorithm, these objects can induce both apparent brightening and/or dimming events in processed light curves. To quantify the impact of these objects on archived TESS light curves, we used N-body integrations of all currently known minor planets to postdict all 600,000+ of their interactions with stars selected for high-cadence observations during TESS ecliptic plane sectors. We then created mock images of these moving sources and performed simple aperture photometry using the same target and background apertures used in SPOC processing. Our resulting 10,000+ target-specific light curves, which faithfully model the time-dependent positions and magnitudes of the actual solar system objects that approached each target, reveal that $>95\\%$ of high-cadence ecliptic plane targets experience a minor planet crossing within 1 TESS pixel of the source. Additionally, 50% of all $T>13$ mag targets experience at least one instantaneous moment where the contaminating flux from minor planets exceeds 1% of the target flux. We discuss these population-level results and others, and highlight several case studies of bright flybys.",
      "authors": [
        "Ben Cassese",
        "Justin Vega",
        "Daniel A. Yahalomi",
        "David Gelpi",
        "Eva Marmolejos",
        "Aneisa Rampersaud",
        "Aware Deshmukh",
        "Ruth Angus",
        "Malena Rice"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-06T01:18:10Z",
      "updated": "2026-01-06T01:18:10Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02637v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02637v1",
      "is_exoplanet_focused": false,
      "tweetability_score": -1
    },
    {
      "id": "2601.10439v1",
      "title": "ASTRA: A Python Package for Cross-Instrument Stellar and Telluric Template Construction",
      "abstract": "ASTRA is a Python package that provides a modular, instrument-independent interface for working with high-resolution stellar spectra. Designed to support data from multiple spectrographs, including ESPRESSO (Pepe et al., 2021), HARPS (Mayor et al., 2003; Pepe et al., 2002), MAROON-X (Seifahrt et al., 2022), and CARMENES (Quirrenbach et al., 2014). ASTRA offers a unified abstraction over their data formats, enabling consistent access to fluxes, wavelengths, uncertainties, and metadata across instruments. Furthermore, it applies the necessary wavelength and flux calibrations that are needed, as described by the official pipelines of each instrument.",
      "authors": [
        "André M. Silva",
        "J. P. Faria",
        "N. C. Santos",
        "S. G. Sousa",
        "P. T. P. Viana",
        "J. H. C. Martins"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-15T14:31:56Z",
      "updated": "2026-01-15T14:31:56Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10439v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10439v1",
      "is_exoplanet_focused": false,
      "tweetability_score": -4
    },
    {
      "id": "2601.04669v1",
      "title": "Empirical Evidence of Planetary Group Configurations Modulating Solar Activity",
      "abstract": "Our prior research found that a $90^{\\circ}$ configuration of two planetary groups were temporally associated with significant changes in global electromagnetic standing waves (Schumann resonances) during and after the three $90^{\\circ}$ configuration events occurring in late 2017 and early 2018. Specifically noted were reductions in variability moving into an event and level changes immediately after a event. Because global standing-wave data have a short history and no $90^{\\circ}$ events have occurred since that period, we examine here whether these geometric configuration events correspond to similar signatures in the long sunspot count record. Using daily sunspot data from January 1935 through December 2024, we conducted empirical studies assessing variance changes, post-event level shifts, and potential intrinsic oscillatory structure. In Study A, a variance-ratio test showed that sunspot variability was systematically lower during the events than in the preceding period, with 21 of 26 events since 1935 exhibiting reduced variance (binomial $p=0.0025$). In Study B, solar activity level declined roughly 21 days after events ended, with 21 of 26 events showing negative changes (binomial $p=0.0025$). In Study C, wavelet and filtering analyses revealed no internal solar oscillations at comparable timescales. These findings provide empirical evidence that the configuration events are associated with shifts in solar activity. The next three configuration events in mid- and late-2026 offer an opportunity to assess these patterns in real time.",
      "authors": [
        "Jeff A Hansen",
        "Shaun David Brocus Fell"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-08T07:28:50Z",
      "updated": "2026-01-08T07:28:50Z",
      "pdf_link": "https://arxiv.org/pdf/2601.04669v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.04669v1",
      "is_exoplanet_focused": false,
      "tweetability_score": -4
    },
    {
      "id": "2601.02296v1",
      "title": "Uncovering Hidden Systematics in Extreme-Precision Radial Velocity Measurements",
      "abstract": "We identify and correct for small but coherent instrumental drifts in seven years of radial velocity data from the EXtreme PREcision Spectrograph (EXPRES). The systematics are most notable for the six months before and after 2022 January, when EXPRES experienced larger temperature variations, and we see a systematic trough-to-peak amplitude of 2.8 m/s in the radial velocities. This is large enough to mimic or obscure planetary signatures. To isolate and correct these effects, we develop a suite of diagnostics that track two-dimensional échellogram shifts, scalings, and rotation, as well as line bisector spans (LBS) derived from laser frequency comb (LFC) lines. By combining these empirical tracers with instrument telemetry in a multi-dimensional regression, we reduce the EXPRES instrument trend traced with solar RVs from an RMS of 1.32 m/s to 0.43 m/s, a 67% improvement, and the aggregate of twelve chromospherically quiet stars show a 26% reduction in velocity scatter. Our injection-recovery simulations further demonstrate a doubling in sensitivity to low-amplitude planetary signals after correction. When applied to the stellar time series of $ρ$ Coronae Borealis ($ρ$CrB), the correction removes a spurious planet d signal, restoring the integrity of the data. These results highlight the need for long-term monitoring and multi-dimensional calibration diagnostics on the path toward true centimeter-per-second precision in next-generation EPRV instruments.",
      "authors": [
        "Lily L. Zhao",
        "Debra A. Fischer",
        "Andrew E. Szymkowiak",
        "John M. Brewer",
        "Joe Llama"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-05T17:31:44Z",
      "updated": "2026-01-05T17:31:44Z",
      "pdf_link": "https://arxiv.org/pdf/2601.02296v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.02296v1",
      "is_exoplanet_focused": false,
      "tweetability_score": -8
    }
  ]
}