{
  "updated_at": "2026-01-16T17:38:36.281344+00:00",
  "category": "astro-ph.EP",
  "paper_count": 15,
  "papers": [
    {
      "id": "2601.10666v1",
      "title": "Observation Timelines for the Potential Lunar Impact of Asteroid 2024 YR4",
      "abstract": "The near-Earth asteroid 2024 YR4 -- a $\\sim$60 m rocky object that was once considered a potential Earth impactor -- has since been ruled out for Earth but retained a $\\sim$4.3% probability of striking the Moon in 2032. Such an impact, with equivalent kinetic energy of $\\sim$6.5 Mt TNT, is expected to produce a $\\sim$1 km crater on the Moon, and will be the most energetic lunar impact event ever recorded in human history. Despite the associated risk, this scenario offers a rare and valuable scientific opportunity. Using a hybrid framework combining Monte Carlo orbital propagation, smoothed particle hydrodynamics (SPH) impact modeling, and N-body ejecta dynamics, we evaluate the physical outcomes and propose the observation timelines of this rare event. Our results suggest an optical flash of visual magnitude from -2.5 to -3 lasting several minutes directly after the impact, followed by hours of infrared afterglow from $\\sim$2000 K molten rock cooling to a few hundred K. The associated seismic energy release would lead to a global-scale lunar reverberation (magnitude $\\sim$5.0) that can be detectable by modern seismometers. Furthermore, the impact would eject $\\sim$10$^8$ kg of debris that escapes the lunar gravity, with a small fraction reaching Earth to produce a lunar meteor outburst within 100 years. Finally, we integrate these results into a coordinated observation timeline, identifying the best detection windows for ground-based telescopes, lunar orbiters, and surface stations.",
      "authors": [
        "Yifan He",
        "Yixuan Wu",
        "Yifei Jiao",
        "Wen-Yue Dai",
        "Xin Liu",
        "Bin Cheng",
        "Hexi Baoyin"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T18:33:03Z",
      "updated": "2026-01-15T18:33:03Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10666v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10666v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.10631v1",
      "title": "Circumplanetary Disk Candidate in the Disk of HD 163296 Traced by Localized Emission from Simple Organics",
      "abstract": "Atacama Large Millimeter/submillimeter Array observations suggest that the disc of HD 163296 is being actively shaped by embedded, yet unseen protoplanets, as indicated by numerous gas and dust substructures consistent with planet-disc interaction models. We report the first detection of simple organic molecules, HCN and C2H, tracing a candidate circumplanetary disc (CPD) in the HD 163296 system, located at an orbital radius of $R=88\\pm7$ au and azimuth $φ=46\\pm3^\\circ$ (or $R=0.75''$, $\\rm{PA}=350^\\circ$ in projected sky coordinates), and originating near the midplane of the circumstellar disc. The signature is localised but spectrally resolved, and it overlaps with a previously reported planet candidate, P94, identified through kinematic perturbations traced by CO lines. We propose a scenario in which the observed chemical anomalies arise from increased heating driven by the forming planet and ongoing accretion through its CPD, facilitating the thermal desorption of species that would otherwise remain frozen out in the disc midplane, and potentially triggering the activation barriers of chemical reactions that lead to enhanced molecular production. Based on a first-order dynamical analysis of the HCN spectrum from the CPD--isolated with a 7$σ$ significance--we infer an upper limit on the planet mass of 1.8 $M_{\\rm Jup}$, consistent with predictions from CO kinematics and constraints from direct imaging studies. By comparing the CPD sizes derived from our models with theoretical expectations where the CPD radius corresponds to roughly one-third of the planet's Hill radius, we favor CPD gas temperatures $T > 150$ K, planet masses $M_{\\rm p} < 1.0$ $M_{\\rm Jup}$, and CPD radii $R_{\\rm CPD} < 2$ au.",
      "authors": [
        "Andres F. Izquierdo",
        "Jaehan Bae",
        "Maria Galloway-Sprietsma",
        "Ewine F. van Dishoeck",
        "Stefano Facchini",
        "Giovanni Rosotti",
        "Jochen Stadler",
        "Myriam Benisty",
        "Leonardo Testi"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-15T17:50:13Z",
      "updated": "2026-01-15T17:50:13Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10631v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10631v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.10598v1",
      "title": "A young progenitor for the most common planetary systems in the Galaxy",
      "abstract": "The Galaxy's most common known planetary systems have several Earth-to-Neptune-size planets in compact orbits. At small orbital separations, larger planets are less common than their smaller counterparts by an order of magnitude. The young star V1298 Tau hosts one such compact planetary system, albeit with four planets that are uncommonly large (5 to 10 Earth radii). The planets form a chain of near-resonances that result in transit-timing variations of several hours. Here we present a multi-year campaign to characterize this system with transit-timing variations, a method insensitive to the intense magnetic activity of the star. Through targeted observations, we first resolved the previously unknown orbital period of the outermost planet. The full 9-year baseline from these and archival data then enabled robust determination of the masses and orbital parameters for all four planets. We find the planets have low, sub-Neptune masses and nearly circular orbits, implying a dynamically tranquil history. Their low masses and large radii indicate that the inner planets underwent a period of rapid cooling immediately after dispersal of the protoplanetary disk. Still, they are much less dense than mature planets of comparable size. We predict the planets will contract to 1.5-4.0 Earth radii and join the population of super-Earths and sub-Neptunes that nature produces in abundance.",
      "authors": [
        "John H. Livingston",
        "Erik A. Petigura",
        "Trevor J. David",
        "Kento Masuda",
        "James Owen",
        "David Nesvorný",
        "Konstantin Batygin",
        "Jerome de Leon",
        "Mayuko Mori",
        "Kai Ikuta",
        "Akihiko Fukui",
        "Noriharu Watanabe",
        "Jaume Orell Miquel",
        "Felipe Murgas",
        "Hannu Parviainen",
        "Judith Korth",
        "Florence Libotte",
        "Néstor Abreu García",
        "Pedro Pablo Meni Gallardo",
        "Norio Narita",
        "Enric Pallé",
        "Motohide Tamura",
        "Atsunori Yonehara",
        "Andrew Ridden-Harper",
        "Allyson Bieryla",
        "Alessandro A. Trani",
        "Eric E. Mamajek",
        "David R. Ciardi",
        "Varoujan Gorjian",
        "Lynne A. Hillenbrand",
        "Luisa M. Rebull",
        "Elisabeth R. Newton",
        "Andrew W. Mann",
        "Andrew Vanderburg",
        "Guðmundur Stefánsson",
        "Suvrath Mahadevan",
        "Caleb Cañas",
        "Joe Ninan",
        "Jesus Higuera",
        "Kamen Todorov",
        "Jean-Michel Désert",
        "Lorenzo Pino"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T17:07:23Z",
      "updated": "2026-01-15T17:07:23Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10598v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10598v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.10585v1",
      "title": "Canceling Effects of Conjunctions Render Higher Order Mean Motion Resonances Weak",
      "abstract": "Mean motion resonances (MMRs) are a key phenomenon in orbital dynamics. The traditional disturbing function expansion in celestial mechanics shows that, at low eccentricities, $p$:$p-q$ MMRs exhibit a clear hierarchy of strengths, scaling as $e^q$, where $q$ is the order of the resonance. This explains why first-order MMRs (e.g., 3:2 and 4:3) are important, while the infinite number of higher order integer ratios are not. However, this relationship derived from a technical perturbation series expansion provides little physical intuition. In this paper, we provide a simple physical explanation of this result for closely spaced orbits. In this limit, interplanetary interactions are negligible except during close encounters at conjunction, where the planets impart a gravitational \"kick\" to each other's mean motion. We show that while first-order MMRs involve a single conjunction before the configuration repeats, higher order MMRs involve multiple conjunctions per cycle, whose effects cancel out more precisely the higher the order of the resonance. Starting from the effects of a single conjunction, we provide an alternate, physically motivated derivation of MMRs' $e^q$ strength scaling.",
      "authors": [
        "Elizabeth K Jones",
        "Samuel Hadden",
        "Daniel Tamayo"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T16:55:40Z",
      "updated": "2026-01-15T16:55:40Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10585v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10585v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.10508v1",
      "title": "sponchpop II: Population Synthesis to Investigate Volatile Sulfur as a Fingerprint of Gas Giant Formation Histories",
      "abstract": "Planet population synthesis is an integral tool for linking exoplanets to their formation environments. Most planet population synthesis studies have focused on the carbon-to-oxygen ratio (C/O) in gas or solids, yet more insight into planet formation may be afforded by considering a wider suite of elements. Sulfur is one such key element. It has been assumed to be entirely refractory in population synthesis models, restricting it to being a tracer of accreted rocky solids. However, sulfur also has a volatile reservoir dominant at the onset of star and planet formation. We investigate sulfur's wider potential as a formation history tracer by implementing the first multi-phase treatment of S in a planet population synthesis model. We present the planet formation module of \\textsc{sponchpop} and its first predicted planet growth tracks and populations. We explore the diversity of planet compositions in terms of their sulfur budget, including both refractory and volatile components, and apply a novel gas-grain conversion of sulfur to study how formation trajectories of giant planets relate to final core and envelope compositions. We show that planets inherit a wide range of core and envelope sulfur content related to accretion history while considering late-stage planetesimal infall, providing a new diagnostic tool for planet formation. The diverse sulfur content of planet cores suggests some rocky planets may be born sulfur-poor, with implications for their geochemistry and habitability. Enhanced sulfur abundances in gas-giant atmospheres can be attributed to formation beyond the H2S iceline, such as the giants in our Solar System.",
      "authors": [
        "Anna Sommerville-Thomas",
        "Mihkel Kama",
        "Oliver Shottle",
        "Jason Ran"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T15:34:21Z",
      "updated": "2026-01-15T15:34:21Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10508v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10508v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.10450v1",
      "title": "TOI-3862 b: A dense super-Neptune deep in the hot Neptune desert",
      "abstract": "The structure and evolution of close-in exoplanets are shaped by atmospheric loss and migration processes, which give rise to key population features such as the hot Neptune desert, ridge, and savanna - regions of the period-radius space whose boundaries offer critical insights into planetary formation and survival. As part of the KESPRINT collaboration, we selected the TESS transiting planet candidate TOI-3862.01 for radial velocity follow-up to confirm its planetary nature and characterize its mass and bulk properties. This planet candidate is of particular interest due to its position in the middle of the hot Neptune desert, making it a valuable probe for testing theories of planet migration and atmospheric loss. We confirmed the planetary nature and determined the mass of TOI-3862.01 (hereinafter TOI-3862b) by performing a joint fit with both transit and radial velocity data, precisely characterizing the bulk properties of this planet. TOI-3862b is a super-Neptune on a 1.56-day orbit around a Sun-like star with an effective temperature of 5300$\\pm$50K. It has a mass of 53.7$_{-2.9}^{+2.8}$ M$_{\\oplus}$ and a radius of 5.53$\\pm$0.18 R$_{\\oplus}$, corresponding to a density of 1.7$\\pm$0.2 g/cm^3. This places it among the rare population of hot and dense super-Neptune desert planets. TOI-3862b, residing deep in the hot Neptune desert, represents a rare occurrence in an otherwise sparsely populated region, offering a valuable opportunity to probe the processes that may allow planets to survive in such environments.",
      "authors": [
        "Ilaria Carleo",
        "Amadeo Castro-González",
        "Enric Pallé",
        "Felipe Murgas",
        "Grzegorz Nowak",
        "Gaia Lacedelli",
        "Thomas Masseron",
        "Emily W. Wong",
        "Patrick Eggenberger",
        "Vincent Bourrier",
        "Dawid Jankowski",
        "Krzysztof Goździewski",
        "Douglas R. Alves",
        "James S. Jenkins",
        "Sergio Messina",
        "Keivan G. Stassun",
        "Jose I. Vines",
        "Matteo Brogi",
        "David R. Ciardi",
        "Catherine A. Clark",
        "William Cochran",
        "Karen A. Collins",
        "Hans J. Deeg",
        "Elise Furlan",
        "Davide Gandolfi",
        "Samuel Geraldía González",
        "Artie P. Hatzes",
        "Coel Hellier",
        "Steve B. Howell",
        "Judith Korth",
        "Jorge Lillo-Box",
        "John H. Livingston",
        "Jaume Orell-Miquel",
        "Carina M. Persson",
        "Seth Redfield",
        "Boris Safonov",
        "David Baker",
        "Rafael Delfin Barrena Delgado",
        "Allyson Bieryla",
        "Andrew Boyle",
        "Pau Bosch-Cabot",
        "Núria Casasayas Barris",
        "Stavros Chairetas",
        "Jerome P. de Leon",
        "Izuru Fukuda",
        "Akihiko Fukui",
        "Pere Guerra",
        "Kai Ikuta",
        "Kiyoe Kawauchi",
        "Emil Knudstrup",
        "Florence Libotte",
        "Michael B. Lund",
        "Rafael Luque",
        "Eduardo Lorenzo Martín Guerrero de Escalante",
        "Bob Massey",
        "Edward J. Michaels",
        "Giuseppe Morello",
        "Norio Narita",
        "Hannu Parvianien",
        "Richard P. Schwarz",
        "Avi Shporer",
        "Monika Stangret",
        "Noriharu Watanabe",
        "Cristilyn N. Watkins"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T14:39:32Z",
      "updated": "2026-01-15T14:39:32Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10450v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10450v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.10439v1",
      "title": "ASTRA: A Python Package for Cross-Instrument Stellar and Telluric Template Construction",
      "abstract": "ASTRA is a Python package that provides a modular, instrument-independent interface for working with high-resolution stellar spectra. Designed to support data from multiple spectrographs, including ESPRESSO (Pepe et al., 2021), HARPS (Mayor et al., 2003; Pepe et al., 2002), MAROON-X (Seifahrt et al., 2022), and CARMENES (Quirrenbach et al., 2014). ASTRA offers a unified abstraction over their data formats, enabling consistent access to fluxes, wavelengths, uncertainties, and metadata across instruments. Furthermore, it applies the necessary wavelength and flux calibrations that are needed, as described by the official pipelines of each instrument.",
      "authors": [
        "André M. Silva",
        "J. P. Faria",
        "N. C. Santos",
        "S. G. Sousa",
        "P. T. P. Viana",
        "J. H. C. Martins"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-15T14:31:56Z",
      "updated": "2026-01-15T14:31:56Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10439v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10439v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.10285v1",
      "title": "How disc initial conditions sculpt the atmospheric composition of giant planets",
      "abstract": "Past studies have revealed the dependency of the disc parameters (mass, radius, viscosity, grain fragmentation velocity, dust-to-gas ratio) on the formation of giant planets, where more massive discs seem beneficial for giant planet formation. It is unclear how the different disc properties influence the composition of forming giant planets. The idea that the atmospheric abundances can trace directly the formation location of planets is put into question, due to the chemical evolution of the disc, caused by inward drifting and evaporating pebbles. This complicates the idea of a relation between atmospheric abundances and planet formation locations. We use planet formation simulations that include the effects of pebble drift and evaporation and investigate how the different disc parameters influence the atmospheric composition of giant planets. We focus on the atmospheric C/O, C/H, O/H and S/H ratios allowing us to probe tracers for volatiles and refractories and thus different accretion pathways of giant planets. We find that most of the disc parameters have only a limited influence on the atmospheric abundances of gas giants, except for the dust-to-gas ratio, where a larger value results in higher atmospheric abundances. However the atmospheric abundances are determined by the planetary formation location, even in the pebble drift and evaporation scenario. Our study suggests that volatile-rich giant exoplanets predominantly form in the inner disc regions, where they can accrete large fractions of vapour-enhanced gas. Our study shows that simulations that try to trace the origin of giant planets via their atmospheric abundances do not have to probe all disc parameters, as long as the disc parameters allow the formation of giant planets. Our study thus suggests that the diversity of observed planetary compositions is a direct consequence of their formation location and migration history.",
      "authors": [
        "Angie Daniela Guzmán Franco",
        "Sofia Savvidou",
        "Bertram Bitsch"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T11:01:08Z",
      "updated": "2026-01-15T11:01:08Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10285v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10285v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.10181v1",
      "title": "Reinforcement Learning to Discover a NorthEast Monsoon Index for Monthly Rainfall Prediction in Thailand",
      "abstract": "Climate prediction is a challenge due to the intricate spatiotemporal patterns within Earth systems. Global climate indices, such as the El Niño Southern Oscillation, are standard input features for long-term rainfall prediction. However, a significant gap persists regarding local-scale indices capable of improving predictive accuracy in specific regions of Thailand. This paper introduces a novel NorthEast monsoon climate index calculated from sea surface temperature to reflect the climatology of the boreal winter monsoon. To optimise the calculated areas used for this index, a Deep Q-Network reinforcement learning agent explores and selects the most effective rectangles based on their correlation with seasonal rainfall. Rainfall stations were classified into 12 distinct clusters to distinguish rainfall patterns between southern and upper Thailand. Experimental results show that incorporating the optimised index into Long Short-Term Memory models significantly improves long-term monthly rainfall prediction skill in most cluster areas. This approach effectively reduces the Root Mean Square Error for 12-month-ahead forecasts.",
      "authors": [
        "Kiattikun Chobtham"
      ],
      "categories": [
        "cs.LG",
        "astro-ph.EP"
      ],
      "published": "2026-01-15T08:40:01Z",
      "updated": "2026-01-15T08:40:01Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10181v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10181v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.09835v1",
      "title": "A Robust Launching Mechanism for Freely-Floating Planets from Host Stars with Close-in Planets",
      "abstract": "Secular perturbations from binary stars and distant massive planets can drive cold planets onto nearly parabolic orbits with pericenter passages extremely close to their host stars. Meanwhile, short-period super-Earths are frequently observed around nearby stars. Gravitational scattering between these two distinct populations can lead to substantial orbital energy exchange, liberating some intruders from the gravitational confinement of their host systems. This process offers a robust formation channel for a subset of the abundant freely floating planet population. It may also significantly perturb the original orbits of close-in planets, induce collisional trajectories between close-in planets and their host stars, and disrupt the dynamical evolution of cold planets toward close stellar encounters.",
      "authors": [
        "Xiaochen Zheng",
        "Zhuoya Cao",
        "Shigeru Ida",
        "Douglas N. C. Lin",
        "Shude Mao"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T19:49:45Z",
      "updated": "2026-01-14T19:49:45Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09835v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09835v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.09671v1",
      "title": "Parallaxes, Proper Motions, and Near-Infrared Photometry for 173 L and T Dwarfs From The US Naval Observatory Infrared Astrometry Program",
      "abstract": "We present near-infrared parallax and proper motion astrometry for 74 L-dwarfs and 99 T-dwarfs, as single objects or in binary systems, obtained with the ASTROCAM astrometric imager on the USNO, Flagstaff Station 1.55-m telescope over two observing periods. For all 173 objects the median number of observational epochs was 62 with a median time frame of 5.25 years, resulting in median uncertainties of $σ$($π_{abs}$) = 1.51 mas, $σ$($μ_{abs}$) = 1.02 mas yr$^{-1}$, and $σ$($V_{\\rm tan}$) = 1.01 km s$^{-1}$. Our observations provide the first parallax/proper motion results for 16 objects and the highest precision parallaxes/proper motions for an additional 116 objects. A serendipitous overlap of 40 objects with Gaia DR3 astrometry allows direct comparison and confirmation of our results, along with an investigation on the effects of resolved binarity on astrometric results. We also provide a uniform set of $J$-, $H$-, $K_{S}$-band photometry in the UKIRT/MKO system, most of it being from new observations. We use these results to examine objects included in this study of special-interest populations, consisting of binaries, wide companions, young objects, subdwarfs, and brown dwarf spectral standards.",
      "authors": [
        "Frederick J. Vrba",
        "Adam C. Schneider",
        "Jeffrey A. Munn",
        "Arne A. Henden",
        "Christain B. Luginbuhl",
        "Conard C. Dahn",
        "Harry H. Guetter",
        "Blaise J. Canzian",
        "Trudy M. Tilleman",
        "Scott E. Dahm",
        "Stephen J. Williams",
        "Justice E. Bruursema",
        "J. Davy Kirkpatrick",
        "Adam J. Burgasser"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-14T18:12:18Z",
      "updated": "2026-01-14T18:12:18Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09671v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09671v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.09639v1",
      "title": "Constraining the size, shape, and albedo of the large Trans-Neptunian Object (28978) Ixion with multi-chord stellar occultations",
      "abstract": "Trans-Neptunian objects (TNOs) are among the most primitive remnants of the early Solar System, and constraining their sizes, shapes, albedos, and surface properties is essential for understanding their origin and evolution. Stellar occultations provide highly accurate size and shape measurements for TNOs, while photometry constrains their albedo and surface colours. (28978) Ixion is one of the largest TNOs and a prominent Plutino, making it a key target for comparative studies. We aim to constrain Ixion's projected size, shape, absolute magnitude, geometric albedo, and surface colours, and to search for evidence of an atmosphere or circum-object material. We analysed stellar occultation campaigns by Ixion conducted between 2020 and 2023 within the Lucky Star collaboration, comprising 51 observations from eight events, including 30 positive detections. Five multi-chord events enabled a global limb fit and an accurate reconstruction of Ixion's projected shape. The occultations reveal a slightly elongated limb well represented by a single projected ellipse, yielding an area-equivalent diameter of $D_{\\mathrm{equiv}} = 696.78^{+10.75}_{-8.87}$ km and an apparent oblateness $ε' = 0.081^{+0.004}_{-0.010}$. Typical radial residuals of order $\\sim$10 km indicate a largely stable shape across epochs, with modest epoch-dependent variations. Calibrated photometric data yield an absolute magnitude of $H_V = 3.845 \\pm 0.006$, a phase-curve slope of $β= 0.1301 \\pm 0.0078$ mag deg$^{-1}$, and a visible geometric albedo of $p_V = 0.106^{+0.003}_{-0.003}$, with colours consistent with moderately red TNO surfaces. No atmosphere or circum-object material is detected down to our sensitivity limits. The best-sampled event also allows a precise measurement of the angular diameter of the occulted star Gaia DR3 4056440205544338944, $θ_\\star = 0.670 \\pm 0.010$ mas.",
      "authors": [
        "Y. Kilic",
        "F. Braga-Ribas",
        "C. L. Pereira",
        "J. L. Ortiz",
        "B. Sicardy",
        "P. Santos-Sanz",
        "O. Erece",
        "J. L. Rizos",
        "J. M. Gómez-Limón",
        "G. Margoti",
        "D. Souami",
        "B. Morgado",
        "A. Gomes-Junior",
        "L. M. Catani",
        "J. Desmars",
        "M. Kretlow",
        "F. Rommel",
        "R. Duffard",
        "A. Alvarez-Candal",
        "J. I. B. Camargo",
        "M. Kaplan",
        "N. Morales",
        "D. Herald",
        "M. Assafin",
        "G. Benedetti-Rossi",
        "R. Sfair",
        "R. Savalle",
        "J. Arcas-Silva",
        "L. Bernasconi",
        "T. Blank",
        "M. Bonavita",
        "N. Carlson",
        "B. Christophe",
        "C. A. Colesanti",
        "M. Collins",
        "G. Columba",
        "R. Dunford",
        "D. W. Dunham",
        "J. Dunham",
        "M. Emilio",
        "W. G. Ferrante",
        "T. George",
        "W. Hanna",
        "G. Isopi",
        "R. Jones",
        "D. A. Kenyon",
        "S. Kerr",
        "V. Kouprianov",
        "P. D. Maley",
        "F. Mallia",
        "J. Mattei",
        "M. Meunier",
        "T. Napoleao",
        "V. F. Peixoto",
        "J. Pollock",
        "C. Snodgrass",
        "A. Stechina",
        "W. Thomas",
        "R. Venable",
        "G. R. Viscome",
        "A. Zapparata",
        "J. Bardecker",
        "N. Castro",
        "C. Cebral",
        "A. Chapman",
        "C. Gao",
        "K. Green",
        "A. Guimaraes",
        "C. Jacques",
        "E. Jehin",
        "M. Konishi",
        "R. Leiva",
        "L. Liberato",
        "C. Magliano",
        "L. A. Mammana",
        "M. Melita",
        "V. Moura",
        "Y. Olivera-Cuello",
        "L. Peiro",
        "J. Spagnotto",
        "P. C. Stuart",
        "L. Vanzi",
        "A. Wilberger",
        "M. Malacarne"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T17:20:09Z",
      "updated": "2026-01-14T17:20:09Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09639v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09639v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.09492v1",
      "title": "Demographics of Close-In TESS Exoplanets Orbiting FGK Main-sequence Stars",
      "abstract": "Understanding the demographics of close-in planets is crucial for insights into exoplanet formation and evolution. We present a detailed analysis of occurrence rates for close-in (0.5-16 day) planets with radii between 2 and 20$\\,R_{\\oplus}$ around FGK main-sequence stars. Our study uses a comprehensive sample from four years of TESS Science Processing Operations Center full-frame image data cross-matched with Gaia, analysed through our rigorous detection, vetting, and validation pipeline. Using high-confidence planet candidates, we apply a hierarchical Bayesian model to determine occurrence rates in the two-dimensional orbital period-radius plane. Our results are presented using 10-by-10 bins across the period-radius parameter space, offering unprecedented resolution and statistical precision. We find an overall occurrence rate of $9.4^{+0.7}_{-0.6}\\%$. When using identical binning, our occurrence rate posteriors distributions align with Kepler's but have a magnitude smaller uncertainties on average. For hot Jupiters, we estimate the overall occurrence rate of $0.39^{+0.03}_{-0.02}\\%$. This value is consistent with the previous Kepler FGK-type result within $1σ$. We find an overall occurrence rate of Neptunian desert planets of $0.08\\pm0.01\\%$, to our knowledge the first such determination. Additionally, in a volume-limited Gaia subsample within 100 pc in the same parameter region, we measure an overall planet occurrence rate of $15.4^{+1.6}_{-1.5}\\%$ and a hot Jupiter occurrence rate of $0.42^{+0.16}_{-0.12}\\%$. Our results establishes an improved foundation for constraining theoretical models of exoplanet populations.",
      "authors": [
        "Kaiming Cui",
        "David J. Armstrong",
        "Andreas Hadjigeorghiou",
        "Marina Lafarga",
        "Vedad Kunovac",
        "Lauren Doyle",
        "Luis Agustín Nieto",
        "Rodrigo F. Díaz"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T13:59:49Z",
      "updated": "2026-01-14T13:59:49Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09492v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09492v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.09468v1",
      "title": "High-fidelity lunar topographic reconstruction across diverse terrain and illumination environments using deep learning",
      "abstract": "Topographic models are essential for characterizing planetary surfaces and for inferring underlying geological processes. Nevertheless, meter-scale topographic data remain limited, which constrains detailed planetary investigations, even for the Moon, where extensive high-resolution orbital images are available. Recent advances in deep learning (DL) exploit single-view imagery, constrained by low-resolution topography, for fast and flexible reconstruction of fine-scale topography. However, their robustness and general applicability across diverse lunar landforms and illumination conditions remain insufficiently explored. In this study, we build upon our previously proposed DL framework by incorporating a more robust scale recovery scheme and extending the model to polar regions under low solar illumination conditions. We demonstrate that, compared with single-view shape-from-shading methods, the proposed DL approach exhibits greater robustness to varying illumination and achieves more consistent and accurate topographic reconstructions. Furthermore, it reliably reconstructs topography across lunar features of diverse scales, morphologies, and geological ages. High-quality topographic models are also produced for the lunar south polar areas, including permanently shadowed regions, demonstrating the method's capability in reconstructing complex and low-illumination terrain. These findings suggest that DL-based approaches have the potential to leverage extensive lunar datasets to support advanced exploration missions and enable investigations of the Moon at unprecedented topographic resolution.",
      "authors": [
        "Hao Chen",
        "Philipp Gläser",
        "Konrad Willner",
        "Jürgen Oberst"
      ],
      "categories": [
        "astro-ph.EP",
        "cs.LG"
      ],
      "published": "2026-01-14T13:21:09Z",
      "updated": "2026-01-14T13:21:09Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09468v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09468v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    },
    {
      "id": "2601.09438v1",
      "title": "Mass estimates of the young TOI-451 transiting planets: Multidimensional Gaussian Process on stellar spectroscopic and photometric signals",
      "abstract": "The young TOI-451 planetary system, aged 125 Myr, provides a unique opportunity to test theories of planetary internal structures and atmospheric mass loss through examination of its three transiting planets. We present an exhaustive photometric and spectroscopic follow-up to determine the orbital and physical properties of the system. We perform multidimensional Gaussian Process regression with the code pyaneti on spectroscopic time-series and NGTS/LCO light curves to disentangle the stellar and planetary signal in ESPRESSO radial velocities. We show how contemporaneous photometry serves as an activity indicator to inform RV modelling within a multidimensional Gaussian Processes framework. We argue that this can be exploited when spectroscopic observations are adversely affected by low signal-to-noise and/or poor sampling. We estimate the Doppler semi-amplitudes of Kb = 2.6(+1.1,-1.2) m/s, Kc = 1.2(+1.0,-0.8) m/s and Kd = 2.7 +/- 1.2 m/s. This translates into 2-sigma mass estimates for TOI-451 b and d of Mb = 4.7(+2.1,-2.2) Earth masses and Md = 10.2(+4.6,-4.5) Earth masses, as well as a mass upper limit for TOI-451 c of Mc < 11.5 Earth masses. The derived planetary properties suggest that planets c and d contain significant hydrogen-rich envelopes. The inferred parameters of TOI-451 b are consistent with either a rocky world that still retains a small hydrogen envelope or a water world. These insights make the TOI-451 system an ideal laboratory for future follow-up studies aimed at measuring atmospheric compositions, detecting atmospheric mass-loss signatures, and further exploring planetary formation and evolution processes.",
      "authors": [
        "Oscar Barragán",
        "Manuel Mallorquín",
        "Jorge Fernández-Fernández",
        "Faith Hawthorn",
        "Alix V. Freckelton",
        "Marina Lafarga",
        "Michael Cretignier",
        "Yoshi N. E. Eschen",
        "Samuel Gill",
        "Víctor J. S. Béjar",
        "Nicolas Lodieu",
        "Haochuan Yu",
        "Thomas G. Wilson",
        "David Anderson",
        "Ioannis Apergis",
        "Matthew Battley",
        "Edward M. Bryant",
        "Pía Cortés-Zuleta",
        "Edward Gillen",
        "James S. Jenkins",
        "Baptiste Klein",
        "James McCormac",
        "Annabella Meech",
        "Erik Meier-Valdés",
        "Maximiliano Moyano",
        "Annelies Mortier",
        "Felipe Murgas",
        "Louise D. Nielsen",
        "Suman Saha",
        "José I. Vines",
        "Richard West",
        "Peter J. Wheatley",
        "Suzanne Aigrain"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T12:39:48Z",
      "updated": "2026-01-14T12:39:48Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09438v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09438v1",
      "summary": "",
      "summary_html": "<p><em>Summary unavailable.</em></p>"
    }
  ]
}