{
  "announcement_date": "2026-01-20",
  "updated_at": "2026-01-20T19:31:27.440580+00:00",
  "category": "astro-ph.EP",
  "paper_count": 17,
  "papers": [
    {
      "id": "2601.10508v1",
      "title": "sponchpop II: Population Synthesis to Investigate Volatile Sulfur as a Fingerprint of Gas Giant Formation Histories",
      "abstract": "Planet population synthesis is an integral tool for linking exoplanets to their formation environments. Most planet population synthesis studies have focused on the carbon-to-oxygen ratio (C/O) in gas or solids, yet more insight into planet formation may be afforded by considering a wider suite of elements. Sulfur is one such key element. It has been assumed to be entirely refractory in population synthesis models, restricting it to being a tracer of accreted rocky solids. However, sulfur also has a volatile reservoir dominant at the onset of star and planet formation. We investigate sulfur's wider potential as a formation history tracer by implementing the first multi-phase treatment of S in a planet population synthesis model. We present the planet formation module of \\textsc{sponchpop} and its first predicted planet growth tracks and populations. We explore the diversity of planet compositions in terms of their sulfur budget, including both refractory and volatile components, and apply a novel gas-grain conversion of sulfur to study how formation trajectories of giant planets relate to final core and envelope compositions. We show that planets inherit a wide range of core and envelope sulfur content related to accretion history while considering late-stage planetesimal infall, providing a new diagnostic tool for planet formation. The diverse sulfur content of planet cores suggests some rocky planets may be born sulfur-poor, with implications for their geochemistry and habitability. Enhanced sulfur abundances in gas-giant atmospheres can be attributed to formation beyond the H2S iceline, such as the giants in our Solar System.",
      "authors": [
        "Anna Sommerville-Thomas",
        "Mihkel Kama",
        "Oliver Shottle",
        "Jason Ran"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T15:34:21Z",
      "updated": "2026-01-15T15:34:21Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10508v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10508v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 50,
      "summary": "**Why It Matters**\n\nWhen astronomers discover new planets beyond our solar system, they're not just collecting cosmic stamps—they're trying to solve one of science's biggest puzzles: how do planets form, and could any of them harbor life? Understanding what planets are made of offers crucial clues to their birth stories and their potential to support life as we know it. This research focuses on sulfur, a common element that's been largely overlooked in planet formation studies. By tracking sulfur through the planet-building process, scientists can now read the chemical \"fingerprints\" that reveal where and how giant planets formed billions of years ago.\n\n**What They Did**\n\nThe researchers created a sophisticated computer simulation that models how planets grow from tiny dust grains to massive worlds over millions of years. Think of it like a cosmic recipe simulator that tracks not just the main ingredients, but also traces the journey of sulfur through different phases of planet formation. Previous studies treated sulfur as if it only existed in solid, rocky form—like assuming flour only exists as bread. But sulfur also exists as a gas or ice depending on temperature, so the team built the first model that follows sulfur through all its different states as planets assemble. They ran thousands of virtual planet formation scenarios to see how different conditions affect the final sulfur content of planets.\n\n**Key Findings**\n\nThe simulations revealed that planets end up with wildly different amounts of sulfur depending on their formation history. Gas giants that formed in the cold outer regions of their stellar systems—beyond where hydrogen sulfide freezes into ice—contain much more sulfur in their atmospheres, similar to Jupiter and Saturn in our solar system. Meanwhile, some rocky planets could be born surprisingly sulfur-poor, which would dramatically affect their geology and potentially their ability to support life, since sulfur plays important roles in atmospheric chemistry and biological processes.\n\n**Looking Forward**\n\nThis research provides astronomers with a new diagnostic tool for understanding exoplanet origins. By measuring sulfur content in planet atmospheres using space telescopes, scientists can now work backwards to determine where those planets likely formed and how they migrated to their current positions. This could revolutionize our understanding of planetary system architecture and help identify which worlds might be most suitable for life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>When astronomers discover new planets beyond our solar system, they're not just collecting cosmic stamps—they're trying to solve one of science's biggest puzzles: how do planets form, and could any of them harbor life? Understanding what planets are made of offers crucial clues to their birth stories and their potential to support life as we know it. This research focuses on sulfur, a common element that's been largely overlooked in planet formation studies. By tracking sulfur through the planet-building process, scientists can now read the chemical \"fingerprints\" that reveal where and how giant planets formed billions of years ago.</p>\n<h4>What They Did</h4>\n<p>The researchers created a sophisticated computer simulation that models how planets grow from tiny dust grains to massive worlds over millions of years. Think of it like a cosmic recipe simulator that tracks not just the main ingredients, but also traces the journey of sulfur through different phases of planet formation. Previous studies treated sulfur as if it only existed in solid, rocky form—like assuming flour only exists as bread. But sulfur also exists as a gas or ice depending on temperature, so the team built the first model that follows sulfur through all its different states as planets assemble. They ran thousands of virtual planet formation scenarios to see how different conditions affect the final sulfur content of planets.</p>\n<h4>Key Findings</h4>\n<p>The simulations revealed that planets end up with wildly different amounts of sulfur depending on their formation history. Gas giants that formed in the cold outer regions of their stellar systems—beyond where hydrogen sulfide freezes into ice—contain much more sulfur in their atmospheres, similar to Jupiter and Saturn in our solar system. Meanwhile, some rocky planets could be born surprisingly sulfur-poor, which would dramatically affect their geology and potentially their ability to support life, since sulfur plays important roles in atmospheric chemistry and biological processes.</p>\n<h4>Looking Forward</h4>\n<p>This research provides astronomers with a new diagnostic tool for understanding exoplanet origins. By measuring sulfur content in planet atmospheres using space telescopes, scientists can now work backwards to determine where those planets likely formed and how they migrated to their current positions. This could revolutionize our understanding of planetary system architecture and help identify which worlds might be most suitable for life.</p>",
      "tweet_hook": {
        "hook": "Some rocky planets may be born sulfur-poor, affecting their geochemistry and potential for life",
        "claim": "First population synthesis model tracks both solid and gas-phase sulfur in planet formation",
        "evidence": "Method: Novel gas-grain sulfur conversion reveals how formation beyond H2S iceline shapes composition",
        "question": "Could sulfur abundance be a better formation tracer than C/O ratios for gas giants?"
      },
      "figure_url": "https://arxiv.org/html/2601.10508v1/kama2019.png"
    },
    {
      "id": "2601.09492v1",
      "title": "Demographics of Close-In TESS Exoplanets Orbiting FGK Main-sequence Stars",
      "abstract": "Understanding the demographics of close-in planets is crucial for insights into exoplanet formation and evolution. We present a detailed analysis of occurrence rates for close-in (0.5-16 day) planets with radii between 2 and 20$\\,R_{\\oplus}$ around FGK main-sequence stars. Our study uses a comprehensive sample from four years of TESS Science Processing Operations Center full-frame image data cross-matched with Gaia, analysed through our rigorous detection, vetting, and validation pipeline. Using high-confidence planet candidates, we apply a hierarchical Bayesian model to determine occurrence rates in the two-dimensional orbital period-radius plane. Our results are presented using 10-by-10 bins across the period-radius parameter space, offering unprecedented resolution and statistical precision. We find an overall occurrence rate of $9.4^{+0.7}_{-0.6}\\%$. When using identical binning, our occurrence rate posteriors distributions align with Kepler's but have a magnitude smaller uncertainties on average. For hot Jupiters, we estimate the overall occurrence rate of $0.39^{+0.03}_{-0.02}\\%$. This value is consistent with the previous Kepler FGK-type result within $1σ$. We find an overall occurrence rate of Neptunian desert planets of $0.08\\pm0.01\\%$, to our knowledge the first such determination. Additionally, in a volume-limited Gaia subsample within 100 pc in the same parameter region, we measure an overall planet occurrence rate of $15.4^{+1.6}_{-1.5}\\%$ and a hot Jupiter occurrence rate of $0.42^{+0.16}_{-0.12}\\%$. Our results establishes an improved foundation for constraining theoretical models of exoplanet populations.",
      "authors": [
        "Kaiming Cui",
        "David J. Armstrong",
        "Andreas Hadjigeorghiou",
        "Marina Lafarga",
        "Vedad Kunovac",
        "Lauren Doyle",
        "Luis Agustín Nieto",
        "Rodrigo F. Díaz"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T13:59:49Z",
      "updated": "2026-01-14T13:59:49Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09492v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09492v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 33,
      "summary": "**Why It Matters**\n\nFor centuries, we wondered if planets like Earth were rare cosmic accidents or common features of the universe. Thanks to powerful space telescopes, we now know that planets are everywhere—but we're still figuring out what kinds of planets are most common and where they tend to form. This research tackles a particularly intriguing puzzle: the strange worlds that orbit incredibly close to their stars, completing full \"years\" in just days or weeks. These scorching planets, which include everything from super-sized Earths to gas giants larger than Jupiter, hold crucial clues about how planetary systems form and evolve. Understanding their abundance helps us piece together the story of planet formation—including how rare or common Earth-like worlds might be.\n\n**What They Did**\n\nThe researchers analyzed four years of data from TESS (Transiting Exoplanet Survey Satellite), a space telescope that watches for the tiny dimming that occurs when a planet passes in front of its star. Think of it like watching for the shadow of a moth crossing a distant streetlight. They focused on planets orbiting sun-like stars and took orbits lasting between half a day and 16 days—imagine worlds where a \"year\" is shorter than a typical vacation. The team then used sophisticated statistical methods to account for the planets they might have missed, similar to how pollsters adjust their samples to represent the broader population. This allowed them to calculate what percentage of sun-like stars actually host these close-orbiting worlds.\n\n**Key Findings**\n\nThe results reveal that close-in planets are surprisingly common. Overall, about 9.4% of sun-like stars host at least one planet orbiting closer than Mercury does to our Sun. The famous \"hot Jupiters\"—gas giants that complete their orbits in days—appear around roughly 0.4% of stars, confirming previous estimates. Perhaps most intriguingly, they found that planets in the so-called \"Neptunian desert\"—a mysterious gap where Neptune-sized planets seem to avoid forming—occur around just 0.08% of stars, providing the first precise measurement of this cosmic rarity.\n\n**Looking Forward**\n\nThese findings provide astronomers with a detailed census that will help refine theories about how planets form and migrate to their final orbits. The data suggests that the processes creating close-in planets are remarkably consistent across our galaxy. This work sets the stage for future missions that will study these worlds' atmospheres and compositions, potentially revealing how planetary systems evolve and what conditions might favor the formation of habitable worlds like Earth.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>For centuries, we wondered if planets like Earth were rare cosmic accidents or common features of the universe. Thanks to powerful space telescopes, we now know that planets are everywhere—but we're still figuring out what kinds of planets are most common and where they tend to form. This research tackles a particularly intriguing puzzle: the strange worlds that orbit incredibly close to their stars, completing full \"years\" in just days or weeks. These scorching planets, which include everything from super-sized Earths to gas giants larger than Jupiter, hold crucial clues about how planetary systems form and evolve. Understanding their abundance helps us piece together the story of planet formation—including how rare or common Earth-like worlds might be.</p>\n<h4>What They Did</h4>\n<p>The researchers analyzed four years of data from TESS (Transiting Exoplanet Survey Satellite), a space telescope that watches for the tiny dimming that occurs when a planet passes in front of its star. Think of it like watching for the shadow of a moth crossing a distant streetlight. They focused on planets orbiting sun-like stars and took orbits lasting between half a day and 16 days—imagine worlds where a \"year\" is shorter than a typical vacation. The team then used sophisticated statistical methods to account for the planets they might have missed, similar to how pollsters adjust their samples to represent the broader population. This allowed them to calculate what percentage of sun-like stars actually host these close-orbiting worlds.</p>\n<h4>Key Findings</h4>\n<p>The results reveal that close-in planets are surprisingly common. Overall, about 9.4% of sun-like stars host at least one planet orbiting closer than Mercury does to our Sun. The famous \"hot Jupiters\"—gas giants that complete their orbits in days—appear around roughly 0.4% of stars, confirming previous estimates. Perhaps most intriguingly, they found that planets in the so-called \"Neptunian desert\"—a mysterious gap where Neptune-sized planets seem to avoid forming—occur around just 0.08% of stars, providing the first precise measurement of this cosmic rarity.</p>\n<h4>Looking Forward</h4>\n<p>These findings provide astronomers with a detailed census that will help refine theories about how planets form and migrate to their final orbits. The data suggests that the processes creating close-in planets are remarkably consistent across our galaxy. This work sets the stage for future missions that will study these worlds' atmospheres and compositions, potentially revealing how planetary systems evolve and what conditions might favor the formation of habitable worlds like Earth.</p>",
      "tweet_hook": {
        "hook": "Only 1 in 250 Sun-like stars hosts a hot Jupiter, but 1 in 10 has close-in planets overall",
        "claim": "TESS data reveals precise occurrence rates for close-in exoplanets with 10x better precision than Kepler",
        "evidence": "9.4% of FGK stars have planets between 0.5-16 days; hot Jupiters at 0.39%; Neptunian desert at 0.08%",
        "question": "Why are hot Jupiters so rare when smaller close-in planets are common?"
      },
      "figure_url": "https://arxiv.org/html/2601.09492v1/stellar-temp.png"
    },
    {
      "id": "2601.09330v1",
      "title": "NIRPS tightens the mass estimate of GJ 3090 b and detects a planet near the stellar rotation period",
      "abstract": "We present an updated characterization of the planetary system orbiting the nearby M2 dwarf GJ 3090 (TOI-177; $d = 22$ pc), based on new high-precision radial velocity (RV) observations from NIRPS and HARPS. With an orbital period of 2.85 d, the transiting sub-Neptune GJ 3090 b has a mass we refine to $4.52 \\pm 0.47 M_{\\oplus}$, which, combined with our derived radius of $2.18 \\pm 0.06 R_{\\oplus}$, yields a density of $2.40^{+0.33}_{-0.30}$ g cm$^{-3}$. The combined interior structure and atmospheric constraints indicate that GJ 3090 b is a compelling water-world candidate, with a volatile-rich envelope in which water likely represents a significant fraction. We also confirm the presence of a second planet, GJ 3090 c, a sub-Neptune with a 15.9 d orbit and a minimum mass of $10.0 \\pm 1.3 M_{\\oplus}$, which does not transit. Despite its proximity to the star's 18 d rotation period, our joint analysis using a multidimensional Gaussian process (GP) model that incorporates TESS photometry and differential stellar temperature measurements distinguishes this planetary signal from activity-induced variability. In addition, we place new constraints on a non-transiting planet candidate with a period of 12.7 d, suggested in earlier RV analyses. This candidate remains a compelling target for future monitoring. These results highlight the crucial role of multidimensional GP modelling in disentangling planetary signals from stellar activity, enabling the detection of a planet near the stellar rotation period that could have remained undetected with traditional approaches.",
      "authors": [
        "Pierrot Lamontagne",
        "Drew Weisserman",
        "Charles Cadieux",
        "David Lafrenière",
        "Alexandrine L'Heureux",
        "Mykhaylo Plotnykov",
        "Léna Parc",
        "Atanas K. Stefanov",
        "Leslie Moranta",
        "René Doyon",
        "François Bouchy",
        "Jean-Baptiste Delisle",
        "Louise D. Nielsen",
        "Gaspare Lo Curto",
        "Frédérique Baron",
        "Susana C. C. Barros",
        "Björn Benneke",
        "Xavier Bonfils",
        "Marta Bryan",
        "Bruno L. Canto Martins",
        "Ryan Cloutier",
        "Nicolas B. Cowan",
        "Daniel Brito de Freitas",
        "Jose Renan De Medeiros",
        "Xavier Delfosse",
        "Elisa Delgado-Mena",
        "Xavier Dumusque",
        "David Ehrenreich",
        "Pedro Figueira",
        "Jonay I. González Hernández",
        "Izan de Castro Leão",
        "Christophe Lovis",
        "Lison Malo",
        "Claudio Melo",
        "Lucile Mignon",
        "Christoph Mordasini",
        "Francesco Pepe",
        "Rafael Rebolo",
        "Jason Rowe",
        "Nuno C. Santos",
        "Damien Ségransan",
        "Alejandro Suárez Mascareño",
        "Stéphane Udry",
        "Diana Valencia",
        "Gregg Wade",
        "Manuel Abreu",
        "José Luan A. Aguiar",
        "Khaled Al Moulla",
        "Guillaume Allain",
        "Romain Allart",
        "Jose Manuel Almenara",
        "Tomy Arial",
        "Hugues Auger",
        "Luc Bazinet",
        "Nicolas Blind",
        "David Bohlender",
        "Étienne Artigau",
        "Isabelle Boisse",
        "Anne Boucher",
        "Vincent Bourrier",
        "Sébastien Bovay",
        "Pedro Branco",
        "Christopher Broeg",
        "Denis Brousseau",
        "Alexandre Cabral",
        "Andres Carmona",
        "Yann Carteret",
        "Zalpha Challita",
        "David Charbonneau",
        "Bruno Chazelas",
        "Catherine A. Clark",
        "João Coelho",
        "Marion Cointepas",
        "Karen A. Collins",
        "Kevin I. Collins",
        "Uriel Conod",
        "Eduardo Cristo",
        "Ana Rita Costa Silva",
        "Antoine Darveau-Bernier",
        "Laurie Dauplaise",
        "Roseane de Lima Gomes",
        "João Faria",
        "Dasaev O. Fontinele",
        "Thierry Forveille",
        "Yolanda G. C. Frensch",
        "Jonathan Gagné",
        "Frédéric Genest",
        "Ludovic Genolet",
        "João Gomes da Silva",
        "Félix Gracia Témich",
        "Nicole Gromek",
        "Nolan Grieves",
        "Olivier Hernandez",
        "Melissa J. Hobson",
        "H. Jens Hoeijmakers",
        "Norbert Hubin",
        "Neil J. Cook",
        "Marziye Jafariyazani",
        "Farbod Jahandar",
        "Ray Jayawardhana",
        "Hans-Ulrich Käufl",
        "Dan Kerley",
        "Johann Kolb",
        "Vigneshwaran Krishnamurthy",
        "Benjamin Kung",
        "Pierre Larue",
        "Henry Leath",
        "Olivia Lim",
        "Allan M. Martins",
        "Elisabeth C. Matthews",
        "Jaymie Matthews",
        "Jean-Sébastien Mayer",
        "Stan Metchev",
        "Lina Messamah",
        "Yuri S. Messias",
        "Dany Mounzer",
        "Nicola Nari",
        "Ares Osborn",
        "Mathieu Ouellet",
        "Jon Otegi",
        "Luca Pasquini",
        "Vera M. Passegger",
        "Stefan Pelletier",
        "Céline Peroux",
        "Caroline Piaulet-Ghorayeb",
        "Emanuela Pompei",
        "Anne-Sophie Poulin-Girard",
        "José Luis Rasilla",
        "Vladimir Reshetov",
        "Jonathan Saint-Antoine",
        "Mirsad Sarajlic",
        "Ivo Saviane",
        "Robin Schnell",
        "Alex Segovia",
        "Julia Seidel",
        "Armin Silber",
        "Peter Sinclair",
        "Michael Sordet",
        "Danuta Sosnowska",
        "Avidaan Srivastava",
        "Márcio A. Teixeira",
        "Simon Thibault",
        "Philippe Vallée",
        "Thomas Vandal",
        "Valentina Vaulato",
        "Joost P. Wardenier",
        "Bachar Wehbe",
        "Ivan Wevers",
        "François Wildi",
        "Vincent Yariv",
        "Gérard Zins"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T10:04:56Z",
      "updated": "2026-01-14T10:04:56Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09330v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09330v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 32,
      "summary": "**Why It Matters**\nThis research advances our ability to find and characterize potentially habitable worlds around nearby red dwarf stars, which make up about 75% of all stars in our galaxy. The study also demonstrates crucial new techniques for distinguishing real planetary signals from confusing stellar noise, a major challenge that has limited planet discovery efforts.\n\n**What They Did**\nAstronomers used two high-precision instruments, NIRPS and HARPS, to measure tiny wobbles in a nearby red dwarf star called GJ 3090, located just 22 light-years away. They employed sophisticated computer modeling that simultaneously analyzed the star's motion, brightness changes, and temperature variations to separate genuine planetary signals from the star's own magnetic activity.\n\n**Key Findings**\nThe team refined measurements of a known sub-Neptune planet (GJ 3090 b) that's about 4.5 times Earth's mass and likely a \"water world\" with significant water content in its atmosphere. They confirmed a second, larger planet (GJ 3090 c) that's about 10 times Earth's mass and orbits every 16 days—remarkably close to the star's 18-day rotation period. This second planet was particularly challenging to detect because stellar rotation can mimic planetary signals. The researchers also identified hints of a possible third planet that warrants future investigation.\n\n**Looking Forward**\nThese advanced analysis techniques will be essential for future planet-hunting missions, especially when searching for Earth-like worlds around active stars where traditional methods often fail. The confirmed water-world candidate adds to our growing catalog of potentially habitable planets, while the methodology opens new possibilities for detecting planets in previously inaccessible orbital configurations around nearby stars.",
      "summary_html": "<h4>Why It Matters</h4>\nThis research advances our ability to find and characterize potentially habitable worlds around nearby red dwarf stars, which make up about 75% of all stars in our galaxy. The study also demonstrates crucial new techniques for distinguishing real planetary signals from confusing stellar noise, a major challenge that has limited planet discovery efforts.\n<h4>What They Did</h4>\nAstronomers used two high-precision instruments, NIRPS and HARPS, to measure tiny wobbles in a nearby red dwarf star called GJ 3090, located just 22 light-years away. They employed sophisticated computer modeling that simultaneously analyzed the star's motion, brightness changes, and temperature variations to separate genuine planetary signals from the star's own magnetic activity.\n<h4>Key Findings</h4>\nThe team refined measurements of a known sub-Neptune planet (GJ 3090 b) that's about 4.5 times Earth's mass and likely a \"water world\" with significant water content in its atmosphere. They confirmed a second, larger planet (GJ 3090 c) that's about 10 times Earth's mass and orbits every 16 days—remarkably close to the star's 18-day rotation period. This second planet was particularly challenging to detect because stellar rotation can mimic planetary signals. The researchers also identified hints of a possible third planet that warrants future investigation.\n<h4>Looking Forward</h4>\nThese advanced analysis techniques will be essential for future planet-hunting missions, especially when searching for Earth-like worlds around active stars where traditional methods often fail. The confirmed water-world candidate adds to our growing catalog of potentially habitable planets, while the methodology opens new possibilities for detecting planets in previously inaccessible orbital configurations around nearby stars.",
      "tweet_hook": {
        "hook": "New telescope data reveals hidden water world just 22 light-years away",
        "claim": "NIRPS confirms GJ 3090 b is likely a water-rich sub-Neptune with precise mass measurements",
        "evidence": "Planet has density of 2.40 g/cm³ suggesting significant water content in volatile-rich envelope",
        "question": "Could nearby water worlds be more common than we thought?"
      },
      "figure_url": "https://arxiv.org/html/2601.09330v1/x1.png"
    },
    {
      "id": "2601.10631v1",
      "title": "Circumplanetary Disk Candidate in the Disk of HD 163296 Traced by Localized Emission from Simple Organics",
      "abstract": "Atacama Large Millimeter/submillimeter Array observations suggest that the disc of HD 163296 is being actively shaped by embedded, yet unseen protoplanets, as indicated by numerous gas and dust substructures consistent with planet-disc interaction models. We report the first detection of simple organic molecules, HCN and C2H, tracing a candidate circumplanetary disc (CPD) in the HD 163296 system, located at an orbital radius of $R=88\\pm7$ au and azimuth $φ=46\\pm3^\\circ$ (or $R=0.75''$, $\\rm{PA}=350^\\circ$ in projected sky coordinates), and originating near the midplane of the circumstellar disc. The signature is localised but spectrally resolved, and it overlaps with a previously reported planet candidate, P94, identified through kinematic perturbations traced by CO lines. We propose a scenario in which the observed chemical anomalies arise from increased heating driven by the forming planet and ongoing accretion through its CPD, facilitating the thermal desorption of species that would otherwise remain frozen out in the disc midplane, and potentially triggering the activation barriers of chemical reactions that lead to enhanced molecular production. Based on a first-order dynamical analysis of the HCN spectrum from the CPD--isolated with a 7$σ$ significance--we infer an upper limit on the planet mass of 1.8 $M_{\\rm Jup}$, consistent with predictions from CO kinematics and constraints from direct imaging studies. By comparing the CPD sizes derived from our models with theoretical expectations where the CPD radius corresponds to roughly one-third of the planet's Hill radius, we favor CPD gas temperatures $T > 150$ K, planet masses $M_{\\rm p} < 1.0$ $M_{\\rm Jup}$, and CPD radii $R_{\\rm CPD} < 2$ au.",
      "authors": [
        "Andres F. Izquierdo",
        "Jaehan Bae",
        "Maria Galloway-Sprietsma",
        "Ewine F. van Dishoeck",
        "Stefano Facchini",
        "Giovanni Rosotti",
        "Jochen Stadler",
        "Myriam Benisty",
        "Leonardo Testi"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-15T17:50:13Z",
      "updated": "2026-01-15T17:50:13Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10631v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10631v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 30,
      "summary": "**Why It Matters**\nScientists have discovered the first chemical fingerprint of a disk of gas and dust swirling around a forming planet, providing unprecedented insight into how planets grow and evolve. This breakthrough offers a new way to study planets that are still forming and too faint to see directly, potentially revolutionizing our understanding of planetary birth.\n\n**What They Did**\nResearchers used the powerful Atacama Large Millimeter/submillimeter Array (ALMA) telescope to analyze the disk around HD 163296, a young star located about 330 light-years away. They detected specific organic molecules—hydrogen cyanide (HCN) and a simple hydrocarbon (C2H)—in a small, localized region that appears to be orbiting the star at roughly the same distance as Neptune orbits our Sun.\n\n**Key Findings**\nThe organic molecules are concentrated in a tiny disk around what appears to be a forming planet about the size of Jupiter, creating the first chemical evidence of a \"circumplanetary disk\"—essentially a mini version of the larger disk surrounding the parent star. This chemical signature matches the location of a previously suspected planet detected through subtle motions in the surrounding gas. The heat from the forming planet and its feeding process is warming the surrounding material to over 150 Kelvin (about -190°F), causing frozen molecules to vaporize and become detectable. The planet appears to be less massive than Jupiter, with its surrounding disk spanning less than twice the distance from Earth to the Sun.\n\n**Looking Forward**\nThis discovery opens a new chapter in planet-hunting techniques, allowing astronomers to study forming planets through their chemical signatures even when they're too dim to photograph directly. Future observations could reveal how planets accumulate their atmospheres and potentially identify the building blocks of life forming around other worlds.",
      "summary_html": "<h4>Why It Matters</h4>\nScientists have discovered the first chemical fingerprint of a disk of gas and dust swirling around a forming planet, providing unprecedented insight into how planets grow and evolve. This breakthrough offers a new way to study planets that are still forming and too faint to see directly, potentially revolutionizing our understanding of planetary birth.\n<h4>What They Did</h4>\nResearchers used the powerful Atacama Large Millimeter/submillimeter Array (ALMA) telescope to analyze the disk around HD 163296, a young star located about 330 light-years away. They detected specific organic molecules—hydrogen cyanide (HCN) and a simple hydrocarbon (C2H)—in a small, localized region that appears to be orbiting the star at roughly the same distance as Neptune orbits our Sun.\n<h4>Key Findings</h4>\nThe organic molecules are concentrated in a tiny disk around what appears to be a forming planet about the size of Jupiter, creating the first chemical evidence of a \"circumplanetary disk\"—essentially a mini version of the larger disk surrounding the parent star. This chemical signature matches the location of a previously suspected planet detected through subtle motions in the surrounding gas. The heat from the forming planet and its feeding process is warming the surrounding material to over 150 Kelvin (about -190°F), causing frozen molecules to vaporize and become detectable. The planet appears to be less massive than Jupiter, with its surrounding disk spanning less than twice the distance from Earth to the Sun.\n<h4>Looking Forward</h4>\nThis discovery opens a new chapter in planet-hunting techniques, allowing astronomers to study forming planets through their chemical signatures even when they're too dim to photograph directly. Future observations could reveal how planets accumulate their atmospheres and potentially identify the building blocks of life forming around other worlds.",
      "tweet_hook": {
        "hook": "First detection of organic molecules around forming planet discovered",
        "claim": "Simple organics HCN and C2H reveal circumplanetary disk in HD 163296 system",
        "evidence": "Localized chemical signatures trace Jupiter-mass planet candidate at 88 AU orbital radius",
        "question": "Could heated circumplanetary disks be organic chemistry factories in space?"
      },
      "figure_url": "https://arxiv.org/html/2601.10631v1/x1.png"
    },
    {
      "id": "2601.09438v1",
      "title": "Mass estimates of the young TOI-451 transiting planets: Multidimensional Gaussian Process on stellar spectroscopic and photometric signals",
      "abstract": "The young TOI-451 planetary system, aged 125 Myr, provides a unique opportunity to test theories of planetary internal structures and atmospheric mass loss through examination of its three transiting planets. We present an exhaustive photometric and spectroscopic follow-up to determine the orbital and physical properties of the system. We perform multidimensional Gaussian Process regression with the code pyaneti on spectroscopic time-series and NGTS/LCO light curves to disentangle the stellar and planetary signal in ESPRESSO radial velocities. We show how contemporaneous photometry serves as an activity indicator to inform RV modelling within a multidimensional Gaussian Processes framework. We argue that this can be exploited when spectroscopic observations are adversely affected by low signal-to-noise and/or poor sampling. We estimate the Doppler semi-amplitudes of Kb = 2.6(+1.1,-1.2) m/s, Kc = 1.2(+1.0,-0.8) m/s and Kd = 2.7 +/- 1.2 m/s. This translates into 2-sigma mass estimates for TOI-451 b and d of Mb = 4.7(+2.1,-2.2) Earth masses and Md = 10.2(+4.6,-4.5) Earth masses, as well as a mass upper limit for TOI-451 c of Mc < 11.5 Earth masses. The derived planetary properties suggest that planets c and d contain significant hydrogen-rich envelopes. The inferred parameters of TOI-451 b are consistent with either a rocky world that still retains a small hydrogen envelope or a water world. These insights make the TOI-451 system an ideal laboratory for future follow-up studies aimed at measuring atmospheric compositions, detecting atmospheric mass-loss signatures, and further exploring planetary formation and evolution processes.",
      "authors": [
        "Oscar Barragán",
        "Manuel Mallorquín",
        "Jorge Fernández-Fernández",
        "Faith Hawthorn",
        "Alix V. Freckelton",
        "Marina Lafarga",
        "Michael Cretignier",
        "Yoshi N. E. Eschen",
        "Samuel Gill",
        "Víctor J. S. Béjar",
        "Nicolas Lodieu",
        "Haochuan Yu",
        "Thomas G. Wilson",
        "David Anderson",
        "Ioannis Apergis",
        "Matthew Battley",
        "Edward M. Bryant",
        "Pía Cortés-Zuleta",
        "Edward Gillen",
        "James S. Jenkins",
        "Baptiste Klein",
        "James McCormac",
        "Annabella Meech",
        "Erik Meier-Valdés",
        "Maximiliano Moyano",
        "Annelies Mortier",
        "Felipe Murgas",
        "Louise D. Nielsen",
        "Suman Saha",
        "José I. Vines",
        "Richard West",
        "Peter J. Wheatley",
        "Suzanne Aigrain"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T12:39:48Z",
      "updated": "2026-01-14T12:39:48Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09438v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09438v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 22,
      "summary": "**Why It Matters**\n\nImagine catching a glimpse of our solar system when it was just a baby—that's essentially what astronomers have done with TOI-451, a planetary system only 125 million years old. While that sounds ancient, it's practically infantile compared to our 4.6-billion-year-old solar system. This cosmic nursery gives us a rare window into how planets evolve, lose their atmospheres, and transform over time. Understanding these young worlds helps answer fundamental questions: How do planets like Earth form? What makes some planets keep their atmospheres while others lose them to space? By studying TOI-451, we're essentially looking at planetary adolescence—a crucial period that shaped the worlds we see today.\n\n**What They Did**\n\nThe research team used advanced telescopes to measure tiny wobbles in the star TOI-451 as its three planets tug on it gravitationally—like watching a person being gently pulled back and forth by invisible dance partners. This technique, called the radial velocity method, reveals how massive each planet is. The challenge was separating the planets' gravitational signals from the star's own natural brightness fluctuations, which can mask planetary signatures. To solve this, the researchers used sophisticated computer modeling that simultaneously analyzed the star's light patterns and its wobbling motion, essentially teaching their software to distinguish between stellar hiccups and genuine planetary pulls.\n\n**Key Findings**\n\nThe team successfully weighed all three planets in this young system. The innermost planet, TOI-451 b, weighs about 4.7 times more than Earth and could be either a rocky world with a thin atmosphere or a \"water world\" rich in H2O. The middle planet, TOI-451 c, proved more elusive—they could only establish it weighs less than 11.5 Earth masses. The outermost planet, TOI-451 d, tips the scales at roughly 10 Earth masses and likely sports a thick, hydrogen-rich atmosphere that makes it puffy and Neptune-like.\n\n**Looking Forward**\n\nThis research transforms TOI-451 into a cosmic laboratory for studying planetary evolution. Since these worlds are young, astronomers can potentially observe atmospheric loss in real-time and test theories about how planets shed their gaseous envelopes. Future observations with advanced telescopes could reveal the atmospheric compositions of these planets and catch them in the act of losing gas to space, providing unprecedented insights into the forces that sculpt planetary systems over cosmic time.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine catching a glimpse of our solar system when it was just a baby—that's essentially what astronomers have done with TOI-451, a planetary system only 125 million years old. While that sounds ancient, it's practically infantile compared to our 4.6-billion-year-old solar system. This cosmic nursery gives us a rare window into how planets evolve, lose their atmospheres, and transform over time. Understanding these young worlds helps answer fundamental questions: How do planets like Earth form? What makes some planets keep their atmospheres while others lose them to space? By studying TOI-451, we're essentially looking at planetary adolescence—a crucial period that shaped the worlds we see today.</p>\n<h4>What They Did</h4>\n<p>The research team used advanced telescopes to measure tiny wobbles in the star TOI-451 as its three planets tug on it gravitationally—like watching a person being gently pulled back and forth by invisible dance partners. This technique, called the radial velocity method, reveals how massive each planet is. The challenge was separating the planets' gravitational signals from the star's own natural brightness fluctuations, which can mask planetary signatures. To solve this, the researchers used sophisticated computer modeling that simultaneously analyzed the star's light patterns and its wobbling motion, essentially teaching their software to distinguish between stellar hiccups and genuine planetary pulls.</p>\n<h4>Key Findings</h4>\n<p>The team successfully weighed all three planets in this young system. The innermost planet, TOI-451 b, weighs about 4.7 times more than Earth and could be either a rocky world with a thin atmosphere or a \"water world\" rich in H2O. The middle planet, TOI-451 c, proved more elusive—they could only establish it weighs less than 11.5 Earth masses. The outermost planet, TOI-451 d, tips the scales at roughly 10 Earth masses and likely sports a thick, hydrogen-rich atmosphere that makes it puffy and Neptune-like.</p>\n<h4>Looking Forward</h4>\n<p>This research transforms TOI-451 into a cosmic laboratory for studying planetary evolution. Since these worlds are young, astronomers can potentially observe atmospheric loss in real-time and test theories about how planets shed their gaseous envelopes. Future observations with advanced telescopes could reveal the atmospheric compositions of these planets and catch them in the act of losing gas to space, providing unprecedented insights into the forces that sculpt planetary systems over cosmic time.</p>",
      "tweet_hook": {
        "hook": "Three planets around a 125-million-year-old star reveal how worlds lose their atmospheres in real-time",
        "claim": "First mass measurements of planets in the young TOI-451 system show active envelope evolution",
        "evidence": "RV measurements found TOI-451 d has 10.2 Earth masses with a thick hydrogen atmosphere",
        "question": "Which planet will lose its atmosphere first - the inner rocky world or outer giants?"
      },
      "figure_url": "https://arxiv.org/html/2601.09438v1/x1.png"
    },
    {
      "id": "2601.10450v1",
      "title": "TOI-3862 b: A dense super-Neptune deep in the hot Neptune desert",
      "abstract": "The structure and evolution of close-in exoplanets are shaped by atmospheric loss and migration processes, which give rise to key population features such as the hot Neptune desert, ridge, and savanna - regions of the period-radius space whose boundaries offer critical insights into planetary formation and survival. As part of the KESPRINT collaboration, we selected the TESS transiting planet candidate TOI-3862.01 for radial velocity follow-up to confirm its planetary nature and characterize its mass and bulk properties. This planet candidate is of particular interest due to its position in the middle of the hot Neptune desert, making it a valuable probe for testing theories of planet migration and atmospheric loss. We confirmed the planetary nature and determined the mass of TOI-3862.01 (hereinafter TOI-3862b) by performing a joint fit with both transit and radial velocity data, precisely characterizing the bulk properties of this planet. TOI-3862b is a super-Neptune on a 1.56-day orbit around a Sun-like star with an effective temperature of 5300$\\pm$50K. It has a mass of 53.7$_{-2.9}^{+2.8}$ M$_{\\oplus}$ and a radius of 5.53$\\pm$0.18 R$_{\\oplus}$, corresponding to a density of 1.7$\\pm$0.2 g/cm^3. This places it among the rare population of hot and dense super-Neptune desert planets. TOI-3862b, residing deep in the hot Neptune desert, represents a rare occurrence in an otherwise sparsely populated region, offering a valuable opportunity to probe the processes that may allow planets to survive in such environments.",
      "authors": [
        "Ilaria Carleo",
        "Amadeo Castro-González",
        "Enric Pallé",
        "Felipe Murgas",
        "Grzegorz Nowak",
        "Gaia Lacedelli",
        "Thomas Masseron",
        "Emily W. Wong",
        "Patrick Eggenberger",
        "Vincent Bourrier",
        "Dawid Jankowski",
        "Krzysztof Goździewski",
        "Douglas R. Alves",
        "James S. Jenkins",
        "Sergio Messina",
        "Keivan G. Stassun",
        "Jose I. Vines",
        "Matteo Brogi",
        "David R. Ciardi",
        "Catherine A. Clark",
        "William Cochran",
        "Karen A. Collins",
        "Hans J. Deeg",
        "Elise Furlan",
        "Davide Gandolfi",
        "Samuel Geraldía González",
        "Artie P. Hatzes",
        "Coel Hellier",
        "Steve B. Howell",
        "Judith Korth",
        "Jorge Lillo-Box",
        "John H. Livingston",
        "Jaume Orell-Miquel",
        "Carina M. Persson",
        "Seth Redfield",
        "Boris Safonov",
        "David Baker",
        "Rafael Delfin Barrena Delgado",
        "Allyson Bieryla",
        "Andrew Boyle",
        "Pau Bosch-Cabot",
        "Núria Casasayas Barris",
        "Stavros Chairetas",
        "Jerome P. de Leon",
        "Izuru Fukuda",
        "Akihiko Fukui",
        "Pere Guerra",
        "Kai Ikuta",
        "Kiyoe Kawauchi",
        "Emil Knudstrup",
        "Florence Libotte",
        "Michael B. Lund",
        "Rafael Luque",
        "Eduardo Lorenzo Martín Guerrero de Escalante",
        "Bob Massey",
        "Edward J. Michaels",
        "Giuseppe Morello",
        "Norio Narita",
        "Hannu Parvianien",
        "Richard P. Schwarz",
        "Avi Shporer",
        "Monika Stangret",
        "Noriharu Watanabe",
        "Cristilyn N. Watkins"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T14:39:32Z",
      "updated": "2026-01-15T14:39:32Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10450v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10450v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 20,
      "summary": "**Why It Matters**\n\nImagine trying to understand how neighborhoods form by studying only the houses that survived natural disasters. That's essentially what astronomers face when studying planets close to their stars. Most planets that orbit extremely close to their host stars have either been stripped down to rocky cores or puffed up into gas giants—creating what scientists call the \"hot Neptune desert,\" a region where medium-sized planets are mysteriously rare. Finding planets in this cosmic wasteland helps us understand the violent processes that shape planetary systems, including our own. By studying these survivors, we gain crucial insights into how planets migrate, evolve, and sometimes endure in the harshest environments imaginable.\n\n**What They Did**\n\nResearchers used NASA's planet-hunting telescope TESS (Transiting Exoplanet Survey Satellite) to spot a potential planet candidate called TOI-3862.01. When a planet crosses in front of its star from our perspective, it creates a tiny dimming—like a moth passing in front of a streetlight. But seeing this dimming isn't enough to confirm it's actually a planet. The team then used ground-based telescopes to measure how the planet's gravity tugs on its star, causing the star to wobble slightly. By combining both techniques—watching the planet block starlight and measuring the star's wobble—they could determine both the planet's size and mass, giving them a complete picture of this cosmic oddball.\n\n**Key Findings**\n\nTOI-3862b is truly exceptional. This \"super-Neptune\" is about 5.5 times wider than Earth but packs 54 times Earth's mass, making it surprisingly dense for a planet of its type. It races around its Sun-like star in just 1.56 days—imagine a year lasting less than two Earth days! The planet sits right in the middle of the hot Neptune desert, where planets this size simply shouldn't exist. Its density suggests it's managed to hold onto a substantial atmosphere despite being bombarded by intense radiation from its nearby star.\n\n**Looking Forward**\n\nThis discovery challenges our understanding of planetary survival. How did TOI-3862b keep its thick atmosphere in such a hostile environment? Future observations with powerful telescopes like the James Webb Space Telescope could reveal the composition of its atmosphere, potentially showing us new ways planets can endure extreme conditions. Each planet found in the hot Neptune desert helps refine our models of planetary evolution and might even inform our search for habitable worlds in other star systems.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to understand how neighborhoods form by studying only the houses that survived natural disasters. That's essentially what astronomers face when studying planets close to their stars. Most planets that orbit extremely close to their host stars have either been stripped down to rocky cores or puffed up into gas giants—creating what scientists call the \"hot Neptune desert,\" a region where medium-sized planets are mysteriously rare. Finding planets in this cosmic wasteland helps us understand the violent processes that shape planetary systems, including our own. By studying these survivors, we gain crucial insights into how planets migrate, evolve, and sometimes endure in the harshest environments imaginable.</p>\n<h4>What They Did</h4>\n<p>Researchers used NASA's planet-hunting telescope TESS (Transiting Exoplanet Survey Satellite) to spot a potential planet candidate called TOI-3862.01. When a planet crosses in front of its star from our perspective, it creates a tiny dimming—like a moth passing in front of a streetlight. But seeing this dimming isn't enough to confirm it's actually a planet. The team then used ground-based telescopes to measure how the planet's gravity tugs on its star, causing the star to wobble slightly. By combining both techniques—watching the planet block starlight and measuring the star's wobble—they could determine both the planet's size and mass, giving them a complete picture of this cosmic oddball.</p>\n<h4>Key Findings</h4>\n<p>TOI-3862b is truly exceptional. This \"super-Neptune\" is about 5.5 times wider than Earth but packs 54 times Earth's mass, making it surprisingly dense for a planet of its type. It races around its Sun-like star in just 1.56 days—imagine a year lasting less than two Earth days! The planet sits right in the middle of the hot Neptune desert, where planets this size simply shouldn't exist. Its density suggests it's managed to hold onto a substantial atmosphere despite being bombarded by intense radiation from its nearby star.</p>\n<h4>Looking Forward</h4>\n<p>This discovery challenges our understanding of planetary survival. How did TOI-3862b keep its thick atmosphere in such a hostile environment? Future observations with powerful telescopes like the James Webb Space Telescope could reveal the composition of its atmosphere, potentially showing us new ways planets can endure extreme conditions. Each planet found in the hot Neptune desert helps refine our models of planetary evolution and might even inform our search for habitable worlds in other star systems.</p>",
      "tweet_hook": {
        "hook": "A super-Neptune survived in the \"hot Neptune desert\" where planets aren't supposed to exist",
        "claim": "TOI-3862b challenges our understanding of how close-in planets avoid atmospheric destruction",
        "evidence": "Dense 1.7 g/cm³ planet orbits every 1.56 days in the sparsely populated hot Neptune desert region",
        "question": "What mechanisms allow some Neptunes to keep their atmospheres so close to their stars?"
      },
      "figure_url": "https://arxiv.org/html/2601.10450v1/x1.png"
    },
    {
      "id": "2601.09468v1",
      "title": "High-fidelity lunar topographic reconstruction across diverse terrain and illumination environments using deep learning",
      "abstract": "Topographic models are essential for characterizing planetary surfaces and for inferring underlying geological processes. Nevertheless, meter-scale topographic data remain limited, which constrains detailed planetary investigations, even for the Moon, where extensive high-resolution orbital images are available. Recent advances in deep learning (DL) exploit single-view imagery, constrained by low-resolution topography, for fast and flexible reconstruction of fine-scale topography. However, their robustness and general applicability across diverse lunar landforms and illumination conditions remain insufficiently explored. In this study, we build upon our previously proposed DL framework by incorporating a more robust scale recovery scheme and extending the model to polar regions under low solar illumination conditions. We demonstrate that, compared with single-view shape-from-shading methods, the proposed DL approach exhibits greater robustness to varying illumination and achieves more consistent and accurate topographic reconstructions. Furthermore, it reliably reconstructs topography across lunar features of diverse scales, morphologies, and geological ages. High-quality topographic models are also produced for the lunar south polar areas, including permanently shadowed regions, demonstrating the method's capability in reconstructing complex and low-illumination terrain. These findings suggest that DL-based approaches have the potential to leverage extensive lunar datasets to support advanced exploration missions and enable investigations of the Moon at unprecedented topographic resolution.",
      "authors": [
        "Hao Chen",
        "Philipp Gläser",
        "Konrad Willner",
        "Jürgen Oberst"
      ],
      "categories": [
        "astro-ph.EP",
        "cs.LG"
      ],
      "published": "2026-01-14T13:21:09Z",
      "updated": "2026-01-14T13:21:09Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09468v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09468v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 15,
      "summary": "**Why It Matters**\nCreating detailed 3D maps of planetary surfaces is crucial for understanding how worlds like the Moon formed and evolved over billions of years. Despite having thousands of high-resolution photos of the Moon, scientists still lack the meter-scale topographic data needed for detailed geological investigations and planning future landing missions.\n\n**What They Did**\nThe researchers developed an advanced artificial intelligence system that can create highly detailed 3D terrain maps using just single photographs of the lunar surface. They trained their deep learning model to work across different types of lunar landscapes and lighting conditions, including the challenging permanently shadowed regions near the Moon's south pole where future missions may land.\n\n**Key Findings**\nThe AI system proved remarkably robust, successfully reconstructing fine-scale topography across diverse lunar features regardless of their size, shape, or geological age. Unlike traditional methods that struggle with varying sunlight conditions, this approach maintained consistent accuracy even in areas with poor illumination. The system generated high-quality 3D models of the lunar south polar regions, including areas that never see direct sunlight. Most impressively, it outperformed existing single-image reconstruction techniques while being much faster and more flexible than conventional methods.\n\n**Looking Forward**\nThis breakthrough could revolutionize how we map not just the Moon, but other planetary bodies throughout the solar system. With vast archives of orbital imagery already available, scientists could rapidly generate unprecedented high-resolution topographic maps to support upcoming lunar missions and advance our understanding of planetary geology at scales never before possible.",
      "summary_html": "<h4>Why It Matters</h4>\nCreating detailed 3D maps of planetary surfaces is crucial for understanding how worlds like the Moon formed and evolved over billions of years. Despite having thousands of high-resolution photos of the Moon, scientists still lack the meter-scale topographic data needed for detailed geological investigations and planning future landing missions.\n<h4>What They Did</h4>\nThe researchers developed an advanced artificial intelligence system that can create highly detailed 3D terrain maps using just single photographs of the lunar surface. They trained their deep learning model to work across different types of lunar landscapes and lighting conditions, including the challenging permanently shadowed regions near the Moon's south pole where future missions may land.\n<h4>Key Findings</h4>\nThe AI system proved remarkably robust, successfully reconstructing fine-scale topography across diverse lunar features regardless of their size, shape, or geological age. Unlike traditional methods that struggle with varying sunlight conditions, this approach maintained consistent accuracy even in areas with poor illumination. The system generated high-quality 3D models of the lunar south polar regions, including areas that never see direct sunlight. Most impressively, it outperformed existing single-image reconstruction techniques while being much faster and more flexible than conventional methods.\n<h4>Looking Forward</h4>\nThis breakthrough could revolutionize how we map not just the Moon, but other planetary bodies throughout the solar system. With vast archives of orbital imagery already available, scientists could rapidly generate unprecedented high-resolution topographic maps to support upcoming lunar missions and advance our understanding of planetary geology at scales never before possible.",
      "tweet_hook": {
        "hook": "AI reconstructs Moon's surface details better than traditional methods",
        "claim": "Deep learning creates high-resolution lunar topography from single orbital images",
        "evidence": "Works across diverse terrains including permanently shadowed polar regions",
        "question": "Could this revolutionize how we map planetary surfaces?"
      },
      "figure_url": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Exoplanet_Comparison_Kepler-22_b.jpg"
    },
    {
      "id": "2601.11280v1",
      "title": "Detection of four cold Jupiters through combined analyses of radial velocity and astrometry data",
      "abstract": "Cold Jupiters play a crucial role in planet formation and dynamical evolution. Since their initial discovery around 47 UMa, they have attracted significant interest, yet their formation mechanisms remain uncertain, underscoring the need to expand the known population. In this work, we combine RV data with Gaia astrometry using Hipparcos-Gaia proper-motion anomalies over a 25-year baseline. By jointly modeling both datasets with the MCMC framework, we constrain planetary masses, orbital inclinations, and three-dimensional orbital architectures. This reduces RV degeneracies and improves mass determinations. Four cold Jupiters are reported: HD 68475 b and HD 100508 b are each the first confirmed planet in their systems, with orbital periods $7832_{-323}^{+463}$ d and $5681\\pm42$ d and dynamical masses of $5.16_{-0.47}^{+0.53} M_{\\text{Jup}}$ and $1.2_{-0.18}^{+0.30} M_{\\text{Jup}}$, respectively. In multi-planet systems, HD 48265 c has a period of $10418_{-1400}^{+2400}$ d and a mass of $3.71_{-0.43}^{+0.68} M_{\\text{Jup}}$, while HD 114386 c orbits at $444.00_{-0.88}^{+0.93}$ d with a minimum mass of $0.37 \\pm 0.03 M_{\\text{Jup}}$. The two planets in the HD 48265 system may exhibit a significant mutual inclination, making it a target for testing the von-Zeipel-Kozai-Lidov mechanism. HD 68475 b is a promising candidate for future direct imaging with ELT/METIS. We identified a Jupiter analog with the longest known orbital period among planets with masses between 0.5 and 2 $M_{\\text{Jup}}$, implying that a substantial population of cold Jupiters likely awaits discovery by Gaia. This study expands the sample of cold Jupiters with constrained orbits and dynamical masses, demonstrating the value of combining radial velocity and astrometry in exoplanet research.",
      "authors": [
        "Yiyun Wu",
        "Guang-Yao Xiao",
        "R. Paul Butler",
        "Fabo Feng",
        "Stephen A. Shectman",
        "Jeffrey D. Crane",
        "Johanna K. Teske",
        "Sharon X. Wang",
        "Yuri Beletsky",
        "Jennifer A. Burt",
        "Tansu Daylan",
        "Matias Diaz",
        "Diana Dragomir",
        "Erin Flowers",
        "Sydney Jenkins",
        "Shubham Kanodia",
        "Sangeetha Nandakumar",
        "Malena Rice",
        "Avi Shporer",
        "Sam Yee",
        "George Zhou",
        "Zitao Lin"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-16T13:25:14Z",
      "updated": "2026-01-16T13:25:14Z",
      "pdf_link": "https://arxiv.org/pdf/2601.11280v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.11280v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 10,
      "summary": "**Why It Matters**\nCold Jupiters—gas giant planets that orbit far from their stars like our own Jupiter—are key to understanding how planetary systems form and evolve over billions of years. Despite decades of planet hunting, scientists still don't fully understand how these distant giants come to exist, making it crucial to find more examples to study.\n\n**What They Did**\nResearchers combined two powerful planet-detection techniques: measuring how stars wobble due to gravitational tugs from orbiting planets (radial velocity), and tracking tiny changes in stellar positions across the sky over 25 years using space telescopes (astrometry). By analyzing both datasets together using advanced computer modeling, they could determine not just that planets exist, but also their true masses and three-dimensional orbital shapes—something that's typically very difficult to measure.\n\n**Key Findings**\nThe team discovered four new cold Jupiter planets orbiting distant stars, with orbital periods ranging from about 1.2 to 28 years. Two of these represent the first confirmed planets in their respective star systems, while the other two add to already-known multi-planet systems. The masses range from about one-third to five times the mass of Jupiter, with one planet (HD 68475 b) having the longest orbital period ever found for planets in its mass range. Intriguingly, two planets in the HD 48265 system may have tilted orbits relative to each other, offering a rare laboratory for testing theories about planetary dynamics.\n\n**Looking Forward**\nThese discoveries suggest that many more cold Jupiters are waiting to be found as space-based telescopes like Gaia continue their surveys. One of the newly discovered planets may even be bright enough for future ground-based telescopes to photograph directly, potentially revealing details about its atmosphere and composition.",
      "summary_html": "<h4>Why It Matters</h4>\nCold Jupiters—gas giant planets that orbit far from their stars like our own Jupiter—are key to understanding how planetary systems form and evolve over billions of years. Despite decades of planet hunting, scientists still don't fully understand how these distant giants come to exist, making it crucial to find more examples to study.\n<h4>What They Did</h4>\nResearchers combined two powerful planet-detection techniques: measuring how stars wobble due to gravitational tugs from orbiting planets (radial velocity), and tracking tiny changes in stellar positions across the sky over 25 years using space telescopes (astrometry). By analyzing both datasets together using advanced computer modeling, they could determine not just that planets exist, but also their true masses and three-dimensional orbital shapes—something that's typically very difficult to measure.\n<h4>Key Findings</h4>\nThe team discovered four new cold Jupiter planets orbiting distant stars, with orbital periods ranging from about 1.2 to 28 years. Two of these represent the first confirmed planets in their respective star systems, while the other two add to already-known multi-planet systems. The masses range from about one-third to five times the mass of Jupiter, with one planet (HD 68475 b) having the longest orbital period ever found for planets in its mass range. Intriguingly, two planets in the HD 48265 system may have tilted orbits relative to each other, offering a rare laboratory for testing theories about planetary dynamics.\n<h4>Looking Forward</h4>\nThese discoveries suggest that many more cold Jupiters are waiting to be found as space-based telescopes like Gaia continue their surveys. One of the newly discovered planets may even be bright enough for future ground-based telescopes to photograph directly, potentially revealing details about its atmosphere and composition.",
      "tweet_hook": {
        "hook": "Four new cold Jupiter exoplanets discovered in groundbreaking study",
        "claim": "Combined radial velocity and Gaia astrometry reveals hidden Jupiter-sized worlds orbiting distant stars",
        "evidence": "One Jupiter analog has the longest known orbital period among similar-mass planets discovered",
        "question": "Could thousands more cold Jupiters be hiding in Gaia data?"
      },
      "figure_url": "https://arxiv.org/html/2601.11280v1/x1.png"
    },
    {
      "id": "2601.10285v1",
      "title": "How disc initial conditions sculpt the atmospheric composition of giant planets",
      "abstract": "Past studies have revealed the dependency of the disc parameters (mass, radius, viscosity, grain fragmentation velocity, dust-to-gas ratio) on the formation of giant planets, where more massive discs seem beneficial for giant planet formation. It is unclear how the different disc properties influence the composition of forming giant planets. The idea that the atmospheric abundances can trace directly the formation location of planets is put into question, due to the chemical evolution of the disc, caused by inward drifting and evaporating pebbles. This complicates the idea of a relation between atmospheric abundances and planet formation locations. We use planet formation simulations that include the effects of pebble drift and evaporation and investigate how the different disc parameters influence the atmospheric composition of giant planets. We focus on the atmospheric C/O, C/H, O/H and S/H ratios allowing us to probe tracers for volatiles and refractories and thus different accretion pathways of giant planets. We find that most of the disc parameters have only a limited influence on the atmospheric abundances of gas giants, except for the dust-to-gas ratio, where a larger value results in higher atmospheric abundances. However the atmospheric abundances are determined by the planetary formation location, even in the pebble drift and evaporation scenario. Our study suggests that volatile-rich giant exoplanets predominantly form in the inner disc regions, where they can accrete large fractions of vapour-enhanced gas. Our study shows that simulations that try to trace the origin of giant planets via their atmospheric abundances do not have to probe all disc parameters, as long as the disc parameters allow the formation of giant planets. Our study thus suggests that the diversity of observed planetary compositions is a direct consequence of their formation location and migration history.",
      "authors": [
        "Angie Daniela Guzmán Franco",
        "Sofia Savvidou",
        "Bertram Bitsch"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T11:01:08Z",
      "updated": "2026-01-15T11:01:08Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10285v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10285v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 10,
      "summary": "**Why It Matters**\n\nWhen we look up at the night sky, we're seeing just a tiny fraction of the planets that exist in our galaxy. Scientists have discovered thousands of exoplanets—worlds orbiting other stars—and many are giant planets like Jupiter and Saturn. But here's the fascinating puzzle: these distant worlds have wildly different atmospheric compositions, even when they're similar in size. Some are rich in carbon, others in oxygen, and still others contain surprising amounts of sulfur. Understanding why planets turn out so different helps us piece together the story of how planetary systems form, including our own. It also guides our search for worlds that might harbor life, since a planet's atmosphere largely determines whether it could support the chemistry of living things.\n\n**What They Did**\n\nThe researchers created detailed computer simulations to watch giant planets form from scratch. Think of a planetary system's birth like a cosmic construction site: there's a spinning disk of gas and dust around a young star, and within this disk, planets slowly assemble themselves. The team focused on tiny particles called pebbles—cosmic dust grains that drift inward toward the star, picking up and releasing different chemical ingredients as they travel. As these pebbles encounter temperature changes, they evaporate and enrich the surrounding gas with various elements. The scientists then tracked how forming giant planets gobble up this chemically-evolving gas, testing different starting conditions for their cosmic construction sites to see how each scenario affected the final planetary recipes.\n\n**Key Findings**\n\nThe study revealed that most factors affecting planet formation—like how massive or viscous the initial disk is—barely influence what ends up in a giant planet's atmosphere. However, one factor made a huge difference: the amount of dust compared to gas in the original disk. More dust means richer planetary atmospheres. Surprisingly, even though the disk's chemistry constantly changes as material moves around, a planet's location during formation still acts like its postal code—planets forming closer to their star end up with more volatile-rich atmospheres because they can feast on gas that's been enriched by evaporating materials.\n\n**Looking Forward**\n\nThese findings simplify the detective work of tracing exoplanets back to their origins. Scientists studying distant worlds through their atmospheric fingerprints now know they don't need to worry about every possible formation scenario—location is king. This research suggests that the incredible diversity we observe in exoplanet atmospheres isn't random but tells a coherent story of where and how these worlds formed. As next-generation telescopes come online, astronomers will be able to analyze many more exoplanet atmospheres, using these insights to map out the formation histories of entire planetary systems and better understand the cosmic processes that create worlds like our own.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>When we look up at the night sky, we're seeing just a tiny fraction of the planets that exist in our galaxy. Scientists have discovered thousands of exoplanets—worlds orbiting other stars—and many are giant planets like Jupiter and Saturn. But here's the fascinating puzzle: these distant worlds have wildly different atmospheric compositions, even when they're similar in size. Some are rich in carbon, others in oxygen, and still others contain surprising amounts of sulfur. Understanding why planets turn out so different helps us piece together the story of how planetary systems form, including our own. It also guides our search for worlds that might harbor life, since a planet's atmosphere largely determines whether it could support the chemistry of living things.</p>\n<h4>What They Did</h4>\n<p>The researchers created detailed computer simulations to watch giant planets form from scratch. Think of a planetary system's birth like a cosmic construction site: there's a spinning disk of gas and dust around a young star, and within this disk, planets slowly assemble themselves. The team focused on tiny particles called pebbles—cosmic dust grains that drift inward toward the star, picking up and releasing different chemical ingredients as they travel. As these pebbles encounter temperature changes, they evaporate and enrich the surrounding gas with various elements. The scientists then tracked how forming giant planets gobble up this chemically-evolving gas, testing different starting conditions for their cosmic construction sites to see how each scenario affected the final planetary recipes.</p>\n<h4>Key Findings</h4>\n<p>The study revealed that most factors affecting planet formation—like how massive or viscous the initial disk is—barely influence what ends up in a giant planet's atmosphere. However, one factor made a huge difference: the amount of dust compared to gas in the original disk. More dust means richer planetary atmospheres. Surprisingly, even though the disk's chemistry constantly changes as material moves around, a planet's location during formation still acts like its postal code—planets forming closer to their star end up with more volatile-rich atmospheres because they can feast on gas that's been enriched by evaporating materials.</p>\n<h4>Looking Forward</h4>\n<p>These findings simplify the detective work of tracing exoplanets back to their origins. Scientists studying distant worlds through their atmospheric fingerprints now know they don't need to worry about every possible formation scenario—location is king. This research suggests that the incredible diversity we observe in exoplanet atmospheres isn't random but tells a coherent story of where and how these worlds formed. As next-generation telescopes come online, astronomers will be able to analyze many more exoplanet atmospheres, using these insights to map out the formation histories of entire planetary systems and better understand the cosmic processes that create worlds like our own.</p>",
      "tweet_hook": {
        "hook": "Giant planets get their weird atmospheric chemistry from where they form, not how much dust was in their birth disk",
        "claim": "Planet formation location determines atmospheric composition even when pebbles drift and evaporate",
        "evidence": "Only dust-to-gas ratio significantly affects atmospheric abundances; other disc parameters have limited impact",
        "question": "Could JWST atmospheric surveys map out the original formation zones of migrated hot Jupiters?"
      },
      "figure_url": "https://arxiv.org/html/2601.10285v1/Plots/growth_ratios_ufrag.png"
    },
    {
      "id": "2601.11469v1",
      "title": "KMT-2025-BLG-1616Lb: First Microlensing Bound Planet From DREAMS",
      "abstract": "We present observations and analysis of the bound planetary microlensing event KMT-2025-BLG-1616. The planetary signal was captured by the Korea Microlensing Telescope Network (KMTNet) and the DECam Rogue Earths and Mars Survey (DREAMS). DREAMS's minute-cadence observations break the central/resonant degeneracy in the binary-lens models. The color of the faint source star ($I=22$) is measured from the DREAMS's $r - z$ color. The planetary system has a planet-host mass ratio of $q \\sim 5 \\times 10^{-4}$. A Bayesian analysis yields a host-star mass of $\\sim 0.3\\,M_\\odot$, a planetary mass of $\\sim 40\\,M_{\\oplus}$, a projected planet-host separation of $\\sim 1.6~\\mathrm{au}$, and a lens distance of $\\sim 7.5~\\mathrm{kpc}$. Based on the photometric precision achieved by DREAMS for this event, we simulate free-floating planet (FFP) detections and find that DREAMS is sensitive to Mars-mass FFPs in the Galactic bulge and Moon-mass FFPs in the Galactic disk.",
      "authors": [
        "Hongjing Yang",
        "Weicheng Zang",
        "Yoon-Hyun Ryu",
        "Takahiro Sumi",
        "Jiyuan Zhang",
        "Hongyu Li",
        "Cheongho Han",
        "Yuchen Tang",
        "Qiyue Qian",
        "Zhixing Li",
        "Yuxin Shang",
        "Xikai Shan",
        "Shude Mao",
        "Guillermo Damke",
        "Alfredo Zenteno",
        "Steve Heathcote",
        "Konstantina Boutsia",
        "Przemek Mróz",
        "Xiurui Zhao",
        "Matthew Penny",
        "Sean Terry",
        "Patrick Tamburo",
        "Timothy Cunningham",
        "Quanzhi Ye",
        "Eric W. Peng",
        "Rachel Street",
        "Katarzyna Kruszyńska",
        "Etienne Bachelet",
        "Yiannis Tsapras",
        "Markus Hundertmark",
        "Michael D. Albrow",
        "Sun-Ju Chung",
        "Andrew Gould",
        "Kyu-Ha Hwang",
        "Youn Kil Jung",
        "In-Gu Shin",
        "Yossi Shvartzvald",
        "Jennifer C. Yee",
        "Dong-Jin Kim",
        "Chung-Uk Lee",
        "Byeong-Gon Park",
        "David P. Bennett",
        "Ian A. Bond",
        "Giuseppe Cataldo",
        "Ryusei Hamada",
        "Yuki Hirao",
        "Asahi Idei",
        "Shuma Makida",
        "Shota Miyazaki",
        "Tutumi Nagai",
        "Togo Nagano",
        "Seiya Nakayama",
        "Mayu Nishio",
        "Kansuke Nunota",
        "Ryo Ogawa",
        "Ryunosuke Oishi",
        "Yui Okumoto",
        "Nicholas J. Rattenbury",
        "Yuki K. Satoh",
        "Daisuke Suzuki",
        "Motohide Tamura",
        "Takuto Tamaoki",
        "Hibiki Yama"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "published": "2026-01-16T17:56:01Z",
      "updated": "2026-01-16T17:56:01Z",
      "pdf_link": "https://arxiv.org/pdf/2601.11469v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.11469v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\nScientists have discovered a new planet using gravitational microlensing—a technique that detects planets by observing how their gravity bends light from distant stars. This marks the first successful planetary detection by the DREAMS survey, demonstrating that we can now find much smaller \"rogue\" planets floating freely through space, potentially down to the mass of our Moon.\n\n**What They Did**\nResearchers used two telescope networks—the Korea Microlensing Telescope Network (KMTNet) and the DECam Rogue Earths and Mars Survey (DREAMS)—to monitor a microlensing event where a star's light was magnified by an intervening planetary system. DREAMS took extremely frequent observations (every minute) to capture precise details of how the light changed over time, allowing scientists to break through mathematical ambiguities that usually plague these measurements.\n\n**Key Findings**\nThe newly discovered planet, designated KMT-2025-BLG-1616Lb, orbits a small red dwarf star about 7,500 light-years away in our galaxy. The planet weighs roughly 40 times more than Earth (similar to Neptune) and orbits its host star at about 1.6 times the Earth-Sun distance. The host star itself is quite small, containing only about 30% of our Sun's mass. Most excitingly, the study shows that DREAMS can detect free-floating planets as small as Mars in the central bulge of our galaxy and even Moon-sized worlds in our local galactic neighborhood.\n\n**Looking Forward**\nThis discovery proves that minute-by-minute monitoring can dramatically improve our ability to characterize distant planetary systems through microlensing. The demonstrated sensitivity to incredibly small rogue planets opens up an entirely new frontier for discovering the countless worlds that may be drifting freely through interstellar space, untethered to any star.",
      "summary_html": "<h4>Why It Matters</h4>\nScientists have discovered a new planet using gravitational microlensing—a technique that detects planets by observing how their gravity bends light from distant stars. This marks the first successful planetary detection by the DREAMS survey, demonstrating that we can now find much smaller \"rogue\" planets floating freely through space, potentially down to the mass of our Moon.\n<h4>What They Did</h4>\nResearchers used two telescope networks—the Korea Microlensing Telescope Network (KMTNet) and the DECam Rogue Earths and Mars Survey (DREAMS)—to monitor a microlensing event where a star's light was magnified by an intervening planetary system. DREAMS took extremely frequent observations (every minute) to capture precise details of how the light changed over time, allowing scientists to break through mathematical ambiguities that usually plague these measurements.\n<h4>Key Findings</h4>\nThe newly discovered planet, designated KMT-2025-BLG-1616Lb, orbits a small red dwarf star about 7,500 light-years away in our galaxy. The planet weighs roughly 40 times more than Earth (similar to Neptune) and orbits its host star at about 1.6 times the Earth-Sun distance. The host star itself is quite small, containing only about 30% of our Sun's mass. Most excitingly, the study shows that DREAMS can detect free-floating planets as small as Mars in the central bulge of our galaxy and even Moon-sized worlds in our local galactic neighborhood.\n<h4>Looking Forward</h4>\nThis discovery proves that minute-by-minute monitoring can dramatically improve our ability to characterize distant planetary systems through microlensing. The demonstrated sensitivity to incredibly small rogue planets opens up an entirely new frontier for discovering the countless worlds that may be drifting freely through interstellar space, untethered to any star.",
      "tweet_hook": {
        "hook": "DREAMS telescope just detected its first bound exoplanet using microlensing",
        "claim": "Minute-cadence observations break degeneracies that plagued previous planetary microlensing detections",
        "evidence": "40 Earth-mass planet found orbiting 0.3 solar-mass star 7,500 light-years away",
        "question": "Could this technique revolutionize how we find distant exoplanets?"
      },
      "figure_url": "https://arxiv.org/html/2601.11469v1/x1.png"
    },
    {
      "id": "2601.11313v1",
      "title": "Aligned, Misaligned and Polar Orbits of Hot Jupiters: Measuring Spin-Orbit Angles via Doppler Tomography with HARPS-N",
      "abstract": "Although the migration of hot Jupiters is not yet fully understood, measurements of the projected spin-orbit angle λ help shed light on the processes involved. Here we present Doppler tomography of three known hot Jupiters to determine their λ orientation: HAT-P-49 b, HAT-P-57A b, and XO-3A b. Our analysis explores the impact of cross-correlation processing methods on the detectability and characterization of the planet's Doppler shadow using up to three independent routines for cross-correlation functions extraction; those being: Yabi, iSpec and IRAF. After accounting for differences among the results obtained with the various routines, we report: first, the HAT-P-49 system is a case of a hot Jupiter on a polar orbit with λ=-85.3{\\pm}1.7°, second, HAT-P-57A indicates practically no deviation of the planet's projected orbit from the host's equatorial plane with λ=-0.4^{+1.4}_{-1.9}°, and third, the XO-3A system with the measured value of λ=38{+3}_{-4}° lies in between an aligned and a perpendicular orientation, which is a less populated region of the spin-orbit distribution. Our findings highlight both the diversity of spin-orbit angles among close-in giant planets and the potential discrepancies in their measurement that can arise from different approaches to constructing the cross-correlation functions.",
      "authors": [
        "Z. Balkóová",
        "J. Žák",
        "M. Skarka",
        "E. Knudstrup",
        "P. Gajdoš",
        "A. Bignamini",
        "P. Kabáth"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-16T14:10:19Z",
      "updated": "2026-01-16T14:10:19Z",
      "pdf_link": "https://arxiv.org/pdf/2601.11313v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.11313v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\nHot Jupiters—massive planets orbiting extremely close to their stars—shouldn't exist where we find them based on our understanding of planetary formation, so scientists study how these worlds ended up in such extreme locations. By measuring whether a planet's orbit is aligned with its star's rotation or tilted at odd angles, astronomers can piece together the violent or gentle processes that moved these giants from where they formed to their current scorching positions.\n\n**What They Did**\nThe researchers used a technique called Doppler tomography, which tracks tiny changes in starlight as a planet passes in front of its host star, creating a \"shadow\" in the star's spectrum that reveals the angle between the planet's orbit and the star's spin. They studied three known hot Jupiter systems using the HARPS-N spectrograph and tested three different data analysis methods to ensure their measurements were reliable and to understand how different approaches might affect results.\n\n**Key Findings**\nThe team discovered remarkably diverse orbital arrangements among the three planets they studied. HAT-P-49b travels on a polar orbit, essentially circling its star from pole to pole rather than around the equator—a highly unusual configuration. HAT-P-57Ab follows a perfectly aligned orbit, matching its star's equatorial plane exactly as theories of gentle migration would predict. XO-3Ab occupies a middle ground with a moderately tilted orbit, representing a less common arrangement that falls between the typical aligned and misaligned categories. The study also revealed that different data analysis methods can produce varying results, highlighting the importance of using multiple approaches.\n\n**Looking Forward**\nThese findings add crucial data points to the growing catalog of spin-orbit measurements, helping astronomers understand the full range of migration mechanisms that shuffle planets around their systems. The research also demonstrates the need for standardized analysis techniques to ensure consistent and reliable measurements as astronomers continue mapping the complex evolutionary histories of planetary systems.",
      "summary_html": "<h4>Why It Matters</h4>\nHot Jupiters—massive planets orbiting extremely close to their stars—shouldn't exist where we find them based on our understanding of planetary formation, so scientists study how these worlds ended up in such extreme locations. By measuring whether a planet's orbit is aligned with its star's rotation or tilted at odd angles, astronomers can piece together the violent or gentle processes that moved these giants from where they formed to their current scorching positions.\n<h4>What They Did</h4>\nThe researchers used a technique called Doppler tomography, which tracks tiny changes in starlight as a planet passes in front of its host star, creating a \"shadow\" in the star's spectrum that reveals the angle between the planet's orbit and the star's spin. They studied three known hot Jupiter systems using the HARPS-N spectrograph and tested three different data analysis methods to ensure their measurements were reliable and to understand how different approaches might affect results.\n<h4>Key Findings</h4>\nThe team discovered remarkably diverse orbital arrangements among the three planets they studied. HAT-P-49b travels on a polar orbit, essentially circling its star from pole to pole rather than around the equator—a highly unusual configuration. HAT-P-57Ab follows a perfectly aligned orbit, matching its star's equatorial plane exactly as theories of gentle migration would predict. XO-3Ab occupies a middle ground with a moderately tilted orbit, representing a less common arrangement that falls between the typical aligned and misaligned categories. The study also revealed that different data analysis methods can produce varying results, highlighting the importance of using multiple approaches.\n<h4>Looking Forward</h4>\nThese findings add crucial data points to the growing catalog of spin-orbit measurements, helping astronomers understand the full range of migration mechanisms that shuffle planets around their systems. The research also demonstrates the need for standardized analysis techniques to ensure consistent and reliable measurements as astronomers continue mapping the complex evolutionary histories of planetary systems.",
      "tweet_hook": {
        "hook": "Hot Jupiters orbit their stars in surprisingly diverse ways 🪐",
        "claim": "New measurements reveal polar, aligned, and misaligned orbits using advanced Doppler tomography",
        "evidence": "Found polar orbit (-85.3°), perfect alignment (-0.4°), and intermediate misalignment (38°)",
        "question": "What drives such dramatic orbital diversity in exoplanets?"
      },
      "figure_url": "https://arxiv.org/html/2601.11313v1/shadow_YABI_HAT-P-49.png"
    },
    {
      "id": "2601.10811v1",
      "title": "The impact of disc photoevaporation on the long-term evolution of giant planets in mean motion resonances",
      "abstract": "We investigate the long-term impact of disc photoevaporation on the dynamical stability and evolution of giant planet pairs in mean motion resonances. Using two-dimensional hydrodynamical simulations with FARGO3D, in which we have included mass-loss due to photoevaporation, we explore a parameter space covering disc mass, viscosity, planet mass, and resonance type. We find that strong photoevaporation depletes gas in the common gap between the planets, slowing migration and suppressing planet-disc interactions that typically lead to resonance breaking and eccentricity damping. This stabilising effect is most significant for 3:2 resonances, which are more prone to disruption due to the reduced planet spacing. In contrast, 2:1 resonances are generally more robust but can still be destabilised at high disc mass and moderate-to-strong photoevaporation due to asymmetric torques. Photoevaporation can therefore stabilise resonances that would otherwise break, or conversely disrupt resonances that are natively more stable. Even in cases where photoevaporation does not directly affect resonance stability, it typically results in increased planetary eccentricities. These results highlight the complex, system-dependent nature of resonance evolution, with implications for the final orbital architectures of giant planet systems and their detectability via astrometry from missions such as Gaia.",
      "authors": [
        "Emmanuel J. Greenfield",
        "James E. Owen"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T19:21:40Z",
      "updated": "2026-01-15T19:21:40Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10811v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10811v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\nUnderstanding how giant planets end up in their final orbits is crucial for explaining the diverse planetary systems we observe today. This research reveals how the evaporation of planet-forming disks by stellar radiation can dramatically alter the fate of planet pairs, potentially explaining why some systems have stable resonant orbits while others don't.\n\n**What They Did**\nThe researchers used advanced computer simulations to model how pairs of giant planets behave when their surrounding gas disk gradually evaporates due to radiation from their host star. They tested various scenarios by changing factors like disk mass, planet mass, and the specific orbital resonance (mathematical relationships where planets complete orbits in simple ratios like 2:1 or 3:2).\n\n**Key Findings**\nThe study found that disk evaporation has opposing effects depending on the situation: it can either stabilize planet pairs that would normally drift apart, or destabilize pairs that should remain locked together. When gas between the planets gets stripped away, it reduces the gravitational interactions that normally cause orbital relationships to break down, particularly benefiting the more fragile 3:2 resonances. However, the same process can sometimes create uneven forces that push apart the more stable 2:1 resonances. Regardless of stability effects, disk evaporation consistently makes planetary orbits more stretched and elliptical.\n\n**Looking Forward**\nThese findings suggest that the final arrangement of giant planet systems depends heavily on the complex interplay between disk properties and stellar radiation, making each system's evolution highly unique. This research will help astronomers better interpret observations from space missions like Gaia and predict which types of planetary systems are most likely to be detected.",
      "summary_html": "<h4>Why It Matters</h4>\nUnderstanding how giant planets end up in their final orbits is crucial for explaining the diverse planetary systems we observe today. This research reveals how the evaporation of planet-forming disks by stellar radiation can dramatically alter the fate of planet pairs, potentially explaining why some systems have stable resonant orbits while others don't.\n<h4>What They Did</h4>\nThe researchers used advanced computer simulations to model how pairs of giant planets behave when their surrounding gas disk gradually evaporates due to radiation from their host star. They tested various scenarios by changing factors like disk mass, planet mass, and the specific orbital resonance (mathematical relationships where planets complete orbits in simple ratios like 2:1 or 3:2).\n<h4>Key Findings</h4>\nThe study found that disk evaporation has opposing effects depending on the situation: it can either stabilize planet pairs that would normally drift apart, or destabilize pairs that should remain locked together. When gas between the planets gets stripped away, it reduces the gravitational interactions that normally cause orbital relationships to break down, particularly benefiting the more fragile 3:2 resonances. However, the same process can sometimes create uneven forces that push apart the more stable 2:1 resonances. Regardless of stability effects, disk evaporation consistently makes planetary orbits more stretched and elliptical.\n<h4>Looking Forward</h4>\nThese findings suggest that the final arrangement of giant planet systems depends heavily on the complex interplay between disk properties and stellar radiation, making each system's evolution highly unique. This research will help astronomers better interpret observations from space missions like Gaia and predict which types of planetary systems are most likely to be detected.",
      "tweet_hook": {
        "hook": "Stellar winds can make or break planetary orbits in surprising ways",
        "claim": "Photoevaporation fundamentally alters how giant planets maintain orbital resonances during disk evolution",
        "evidence": "3:2 resonances stabilize while 2:1 resonances can destabilize under strong photoevaporation",
        "question": "How might this reshape our understanding of exoplanet architectures?"
      },
      "figure_url": "https://arxiv.org/html/2601.10811v1/x1.png"
    },
    {
      "id": "2601.10794v1",
      "title": "Metal Pipe: A Broadly-Applicable Stellar Abundance Pipeline Using Isochronal Parameters",
      "abstract": "Characterizing exoplanet host stars at a population level requires a method of homogeneously characterizing stellar properties across all spectral types. To this end, we have developed Metal Pipe, a new code for determining stellar parameters and abundances, which is designed for use across a wider range of spectral types than many commonly used codes. It combines the widely-used package MOOG with photometric stellar parameters, a user-supplied high-resolution spectrum, and a newly curated list of spectral lines. Metal Pipe outputs values for $T_{\\rm{eff}}$, $\\log{(g)}$, $M_*$, $R_*$, and $L_*$ from isochrones, and abundances of C, O, Na, Mg, Al, Si, S, Ca, Ti, and Fe from MOOG. In this paper, we describe the Metal Pipe algorithm and tests of Metal Pipe against previous abundance measurements on archival HIRES spectra of 503 F, G, and K type stars. We find RMS scatters of ~100 K in $T_{\\rm{eff}}$, ~0.10 dex in $\\log{(g)}$, and ~0.10 dex for all measured abundances. These values are comparable to estimated measurement uncertainties, verifying Metal Pipe for continued use in building a detailed abundance catalog. Future papers in this series will test Metal Pipe's applicability to late K and M dwarf stars, and provide other improvements.",
      "authors": [
        "Jared R. Kolecki",
        "Lauren M. Weiss"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-15T19:00:20Z",
      "updated": "2026-01-15T19:00:20Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10794v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10794v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\nUnderstanding the chemical makeup of stars that host planets is crucial for learning how planetary systems form and evolve. However, current tools for measuring stellar compositions work well only for certain types of stars, limiting our ability to study the full diversity of planetary systems across the galaxy.\n\n**What They Did**\nResearchers developed \"Metal Pipe,\" a new computer program that can determine the chemical abundances and physical properties of a much wider variety of stars than existing tools. The program combines stellar brightness measurements with detailed spectra (the rainbow of light from stars) and uses a carefully selected list of spectral features to measure the amounts of 10 different chemical elements.\n\n**Key Findings**\nWhen tested on 503 sun-like stars, Metal Pipe successfully measured stellar temperatures, surface gravity, mass, radius, and brightness with high precision. The program accurately determined the abundances of essential elements including carbon, oxygen, sodium, magnesium, aluminum, silicon, sulfur, calcium, titanium, and iron. The measurements were consistent with previous studies, with typical uncertainties of about 100 degrees Kelvin for temperature and small fractional errors for chemical abundances. These precision levels match the estimated measurement limits, confirming the tool works as intended.\n\n**Looking Forward**\nMetal Pipe will enable astronomers to create comprehensive chemical catalogs of planet-hosting stars across different stellar types, providing insights into how stellar composition influences planet formation. The researchers plan to extend the program's capabilities to cooler, smaller stars and continue refining the tool, potentially revolutionizing our understanding of the relationship between stellar chemistry and planetary system architecture.",
      "summary_html": "<h4>Why It Matters</h4>\nUnderstanding the chemical makeup of stars that host planets is crucial for learning how planetary systems form and evolve. However, current tools for measuring stellar compositions work well only for certain types of stars, limiting our ability to study the full diversity of planetary systems across the galaxy.\n<h4>What They Did</h4>\nResearchers developed \"Metal Pipe,\" a new computer program that can determine the chemical abundances and physical properties of a much wider variety of stars than existing tools. The program combines stellar brightness measurements with detailed spectra (the rainbow of light from stars) and uses a carefully selected list of spectral features to measure the amounts of 10 different chemical elements.\n<h4>Key Findings</h4>\nWhen tested on 503 sun-like stars, Metal Pipe successfully measured stellar temperatures, surface gravity, mass, radius, and brightness with high precision. The program accurately determined the abundances of essential elements including carbon, oxygen, sodium, magnesium, aluminum, silicon, sulfur, calcium, titanium, and iron. The measurements were consistent with previous studies, with typical uncertainties of about 100 degrees Kelvin for temperature and small fractional errors for chemical abundances. These precision levels match the estimated measurement limits, confirming the tool works as intended.\n<h4>Looking Forward</h4>\nMetal Pipe will enable astronomers to create comprehensive chemical catalogs of planet-hosting stars across different stellar types, providing insights into how stellar composition influences planet formation. The researchers plan to extend the program's capabilities to cooler, smaller stars and continue refining the tool, potentially revolutionizing our understanding of the relationship between stellar chemistry and planetary system architecture.",
      "tweet_hook": {
        "hook": "New stellar abundance pipeline works across ALL spectral types",
        "claim": "Metal Pipe determines stellar properties for any star type using photometry and spectra",
        "evidence": "Tested on 503 stars with ~100K temperature precision and 0.10 dex abundance accuracy",
        "question": "Could this revolutionize how we characterize exoplanet host stars?"
      },
      "figure_url": "https://arxiv.org/html/2601.10794v1/22Lines.png"
    },
    {
      "id": "2601.10598v1",
      "title": "A young progenitor for the most common planetary systems in the Galaxy",
      "abstract": "The Galaxy's most common known planetary systems have several Earth-to-Neptune-size planets in compact orbits. At small orbital separations, larger planets are less common than their smaller counterparts by an order of magnitude. The young star V1298 Tau hosts one such compact planetary system, albeit with four planets that are uncommonly large (5 to 10 Earth radii). The planets form a chain of near-resonances that result in transit-timing variations of several hours. Here we present a multi-year campaign to characterize this system with transit-timing variations, a method insensitive to the intense magnetic activity of the star. Through targeted observations, we first resolved the previously unknown orbital period of the outermost planet. The full 9-year baseline from these and archival data then enabled robust determination of the masses and orbital parameters for all four planets. We find the planets have low, sub-Neptune masses and nearly circular orbits, implying a dynamically tranquil history. Their low masses and large radii indicate that the inner planets underwent a period of rapid cooling immediately after dispersal of the protoplanetary disk. Still, they are much less dense than mature planets of comparable size. We predict the planets will contract to 1.5-4.0 Earth radii and join the population of super-Earths and sub-Neptunes that nature produces in abundance.",
      "authors": [
        "John H. Livingston",
        "Erik A. Petigura",
        "Trevor J. David",
        "Kento Masuda",
        "James Owen",
        "David Nesvorný",
        "Konstantin Batygin",
        "Jerome de Leon",
        "Mayuko Mori",
        "Kai Ikuta",
        "Akihiko Fukui",
        "Noriharu Watanabe",
        "Jaume Orell Miquel",
        "Felipe Murgas",
        "Hannu Parviainen",
        "Judith Korth",
        "Florence Libotte",
        "Néstor Abreu García",
        "Pedro Pablo Meni Gallardo",
        "Norio Narita",
        "Enric Pallé",
        "Motohide Tamura",
        "Atsunori Yonehara",
        "Andrew Ridden-Harper",
        "Allyson Bieryla",
        "Alessandro A. Trani",
        "Eric E. Mamajek",
        "David R. Ciardi",
        "Varoujan Gorjian",
        "Lynne A. Hillenbrand",
        "Luisa M. Rebull",
        "Elisabeth R. Newton",
        "Andrew W. Mann",
        "Andrew Vanderburg",
        "Guðmundur Stefánsson",
        "Suvrath Mahadevan",
        "Caleb Cañas",
        "Joe Ninan",
        "Jesus Higuera",
        "Kamen Todorov",
        "Jean-Michel Désert",
        "Lorenzo Pino"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T17:07:23Z",
      "updated": "2026-01-15T17:07:23Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10598v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10598v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\n\nMost planetary systems in our galaxy look nothing like our own solar system. While we have small, rocky planets close to the Sun and gas giants farther out, the most common arrangement elsewhere features several medium-sized planets packed tightly around their star. Understanding how these systems form and evolve helps us grasp how planetary systems—including potentially habitable ones—come to be. This research gives us a rare glimpse at what these common systems look like in their youth, before billions of years of evolution shape their final form.\n\n**What They Did**\n\nThe researchers studied a young star called V1298 Tau, which hosts four unusually puffy planets. Because this star is extremely active—constantly flaring and changing brightness—traditional methods of studying planets wouldn't work. Instead, they used a clever technique called transit timing variations. Imagine planets as runners on a track, each in their own lane but gravitationally tugging on each other as they pass by. These tiny tugs cause the planets to arrive at their \"finish line\" (crossing in front of their star) slightly early or late. By precisely timing these transits over nine years, the team could weigh each planet and map their orbits without interference from the star's chaotic behavior.\n\n**Key Findings**\n\nThe four planets are surprisingly light for their size—each about 5 to 10 times wider than Earth but with masses closer to Neptune than Jupiter. They're essentially cosmic balloons, puffed up with thick atmospheres. The planets orbit in nearly perfect circles and maintain a delicate gravitational dance, suggesting their system formed peacefully without major collisions or disruptions. Most importantly, the researchers discovered these bloated worlds are rapidly shrinking as they cool down from their formation.\n\n**Looking Forward**\n\nThis discovery provides a missing piece of the planetary evolution puzzle. The team predicts these puffy planets will eventually shrink to become the compact, medium-sized worlds that dominate our galaxy. By watching this transformation in real-time, astronomers can better understand how the universe's most common planetary systems reach their mature state—and whether any might harbor conditions suitable for life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Most planetary systems in our galaxy look nothing like our own solar system. While we have small, rocky planets close to the Sun and gas giants farther out, the most common arrangement elsewhere features several medium-sized planets packed tightly around their star. Understanding how these systems form and evolve helps us grasp how planetary systems—including potentially habitable ones—come to be. This research gives us a rare glimpse at what these common systems look like in their youth, before billions of years of evolution shape their final form.</p>\n<h4>What They Did</h4>\n<p>The researchers studied a young star called V1298 Tau, which hosts four unusually puffy planets. Because this star is extremely active—constantly flaring and changing brightness—traditional methods of studying planets wouldn't work. Instead, they used a clever technique called transit timing variations. Imagine planets as runners on a track, each in their own lane but gravitationally tugging on each other as they pass by. These tiny tugs cause the planets to arrive at their \"finish line\" (crossing in front of their star) slightly early or late. By precisely timing these transits over nine years, the team could weigh each planet and map their orbits without interference from the star's chaotic behavior.</p>\n<h4>Key Findings</h4>\n<p>The four planets are surprisingly light for their size—each about 5 to 10 times wider than Earth but with masses closer to Neptune than Jupiter. They're essentially cosmic balloons, puffed up with thick atmospheres. The planets orbit in nearly perfect circles and maintain a delicate gravitational dance, suggesting their system formed peacefully without major collisions or disruptions. Most importantly, the researchers discovered these bloated worlds are rapidly shrinking as they cool down from their formation.</p>\n<h4>Looking Forward</h4>\n<p>This discovery provides a missing piece of the planetary evolution puzzle. The team predicts these puffy planets will eventually shrink to become the compact, medium-sized worlds that dominate our galaxy. By watching this transformation in real-time, astronomers can better understand how the universe's most common planetary systems reach their mature state—and whether any might harbor conditions suitable for life.</p>",
      "tweet_hook": {
        "hook": "These puffy young planets will shrink to become the Galaxy's most common planetary type",
        "claim": "First mass measurements show how super-Earths and sub-Neptunes form from inflated precursors",
        "evidence": "V1298 Tau's planets are 5-10 Earth radii now but will contract to just 1.5-4.0 Earth radii",
        "question": "Why does nature produce compact multi-planet systems so abundantly?"
      },
      "figure_url": "https://arxiv.org/html/2601.10598v1/x1.png"
    },
    {
      "id": "2601.10585v1",
      "title": "Canceling Effects of Conjunctions Render Higher Order Mean Motion Resonances Weak",
      "abstract": "Mean motion resonances (MMRs) are a key phenomenon in orbital dynamics. The traditional disturbing function expansion in celestial mechanics shows that, at low eccentricities, $p$:$p-q$ MMRs exhibit a clear hierarchy of strengths, scaling as $e^q$, where $q$ is the order of the resonance. This explains why first-order MMRs (e.g., 3:2 and 4:3) are important, while the infinite number of higher order integer ratios are not. However, this relationship derived from a technical perturbation series expansion provides little physical intuition. In this paper, we provide a simple physical explanation of this result for closely spaced orbits. In this limit, interplanetary interactions are negligible except during close encounters at conjunction, where the planets impart a gravitational \"kick\" to each other's mean motion. We show that while first-order MMRs involve a single conjunction before the configuration repeats, higher order MMRs involve multiple conjunctions per cycle, whose effects cancel out more precisely the higher the order of the resonance. Starting from the effects of a single conjunction, we provide an alternate, physically motivated derivation of MMRs' $e^q$ strength scaling.",
      "authors": [
        "Elizabeth K Jones",
        "Samuel Hadden",
        "Daniel Tamayo"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T16:55:40Z",
      "updated": "2026-01-15T16:55:40Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10585v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10585v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\nThis research provides a clearer physical understanding of why certain planetary orbital relationships dominate our solar system while others remain weak. Mean motion resonances—where planets' orbital periods form simple mathematical ratios—are fundamental to explaining how planetary systems form and remain stable over billions of years.\n\n**What They Did**\nInstead of relying on complex mathematical equations that have been used for centuries, the researchers developed a simpler, more intuitive approach to explain orbital resonances. They focused on what happens when planets come closest to each other (conjunctions), treating these encounters as gravitational \"kicks\" that slightly alter each planet's motion.\n\n**Key Findings**\nThe study reveals why first-order resonances (like 3:2 ratios) are much stronger than higher-order ones in shaping planetary systems. In first-order resonances, planets experience only one close encounter per cycle before their configuration repeats, creating a cumulative effect over time. Higher-order resonances involve multiple conjunctions per cycle, but these gravitational kicks tend to cancel each other out—and this cancellation becomes more precise as the resonance order increases. This elegant explanation confirms the mathematical relationship that resonance strength decreases dramatically with higher orders, following a pattern based on orbital eccentricity.\n\n**Looking Forward**\nThis physically intuitive framework could make orbital dynamics more accessible to students and researchers, potentially accelerating discoveries in planetary science. The clearer understanding of resonance mechanics may also improve our ability to predict the long-term evolution of both our solar system and newly discovered exoplanetary systems.",
      "summary_html": "<h4>Why It Matters</h4>\nThis research provides a clearer physical understanding of why certain planetary orbital relationships dominate our solar system while others remain weak. Mean motion resonances—where planets' orbital periods form simple mathematical ratios—are fundamental to explaining how planetary systems form and remain stable over billions of years.\n<h4>What They Did</h4>\nInstead of relying on complex mathematical equations that have been used for centuries, the researchers developed a simpler, more intuitive approach to explain orbital resonances. They focused on what happens when planets come closest to each other (conjunctions), treating these encounters as gravitational \"kicks\" that slightly alter each planet's motion.\n<h4>Key Findings</h4>\nThe study reveals why first-order resonances (like 3:2 ratios) are much stronger than higher-order ones in shaping planetary systems. In first-order resonances, planets experience only one close encounter per cycle before their configuration repeats, creating a cumulative effect over time. Higher-order resonances involve multiple conjunctions per cycle, but these gravitational kicks tend to cancel each other out—and this cancellation becomes more precise as the resonance order increases. This elegant explanation confirms the mathematical relationship that resonance strength decreases dramatically with higher orders, following a pattern based on orbital eccentricity.\n<h4>Looking Forward</h4>\nThis physically intuitive framework could make orbital dynamics more accessible to students and researchers, potentially accelerating discoveries in planetary science. The clearer understanding of resonance mechanics may also improve our ability to predict the long-term evolution of both our solar system and newly discovered exoplanetary systems.",
      "tweet_hook": {
        "hook": "🪐 Why are only some planetary resonances astronomically important?",
        "claim": "New physical explanation reveals why higher-order orbital resonances are systematically weaker",
        "evidence": "Multiple conjunctions in high-order resonances cancel each other out more precisely",
        "question": "What other celestial mechanics mysteries need intuitive explanations?"
      },
      "figure_url": "https://arxiv.org/html/2601.10585v1/x1.png"
    },
    {
      "id": "2601.09835v1",
      "title": "A Robust Launching Mechanism for Freely-Floating Planets from Host Stars with Close-in Planets",
      "abstract": "Secular perturbations from binary stars and distant massive planets can drive cold planets onto nearly parabolic orbits with pericenter passages extremely close to their host stars. Meanwhile, short-period super-Earths are frequently observed around nearby stars. Gravitational scattering between these two distinct populations can lead to substantial orbital energy exchange, liberating some intruders from the gravitational confinement of their host systems. This process offers a robust formation channel for a subset of the abundant freely floating planet population. It may also significantly perturb the original orbits of close-in planets, induce collisional trajectories between close-in planets and their host stars, and disrupt the dynamical evolution of cold planets toward close stellar encounters.",
      "authors": [
        "Xiaochen Zheng",
        "Zhuoya Cao",
        "Shigeru Ida",
        "Douglas N. C. Lin",
        "Shude Mao"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T19:49:45Z",
      "updated": "2026-01-14T19:49:45Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09835v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09835v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "# Cosmic Billiards: How Planets Get Kicked Out of Their Solar Systems\n\n**Why It Matters**\n\nImagine entire planets—some potentially Earth-like—wandering alone through the darkness of space, untethered to any star. These \"rogue planets\" have fascinated astronomers for years, and we now know there could be billions of them drifting through our galaxy. But how do planets get ejected from their home solar systems in the first place? This research tackles that mystery and reveals a surprisingly common cosmic process that reshapes planetary systems throughout the universe. Understanding how planets get displaced helps us grasp how rare or common stable, life-friendly solar systems like ours might be—a question central to our search for life beyond Earth.\n\n**What They Did**\n\nThe researchers used computer simulations to model a cosmic game of billiards happening in distant solar systems. They focused on systems with two key ingredients: planets orbiting very close to their stars (closer than Mercury orbits our Sun) and distant, massive planets that occasionally get nudged toward the inner solar system by gravitational influences from companion stars or other distant planets. Think of it like a bowling ball rolling down a lane toward tightly clustered pins. When these distant intruder planets swing close to their star, they can gravitationally scatter the close-in planets, sometimes with enough force to fling them completely out of the solar system.\n\n**Key Findings**\n\nThe team discovered that this planetary billiards process is remarkably efficient at creating rogue planets. When a massive intruder planet swoops through the inner regions of a solar system, it can transfer enough gravitational energy to permanently eject smaller planets from their orbits. The process doesn't just create wandering planets—it also disrupts entire planetary systems, potentially sending some planets crashing into their host stars while dramatically altering the orbits of survivors.\n\n**Looking Forward**\n\nThis research provides a compelling explanation for the abundance of free-floating planets that upcoming space telescopes are expected to discover. It also suggests that planetary systems might be far more dynamic and unstable than previously thought, with major reshuffling events occurring throughout their lifetimes. Future observations of rogue planets and disrupted solar systems could help astronomers test these predictions and better understand how common stable, potentially habitable worlds really are.",
      "summary_html": "<p># Cosmic Billiards: How Planets Get Kicked Out of Their Solar Systems</p>\n<h4>Why It Matters</h4>\n<p>Imagine entire planets—some potentially Earth-like—wandering alone through the darkness of space, untethered to any star. These \"rogue planets\" have fascinated astronomers for years, and we now know there could be billions of them drifting through our galaxy. But how do planets get ejected from their home solar systems in the first place? This research tackles that mystery and reveals a surprisingly common cosmic process that reshapes planetary systems throughout the universe. Understanding how planets get displaced helps us grasp how rare or common stable, life-friendly solar systems like ours might be—a question central to our search for life beyond Earth.</p>\n<h4>What They Did</h4>\n<p>The researchers used computer simulations to model a cosmic game of billiards happening in distant solar systems. They focused on systems with two key ingredients: planets orbiting very close to their stars (closer than Mercury orbits our Sun) and distant, massive planets that occasionally get nudged toward the inner solar system by gravitational influences from companion stars or other distant planets. Think of it like a bowling ball rolling down a lane toward tightly clustered pins. When these distant intruder planets swing close to their star, they can gravitationally scatter the close-in planets, sometimes with enough force to fling them completely out of the solar system.</p>\n<h4>Key Findings</h4>\n<p>The team discovered that this planetary billiards process is remarkably efficient at creating rogue planets. When a massive intruder planet swoops through the inner regions of a solar system, it can transfer enough gravitational energy to permanently eject smaller planets from their orbits. The process doesn't just create wandering planets—it also disrupts entire planetary systems, potentially sending some planets crashing into their host stars while dramatically altering the orbits of survivors.</p>\n<h4>Looking Forward</h4>\n<p>This research provides a compelling explanation for the abundance of free-floating planets that upcoming space telescopes are expected to discover. It also suggests that planetary systems might be far more dynamic and unstable than previously thought, with major reshuffling events occurring throughout their lifetimes. Future observations of rogue planets and disrupted solar systems could help astronomers test these predictions and better understand how common stable, potentially habitable worlds really are.</p>",
      "tweet_hook": {
        "hook": "Planets can get ejected into interstellar space when cold worlds dive close to their stars and slam into hot super-Earths",
        "claim": "Gravitational scattering between these populations creates freely floating planets robustly",
        "evidence": "Method: Secular perturbations drive cold planets onto parabolic orbits with extreme stellar pericenters",
        "question": "How many rogue planets in our galaxy formed this way versus in stellar nurseries?"
      },
      "figure_url": "https://arxiv.org/html/2601.09835v1/scenario.png"
    },
    {
      "id": "2601.09401v1",
      "title": "True Masses using RV data with Hipparcos and Gaia Astrometry",
      "abstract": "Long-period companions are detected and characterized thanks to long-baseline radial velocity surveys. Combining Doppler time-series with astrometry, and in particular with proper motion anomalies technique, it is possible to put strong constraints on their orbital inclination and true mass. This work aims to present a model that combines Hipparcos and Gaia astrometric data with radial velocity measurements to constrain the orbital inclinations and true masses of long-period companions. Additionally, we re-analyse a small sample of targets that have not yet been studied using this combined approach. This research leverages the simultaneous modelling of proper motion anomalies and radial velocities, in conjunction with an analysis of the sensitivity curve. This approach serves not only as a verification of the parameters but also as a means to acquire valuable insights into planetary systems. The new analyses reveal that some of the targets classified as brown dwarfs or small-mass stars have a planetary nature. HD 5388 b and HD 6718 b are likely planets. HD 141937 b is likely a planet, but the current dataset does not allow us to firmly constrain its true mass. HD 16760 b belongs to the brown dwarf regime and it has a probable second companion. 30 Ari B b falls within the stellar regime, but the presence of an additional stellar companion could compromise the reliability of the final results. For HD 148427 b, HD 96127 b and HIP 65891 b we determined a range for the orbital inclinations.",
      "authors": [
        "G. Piccinini",
        "A. Petralia",
        "A. Sozzetti",
        "S. Benatti",
        "D. Gandolfi",
        "G. Micela"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T11:44:26Z",
      "updated": "2026-01-14T11:44:26Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09401v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09401v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\n\nImagine trying to weigh an invisible bowling ball by watching how it makes a rope swing when tied to the other end. That's essentially the challenge astronomers face when studying distant planets orbiting other stars. For decades, we've been finding these \"exoplanets\" by detecting their gravitational tugs on their host stars, but determining their actual masses—a crucial detail for understanding what they're made of and whether they could support life—has remained frustratingly difficult. This research tackles that fundamental problem, helping us distinguish between true planets, failed stars called brown dwarfs, and small stellar companions. Getting these classifications right is essential for understanding how planetary systems form and for identifying worlds that might be habitable.\n\n**What They Did**\n\nThe researchers combined two powerful detective techniques to solve the mass mystery. First, they used radial velocity measurements—essentially watching stars wobble back and forth as unseen companions orbit them, like watching a parent spin around while holding a child's hands. Second, they analyzed tiny changes in how stars move across the sky over decades, comparing ultra-precise measurements from two space missions: Hipparcos (launched in 1989) and Gaia (launched in 2013). By combining these complementary approaches, they could determine not just that something was orbiting these stars, but also the angle at which we're viewing the orbit—the key missing piece needed to calculate true masses rather than just minimum estimates.\n\n**Key Findings**\n\nThe team re-examined eight mysterious objects and discovered that some previously misclassified companions are actually planets in disguise. Two objects around stars HD 5388 and HD 6718 turned out to be planets rather than brown dwarfs. Another companion around HD 141937 likely falls into the planetary category, though more data is needed for certainty. However, HD 16760's companion confirmed its status as a brown dwarf—a \"failed star\" too small to sustain nuclear fusion—and revealed hints of a second hidden companion in the system.\n\n**Looking Forward**\n\nThis work demonstrates how combining different observational techniques can revolutionize our understanding of distant worlds. As Gaia continues collecting data and future space missions provide even more precise measurements, we'll be able to determine true masses for thousands of exoplanets. This will help astronomers better understand how planetary systems form and evolve, and more accurately identify Earth-like worlds that might harbor life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to weigh an invisible bowling ball by watching how it makes a rope swing when tied to the other end. That's essentially the challenge astronomers face when studying distant planets orbiting other stars. For decades, we've been finding these \"exoplanets\" by detecting their gravitational tugs on their host stars, but determining their actual masses—a crucial detail for understanding what they're made of and whether they could support life—has remained frustratingly difficult. This research tackles that fundamental problem, helping us distinguish between true planets, failed stars called brown dwarfs, and small stellar companions. Getting these classifications right is essential for understanding how planetary systems form and for identifying worlds that might be habitable.</p>\n<h4>What They Did</h4>\n<p>The researchers combined two powerful detective techniques to solve the mass mystery. First, they used radial velocity measurements—essentially watching stars wobble back and forth as unseen companions orbit them, like watching a parent spin around while holding a child's hands. Second, they analyzed tiny changes in how stars move across the sky over decades, comparing ultra-precise measurements from two space missions: Hipparcos (launched in 1989) and Gaia (launched in 2013). By combining these complementary approaches, they could determine not just that something was orbiting these stars, but also the angle at which we're viewing the orbit—the key missing piece needed to calculate true masses rather than just minimum estimates.</p>\n<h4>Key Findings</h4>\n<p>The team re-examined eight mysterious objects and discovered that some previously misclassified companions are actually planets in disguise. Two objects around stars HD 5388 and HD 6718 turned out to be planets rather than brown dwarfs. Another companion around HD 141937 likely falls into the planetary category, though more data is needed for certainty. However, HD 16760's companion confirmed its status as a brown dwarf—a \"failed star\" too small to sustain nuclear fusion—and revealed hints of a second hidden companion in the system.</p>\n<h4>Looking Forward</h4>\n<p>This work demonstrates how combining different observational techniques can revolutionize our understanding of distant worlds. As Gaia continues collecting data and future space missions provide even more precise measurements, we'll be able to determine true masses for thousands of exoplanets. This will help astronomers better understand how planetary systems form and evolve, and more accurately identify Earth-like worlds that might harbor life.</p>",
      "tweet_hook": {
        "hook": "Some \"brown dwarfs\" are actually planets - we've been measuring their masses wrong this whole time",
        "claim": "Combining Gaia+Hipparcos astrometry with RV data reveals true masses of long-period companions",
        "evidence": "Method: Proper motion anomalies + radial velocities constrain orbital inclinations and masses",
        "question": "How many other \"failed stars\" will turn out to be massive planets instead?"
      },
      "figure_url": "https://arxiv.org/html/2601.09401v1/Figures/Validation/senscurve_TOT_GJ463b_DR3.png"
    }
  ]
}