{
  "updated_at": "2026-01-19T03:20:39.414519+00:00",
  "category": "astro-ph.EP",
  "paper_count": 25,
  "papers": [
    {
      "id": "2601.08883v1",
      "title": "Habitable Worlds Observatory Living Worlds Working Group: Surface Biosignatures on Potentially Habitable Exoplanets",
      "abstract": "The Habitable Worlds Observatory (HWO) is the first NASA Astrophysics flagship mission with a key science goal of searching for signs of life on rocky habitable exoplanets beyond our solar system. The Living Worlds Community Working Group was charged with investigating how HWO could characterize planets orbiting stars in the solar neighborhood, search for signs of life, and interpret potential biosignatures within a false positive and false negative framework. The Surface Biosignatures Task assessed the measurement requirements and instrument needs to detect these biosignatures under an 'Earth through time' scenario. Surface biosignatures are planetary-scale spectral features resulting from absorption and/or scattering of radiation by organisms containing photosynthetic and non-photosynthetic pigments. This secondary class of biosignature can be used to corroborate atmospheric biosignatures by providing multiple lines of evidence to aid in assessing their biogenicity. Furthermore, surface biopigments are the only way to detect more primitive forms of anoxygenic photosynthesis if oxygenic photosynthesis never evolved. Key Findings: To detect biopigments on the surface of planets under Archean, Proterozoic, and Modern atmospheric compositions (15 percent coverage, 50 percent cloud cover), an SNR of 20-40 would be needed over 500-1100 nm. However, there may be some cases in which lower SNR is required; studies are ongoing. Coronagraph requirements: (1) The detection of surface biosignatures would be greatly enhanced by having as many parallel coronagraph channels as possible across the entire wavelength range with no or minimal gaps between channels. (2) Retrieval studies revealed that restricted wavelength ranges (e.g., 0.4 - 0.7 microns), such as may be used during initial survey strategies, are not sufficient to deconvolve the biopigment features from the abiotic background.",
      "authors": [
        "Niki Parenteau",
        "Anna Grace Ulses",
        "Connor Metz",
        "Nancy Y. Kiang",
        "Ligia F. Coelho",
        "Edward Schwieterman",
        "Jonathan Grone",
        "Giulia Roccetti",
        "Svetlana Berdyugina",
        "Eleonora Alei",
        "Lucas Patty",
        "Emilie Lafleche",
        "Taro Matsuo",
        "Dawn Cardace",
        "Schuyler Borges",
        "Avi Mandel",
        "Kenneth Gordon",
        "Joshua Krissansen-Totton",
        "Giada Arney"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-12T20:34:11Z",
      "updated": "2026-01-12T20:34:11Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08883v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08883v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 18,
      "summary": "**Why It Matters**\n\nImagine looking at Earth from space and seeing the telltale green tint of our forests and grasslands. Now picture doing the same thing for planets orbiting distant stars, searching for similar signs of life. That's exactly what scientists are preparing to do with NASA's upcoming Habitable Worlds Observatory, a revolutionary space telescope designed to hunt for life beyond our solar system. This research tackles one of humanity's most profound questions: Are we alone? By studying how to detect biological \"fingerprints\" on the surfaces of distant worlds, scientists are developing the tools to potentially discover life on planets dozens of light-years away.\n\n**What They Did**\n\nThe research team investigated how to spot \"surface biosignatures\"—essentially the colorful signatures left by living organisms on a planet's surface. Think of how Earth's landmasses appear greenish from space due to photosynthetic plants, or how certain bacteria create distinctive purple or red patches in extreme environments. The scientists modeled how these biological colors would appear when viewed from incredibly far away, testing scenarios based on different periods of Earth's history—from when our planet had barely any oxygen billions of years ago to today's oxygen-rich atmosphere. They calculated exactly how sensitive future telescopes would need to be to pick up these faint biological signals while distinguishing them from non-living features like rocks and clouds.\n\n**Key Findings**\n\nThe team discovered that detecting these biological signatures requires incredibly precise measurements. The telescope would need to collect light across a broad range of wavelengths—from blue to near-infrared—with a signal strength 20 to 40 times greater than the background noise. Crucially, they found that narrow wavelength windows wouldn't work; you need the full spectrum to separate genuine biological signals from ordinary planetary features. Even if only 15% of a planet's surface showed biological activity under 50% cloud cover, the technique could still work.\n\n**Looking Forward**\n\nThis research provides a roadmap for building humanity's first true \"life detector\" telescope. Beyond confirming atmospheric signs of life, surface biosignatures could reveal primitive forms of photosynthesis that don't produce oxygen—potentially expanding the types of inhabited worlds we could discover. The findings will directly inform the design of the Habitable Worlds Observatory, bringing us closer to answering whether Earth-like life exists elsewhere in our cosmic neighborhood.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine looking at Earth from space and seeing the telltale green tint of our forests and grasslands. Now picture doing the same thing for planets orbiting distant stars, searching for similar signs of life. That's exactly what scientists are preparing to do with NASA's upcoming Habitable Worlds Observatory, a revolutionary space telescope designed to hunt for life beyond our solar system. This research tackles one of humanity's most profound questions: Are we alone? By studying how to detect biological \"fingerprints\" on the surfaces of distant worlds, scientists are developing the tools to potentially discover life on planets dozens of light-years away.</p>\n<h4>What They Did</h4>\n<p>The research team investigated how to spot \"surface biosignatures\"—essentially the colorful signatures left by living organisms on a planet's surface. Think of how Earth's landmasses appear greenish from space due to photosynthetic plants, or how certain bacteria create distinctive purple or red patches in extreme environments. The scientists modeled how these biological colors would appear when viewed from incredibly far away, testing scenarios based on different periods of Earth's history—from when our planet had barely any oxygen billions of years ago to today's oxygen-rich atmosphere. They calculated exactly how sensitive future telescopes would need to be to pick up these faint biological signals while distinguishing them from non-living features like rocks and clouds.</p>\n<h4>Key Findings</h4>\n<p>The team discovered that detecting these biological signatures requires incredibly precise measurements. The telescope would need to collect light across a broad range of wavelengths—from blue to near-infrared—with a signal strength 20 to 40 times greater than the background noise. Crucially, they found that narrow wavelength windows wouldn't work; you need the full spectrum to separate genuine biological signals from ordinary planetary features. Even if only 15% of a planet's surface showed biological activity under 50% cloud cover, the technique could still work.</p>\n<h4>Looking Forward</h4>\n<p>This research provides a roadmap for building humanity's first true \"life detector\" telescope. Beyond confirming atmospheric signs of life, surface biosignatures could reveal primitive forms of photosynthesis that don't produce oxygen—potentially expanding the types of inhabited worlds we could discover. The findings will directly inform the design of the Habitable Worlds Observatory, bringing us closer to answering whether Earth-like life exists elsewhere in our cosmic neighborhood.</p>",
      "tweet_hook": {
        "hook": "Surface biopigments could reveal alien photosynthesis even when atmospheres show no oxygen biosignatures",
        "claim": "HWO can detect primitive life forms that never evolved oxygenic photosynthesis",
        "evidence": "SNR of 20-40 needed across 500-1100 nm to detect biopigments with 15% surface coverage",
        "question": "Which Earth biosignatures through time are most likely on tidally locked planets?"
      },
      "figure_url": "https://arxiv.org/html/2601.08883v1/Fig1_Lifesrequirements.png"
    },
    {
      "id": "2601.07414v1",
      "title": "Characterization of two new transiting sub-Neptunes and a terrestrial planet around M-dwarf hosts",
      "abstract": "We report the confirmation of three transiting exoplanets orbiting TOI-1243 (LSPM~J0902+7138), TOI-4529 (G~2--21), and TOI-5388 (Wolf~346) that were initially detected by TESS through ground-based photometry and radial velocity follow-up measurements with CARMENES. The planets present short orbital periods of $4.65$, $5.88$, and $2.59$ days, and they orbit early-M dwarfs (M2.0V, M1.5V, and M3.0V, respectively). We were able to precisely determine the radius of all three planets with a precision of $< 7\\, \\%$, the mass of TOI-1243 b with a precision of $19\\, \\%$, and upper mass limits for TOI-4529 b and TOI-5388 b. The radius of TOI-1243 b is $2.33\\pm0.12\\, {R_{\\oplus}}$, its mass is $7.7 \\pm 1.5\\,{M_{\\oplus}}$, and the mean density is $0.61 \\pm 0.15 \\, {ρ_\\oplus}$. The radius of TOI-4529 b is $1.77 ^{+0.09}_{-0.08} \\, {R_{\\oplus}}$, the $3 σ$ upper mass limit is $4.9 \\, {M_{\\oplus}}$, and the $3 σ$ upper density limit is $0.88\\, {ρ_\\oplus}$. The third planet, TOI-5388 b, is Earth-sized with a radius of $0.99 ^{+0.07}_{-0.06} \\, {R_{\\oplus}}$, a $3 σ$ upper mass limit of $2.2 \\, {M_{\\oplus}}$, and a $3 σ$ upper density limit of $2.2\\, {ρ_\\oplus}$. While TOI-5388 b is most probably rocky, given its Earth-like radius, TOI-1243 b and TOI-4529 b are located in a highly degenerate region in the mass-radius space. TOI-4529 b appears to lean toward a water-world composition. TOI-1243 b has enough mass to host a significant H-He envelope, although a water-world and pure rocky compositions are also consistent with the data. Our analysis indicates that future atmospheric observations using JWST can aid in determining their real composition. The sample of small planets around M dwarfs is widely used to understand planet formation and composition theories, and our study adds three planets to this sample.",
      "authors": [
        "E. Poultourtzidis",
        "G. Lacedelli",
        "E. Pallé",
        "I. Carleo",
        "C. Magliano",
        "S. Geraldía-González",
        "J. A. Caballero",
        "G. Morello",
        "J. Orell-Miquel",
        "H. M. Tabernero",
        "F. Murgas",
        "G. Covone",
        "F. J. Pozuelos",
        "P. J. Amado",
        "V. J. S. Béjar",
        "S. Chairetas",
        "C. Cifuentes",
        "D. R. Ciardi",
        "K. A. Collins",
        "I. J. M. Crossfield",
        "E. Esparza-Borges",
        "G. Fernández-Rodríguez",
        "A. Fukui",
        "Y. Hayashi",
        "A. P. Hatzes",
        "Th. Henning",
        "E. Herrero",
        "K. Horne",
        "S. B. Howell",
        "K. Isogai",
        "J. M. Jenkins",
        "Y. Kawai",
        "F. Libotte",
        "E. Matthews",
        "P. Meni-Gallardo",
        "I. Mireles",
        "J. C. Morales",
        "N. Narita",
        "B. B. Ogunwale",
        "H. Parviainen",
        "A. Quirrenbach",
        "A. Reiners",
        "I. Ribas",
        "R. Sefako",
        "A. Shporer",
        "R. P. Schwarz",
        "G. Srdoc",
        "L. Tal-Or",
        "S. Vanaverbeke",
        "N. Watanabe",
        "C. N. Watkins",
        "F. Zong Lang"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-12T10:56:09Z",
      "updated": "2026-01-12T10:56:09Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07414v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07414v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 18,
      "summary": "**Why It Matters**\n\nImagine if we could peek into alien solar systems and discover what kinds of worlds exist beyond our own. That's exactly what astronomers are doing as they hunt for exoplanets—planets orbiting stars other than our Sun. Each new discovery helps us understand whether Earth-like worlds are common in the universe and brings us closer to answering one of humanity's biggest questions: are we alone? This research adds three fascinating new worlds to our growing catalog, including planets that might be covered in vast oceans or wrapped in thick atmospheres—very different from anything we see in our own solar system.\n\n**What They Did**\n\nThe team used NASA's TESS space telescope, which acts like a cosmic detective, watching for tiny dips in starlight that occur when planets pass in front of their host stars—like watching a moth fly in front of a streetlight. When TESS spotted these telltale signals around three small, dim red dwarf stars, the researchers followed up with ground-based telescopes to confirm the discoveries. They measured how the planets' gravity tugs on their stars, causing them to wobble slightly—a technique that reveals each planet's mass. By combining the size measurements from TESS with these mass calculations, they could determine what these distant worlds might be made of.\n\n**Key Findings**\n\nThe trio of newly confirmed planets are all fascinating in their own ways. TOI-1243 b is about 2.3 times wider than Earth but surprisingly lightweight—it could be a \"water world\" covered in deep oceans, or it might have a puffy atmosphere of hydrogen and helium. TOI-4529 b is nearly twice Earth's size and also appears to lean toward being a water-rich world. Most intriguingly, TOI-5388 b is almost exactly Earth's size and likely rocky like our home planet. All three worlds orbit much closer to their stars than Mercury does to our Sun, completing full orbits in just 2-6 days.\n\n**Looking Forward**\n\nThese discoveries are perfectly timed for the James Webb Space Telescope, which can analyze the atmospheres of these worlds to reveal their true nature. Are they steamy water worlds, mini-Neptunes with thick atmospheres, or something entirely unexpected? Each answer brings us closer to understanding how planets form and evolve—and ultimately, how common Earth-like conditions might be in our galaxy.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine if we could peek into alien solar systems and discover what kinds of worlds exist beyond our own. That's exactly what astronomers are doing as they hunt for exoplanets—planets orbiting stars other than our Sun. Each new discovery helps us understand whether Earth-like worlds are common in the universe and brings us closer to answering one of humanity's biggest questions: are we alone? This research adds three fascinating new worlds to our growing catalog, including planets that might be covered in vast oceans or wrapped in thick atmospheres—very different from anything we see in our own solar system.</p>\n<h4>What They Did</h4>\n<p>The team used NASA's TESS space telescope, which acts like a cosmic detective, watching for tiny dips in starlight that occur when planets pass in front of their host stars—like watching a moth fly in front of a streetlight. When TESS spotted these telltale signals around three small, dim red dwarf stars, the researchers followed up with ground-based telescopes to confirm the discoveries. They measured how the planets' gravity tugs on their stars, causing them to wobble slightly—a technique that reveals each planet's mass. By combining the size measurements from TESS with these mass calculations, they could determine what these distant worlds might be made of.</p>\n<h4>Key Findings</h4>\n<p>The trio of newly confirmed planets are all fascinating in their own ways. TOI-1243 b is about 2.3 times wider than Earth but surprisingly lightweight—it could be a \"water world\" covered in deep oceans, or it might have a puffy atmosphere of hydrogen and helium. TOI-4529 b is nearly twice Earth's size and also appears to lean toward being a water-rich world. Most intriguingly, TOI-5388 b is almost exactly Earth's size and likely rocky like our home planet. All three worlds orbit much closer to their stars than Mercury does to our Sun, completing full orbits in just 2-6 days.</p>\n<h4>Looking Forward</h4>\n<p>These discoveries are perfectly timed for the James Webb Space Telescope, which can analyze the atmospheres of these worlds to reveal their true nature. Are they steamy water worlds, mini-Neptunes with thick atmospheres, or something entirely unexpected? Each answer brings us closer to understanding how planets form and evolve—and ultimately, how common Earth-like conditions might be in our galaxy.</p>",
      "tweet_hook": {
        "hook": "Earth-sized planet orbits red dwarf every 2.6 days - likely rocky despite intense stellar radiation",
        "claim": "Three new worlds around M dwarfs add to the growing sample for planet formation studies",
        "evidence": "TOI-5388b has Earth-like radius (0.99 R⊕) but receives extreme heat from its M3 dwarf host",
        "question": "Can rocky planets survive so close to M dwarfs or do they lose their atmospheres?"
      },
      "figure_url": "https://arxiv.org/html/2601.07414v1/x1.png"
    },
    {
      "id": "2601.08390v1",
      "title": "Direct detection of hydrogen reveals a new macroscopic crustal water reservoir on early Mars",
      "abstract": "The next great leap in Martian exploration will be the return of samples to Earth. To ensure the maximum scientific return from studying these samples, the development and utilisation of nondestructive analytical techniques are essential to enable early three-dimensional characterisation of their interiors. Neutron computed tomography is a powerful method in this context: it is highly sensitive to hydrogen and complements the more conventional X-ray computed tomography. Because the distribution and nature of hydrous phases are central to understanding the habitability, the climatic and geological evolution, and potential biosignatures of Mars, identifying hydrogenbearing phases in Martian crustal rocks is of particular importance. Using the only Martian crustal material available on Earth, the NWA 7034 meteorite and its pairs, we show that combined neutron and X-ray computed tomography enables non-destructive sample-wide mapping of hydrogen and reveals the distribution and petrographic contexts of hydrous phases. We identify hydrogen-rich iron oxyhydroxides within ancient igneous clasts, forming a macroscopic mineralogical water reservoir within the meteorite. These alteration assemblages closely resemble those observed in samples collected by the Perseverance rover in Jezero crater, where hydrated iron oxyhydroxides are also present. This similarity suggests that such phases may represent a widespread near-surface water reservoir on early Mars.",
      "authors": [
        "Estrid Buhl Naver",
        "Katrine Wulff Nikolajsen",
        "Martin Sæbye Carøe",
        "Domenico Battaglia",
        "Jens Frydenvang",
        "Martin Bizzarro",
        "Jakob Sauer Jørgensen",
        "Kim Lefmann",
        "Anders Kaestner",
        "David Christian Mannes",
        "Phil Cook",
        "Henrik Birkedal",
        "Thorbjørn Erik Køppen Christensen",
        "Innokenty Kantor",
        "Henning Friis Poulsen",
        "Luise Theil Kuhn"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T09:58:02Z",
      "updated": "2026-01-13T09:58:02Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08390v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08390v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 15,
      "summary": "**Why It Matters**\n\nMars has captivated us for decades as the most Earth-like planet in our solar system, and one of our best bets for finding signs that life once existed beyond our home world. The key ingredient for life as we know it is water—and while we know ancient Mars had rivers, lakes, and possibly oceans on its surface, scientists are still piecing together how much water was locked away in the planet's rocks and soil. This hidden water reservoir could tell us whether Mars stayed habitable long enough for life to take hold and evolve. Understanding Mars' watery past also helps us grasp how rocky planets like Earth develop and change over billions of years.\n\n**What They Did**\n\nRather than waiting for future Mars missions to bring back samples, researchers turned to a rare Martian meteorite called NWA 7034 that naturally made its way to Earth. Think of this space rock as a time capsule from ancient Mars, blasted off the planet's surface by an asteroid impact millions of years ago. The team used two complementary scanning techniques—like getting both an X-ray and MRI of the same patient. X-ray tomography revealed the meteorite's internal structure, while neutron tomography acted like a hydrogen detector, able to spot water-bearing minerals that X-rays might miss. Together, these scans created detailed 3D maps of the meteorite's interior without breaking it apart.\n\n**Key Findings**\n\nThe scans revealed something remarkable: iron-rich minerals throughout the meteorite that had absorbed and stored significant amounts of water. These rusty, hydrated minerals weren't just scattered randomly—they formed organized patterns within ancient volcanic rock fragments, creating what researchers describe as a \"macroscopic water reservoir.\" Most exciting was the discovery that these same types of water-bearing minerals are showing up in rocks that NASA's Perseverance rover recently analyzed in Mars' Jezero crater, suggesting this water storage system was widespread across early Mars.\n\n**Looking Forward**\n\nThis discovery suggests that Mars' crust may have harbored far more water than previously thought, potentially extending the planet's habitable period. As we prepare to bring actual Martian samples back to Earth in the next decade, these scanning techniques will be crucial for extracting maximum scientific value without destroying precious specimens. The findings also refine our understanding of how water behaves on rocky planets, knowledge that will prove invaluable as we study potentially habitable exoplanets orbiting other stars.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Mars has captivated us for decades as the most Earth-like planet in our solar system, and one of our best bets for finding signs that life once existed beyond our home world. The key ingredient for life as we know it is water—and while we know ancient Mars had rivers, lakes, and possibly oceans on its surface, scientists are still piecing together how much water was locked away in the planet's rocks and soil. This hidden water reservoir could tell us whether Mars stayed habitable long enough for life to take hold and evolve. Understanding Mars' watery past also helps us grasp how rocky planets like Earth develop and change over billions of years.</p>\n<h4>What They Did</h4>\n<p>Rather than waiting for future Mars missions to bring back samples, researchers turned to a rare Martian meteorite called NWA 7034 that naturally made its way to Earth. Think of this space rock as a time capsule from ancient Mars, blasted off the planet's surface by an asteroid impact millions of years ago. The team used two complementary scanning techniques—like getting both an X-ray and MRI of the same patient. X-ray tomography revealed the meteorite's internal structure, while neutron tomography acted like a hydrogen detector, able to spot water-bearing minerals that X-rays might miss. Together, these scans created detailed 3D maps of the meteorite's interior without breaking it apart.</p>\n<h4>Key Findings</h4>\n<p>The scans revealed something remarkable: iron-rich minerals throughout the meteorite that had absorbed and stored significant amounts of water. These rusty, hydrated minerals weren't just scattered randomly—they formed organized patterns within ancient volcanic rock fragments, creating what researchers describe as a \"macroscopic water reservoir.\" Most exciting was the discovery that these same types of water-bearing minerals are showing up in rocks that NASA's Perseverance rover recently analyzed in Mars' Jezero crater, suggesting this water storage system was widespread across early Mars.</p>\n<h4>Looking Forward</h4>\n<p>This discovery suggests that Mars' crust may have harbored far more water than previously thought, potentially extending the planet's habitable period. As we prepare to bring actual Martian samples back to Earth in the next decade, these scanning techniques will be crucial for extracting maximum scientific value without destroying precious specimens. The findings also refine our understanding of how water behaves on rocky planets, knowledge that will prove invaluable as we study potentially habitable exoplanets orbiting other stars.</p>",
      "tweet_hook": {
        "hook": "Ancient Mars had a massive hidden water reservoir locked inside crustal rocks across the planet",
        "claim": "Neutron tomography reveals widespread hydrogen-rich minerals in early Martian crust",
        "evidence": "Method: Combined neutron and X-ray CT mapped hydrogen in NWA 7034 meteorite non-destructively",
        "question": "Could these crustal water reservoirs have sustained life longer than surface water?"
      },
      "figure_url": "https://images.unsplash.com/photo-1614728894747-a83421e2b9c9?w=800&q=80"
    },
    {
      "id": "2601.07465v1",
      "title": "Exoplanet transit search at the detection limit: detection and false alarm vetting pipeline",
      "abstract": "One of the primary mission goals of the Kepler space telescope was to detect Earth-like terrestrial planets in the habitable zone around Sun-like stars. These planets are at the detection limit, where the Kepler detection and vetting pipeline produced unreliable planet candidates. We present a novel pipeline that improves the removal of localized defects prior to the planet search, improves vetting at the level of individual transits and introduces a Bayes factor test statistic and an algorithm for extracting multiple candidates from a single detection run. We show with injections in the Kepler data that the introduced novelties improve pipeline's completeness at a fixed false alarm rate. We apply the pipeline to the stars with previously identified planet candidates and show that our pipeline successfully recovers the previously confirmed candidates, but flags a considerable portion of unconfirmed candidates as likely false alarms, especially in the long period, low signal-to-noise ratio regime. In particular, several known Earth-like candidates in the habitable zone, such as KOI 8063.01, 8107.01 and 8242.01, are identified as false alarms, which could have a significant impact on the estimates of $η_{\\oplus}$, i.e., the occurrence of Earth-like planets in the habitable zone.",
      "authors": [
        "Jakob Robnik",
        "Uroš Seljak",
        "Jon M. Jenkins",
        "Steve Bryson"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-12T12:21:18Z",
      "updated": "2026-01-12T12:21:18Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07465v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07465v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 13,
      "summary": "**Why It Matters**\n\nFor decades, one of humanity's most profound questions has been whether Earth-like planets—worlds that could potentially harbor life—are common or rare in our galaxy. NASA's Kepler space telescope was designed to help answer this question by hunting for planets similar to Earth orbiting Sun-like stars at just the right distance where liquid water could exist. These are the planets we're most excited about because they represent our best hope for finding life beyond Earth. However, detecting such planets pushes our technology to its absolute limits—they're so small and create such subtle signals that it's incredibly difficult to tell real planets from false alarms caused by instrumental glitches or stellar activity.\n\n**What They Did**\n\nThe researchers developed a new computer analysis system to better distinguish real Earth-like planets from false signals in Kepler's data. Think of it like improving a metal detector to find small coins buried deep in sand while filtering out bottle caps and other junk. Their system works in several ways: it's better at removing data corrupted by spacecraft issues (like cleaning static from a radio signal), it examines each individual planetary transit more carefully (a transit occurs when a planet crosses in front of its star, causing a tiny dimming), and it uses advanced statistical methods to calculate the probability that a signal represents a real planet rather than noise. They tested their improvements by artificially inserting fake planet signals into real Kepler data to see how well the system could find them.\n\n**Key Findings**\n\nThe new pipeline successfully recovered planets that had already been confirmed as real, proving it works reliably. However, it flagged many previously suspected Earth-like planets as likely false alarms—including several famous candidates like KOI 8063.01, 8107.01, and 8242.01 that were considered promising finds in the habitable zone. This suggests that some of our most exciting potential Earth-twins may not actually exist.\n\n**Looking Forward**\n\nThese findings could significantly change our estimates of how common Earth-like planets are in the galaxy. If many suspected habitable worlds turn out to be false alarms, it might mean such planets are rarer than we hoped—or it might simply mean we need even better tools to find them reliably.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>For decades, one of humanity's most profound questions has been whether Earth-like planets—worlds that could potentially harbor life—are common or rare in our galaxy. NASA's Kepler space telescope was designed to help answer this question by hunting for planets similar to Earth orbiting Sun-like stars at just the right distance where liquid water could exist. These are the planets we're most excited about because they represent our best hope for finding life beyond Earth. However, detecting such planets pushes our technology to its absolute limits—they're so small and create such subtle signals that it's incredibly difficult to tell real planets from false alarms caused by instrumental glitches or stellar activity.</p>\n<h4>What They Did</h4>\n<p>The researchers developed a new computer analysis system to better distinguish real Earth-like planets from false signals in Kepler's data. Think of it like improving a metal detector to find small coins buried deep in sand while filtering out bottle caps and other junk. Their system works in several ways: it's better at removing data corrupted by spacecraft issues (like cleaning static from a radio signal), it examines each individual planetary transit more carefully (a transit occurs when a planet crosses in front of its star, causing a tiny dimming), and it uses advanced statistical methods to calculate the probability that a signal represents a real planet rather than noise. They tested their improvements by artificially inserting fake planet signals into real Kepler data to see how well the system could find them.</p>\n<h4>Key Findings</h4>\n<p>The new pipeline successfully recovered planets that had already been confirmed as real, proving it works reliably. However, it flagged many previously suspected Earth-like planets as likely false alarms—including several famous candidates like KOI 8063.01, 8107.01, and 8242.01 that were considered promising finds in the habitable zone. This suggests that some of our most exciting potential Earth-twins may not actually exist.</p>\n<h4>Looking Forward</h4>\n<p>These findings could significantly change our estimates of how common Earth-like planets are in the galaxy. If many suspected habitable worlds turn out to be false alarms, it might mean such planets are rarer than we hoped—or it might simply mean we need even better tools to find them reliably.</p>",
      "tweet_hook": {
        "hook": "Earth-like planets in habitable zones might be false alarms - several Kepler \"Earth twins\" flagged as detection errors",
        "claim": "New pipeline shows many unconfirmed Earth-sized habitable zone candidates are likely false positives",
        "evidence": "KOI 8063.01, 8107.01 and 8242.01 - previously considered Earth-like - identified as false alarms",
        "question": "How much should we revise η⊕ estimates if habitable zone detections are unreliable?"
      },
      "figure_url": "https://arxiv.org/html/2601.07465v1/x1.png"
    },
    {
      "id": "2601.08227v1",
      "title": "Jupiter-like uniform metal enrichment in a system of multiple giant exoplanets",
      "abstract": "The accretion of icy and rocky solids during the formation of a gas giant planet is poorly constrained and challenging to model. Refractory species, like sulfur, are only present in solids in the protoplanetary disk where planets form. Measuring their abundance in planetary atmospheres is one of the most direct ways of constraining the extent and mechanism of solid accretion. Using the unprecedented sensitivity of NASA's James Webb Space Telescope (JWST), we measure a detailed chemical make-up of three massive gas giants orbiting the star HR~8799 including direct detections of H$_2$O, CO, CH$_4$, CO$_2$, H$_2$S, $^{13}$CO, and C$^{18}$O. We find these planets are uniformly and highly enriched in heavy elements compared to the star irrespective of their volatile (carbon and oxygen) or refractory (sulfur) nature, which strongly suggests efficient accretion of solids during their formation. This composition closely resembles that of Jupiter and Saturn and demonstrates that this enrichment also occurs in systems of multiple gas giant planets orbiting stars beyond the Solar System. This discovery hints at a shared origin for the heavy element enrichment of giant planets across a wider range of planet masses and orbital separations than previously anticipated.",
      "authors": [
        "Jean-Baptiste Ruffio",
        "Jerry W. Xuan",
        "Yayaati Chachan",
        "Aurora Kesseli",
        "Eve J. Lee",
        "Charles Beichman",
        "Klaus Hodapp",
        "William O. Balmer",
        "Quinn Konopacky",
        "Marshall D. Perrin",
        "Dimitri Mawet",
        "Heather A. Knutson",
        "Geoffrey Bryden",
        "Thomas P. Greene",
        "Doug Johnstone",
        "Jarron Leisenring",
        "Michael Meyer",
        "Marie Ygouf"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T05:16:12Z",
      "updated": "2026-01-13T05:16:12Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08227v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08227v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 12,
      "summary": "**Why It Matters**\n\nUnderstanding how planets form is one of astronomy's biggest puzzles—and it directly connects to the ultimate question of whether Earth-like worlds might exist elsewhere. Gas giant planets like Jupiter play a crucial role as cosmic architects, influencing where smaller, rocky planets can form and survive. By studying how these massive worlds assembled billions of years ago, we're essentially reading the recipe book of planet formation. This research helps us understand not just how our own Solar System came to be, but whether the processes that created Jupiter and Saturn are universal laws of nature or cosmic accidents.\n\n**What They Did**\n\nScientists used NASA's James Webb Space Telescope—the most powerful space observatory ever built—to analyze the atmospheres of three giant planets orbiting a star called HR 8799, located about 130 light-years away. Think of it like using a incredibly sensitive spectrometer to identify the ingredients in a soup by analyzing the light that passes through it. The telescope can detect specific chemicals in these distant atmospheres by observing how they absorb starlight. The researchers looked for various molecules including water vapor, carbon monoxide, methane, and hydrogen sulfide—essentially taking a detailed chemical fingerprint of each planet's atmosphere.\n\n**Key Findings**\n\nAll three planets showed remarkably similar chemical compositions, packed with heavy elements far beyond what you'd expect if they formed purely by gathering gas. Most surprisingly, they contain high levels of sulfur—an element that can only come from solid rocks and ice, not gas. This chemical signature closely matches Jupiter and Saturn in our own Solar System, suggesting these distant giants formed the same way: by gobbling up enormous amounts of solid material during their youth, then wrapping themselves in thick blankets of hydrogen and helium gas.\n\n**Looking Forward**\n\nThis discovery suggests that gas giants across the universe might follow a standard formation recipe, making planetary systems more predictable than previously thought. If giant planet formation is this consistent, it could help us better predict where to find Earth-like worlds—since Jupiter-like planets can either protect or destroy smaller planets depending on their orbits. Future observations of more planetary systems will test whether this pattern holds universally, potentially revolutionizing our understanding of how common habitable worlds might be.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Understanding how planets form is one of astronomy's biggest puzzles—and it directly connects to the ultimate question of whether Earth-like worlds might exist elsewhere. Gas giant planets like Jupiter play a crucial role as cosmic architects, influencing where smaller, rocky planets can form and survive. By studying how these massive worlds assembled billions of years ago, we're essentially reading the recipe book of planet formation. This research helps us understand not just how our own Solar System came to be, but whether the processes that created Jupiter and Saturn are universal laws of nature or cosmic accidents.</p>\n<h4>What They Did</h4>\n<p>Scientists used NASA's James Webb Space Telescope—the most powerful space observatory ever built—to analyze the atmospheres of three giant planets orbiting a star called HR 8799, located about 130 light-years away. Think of it like using a incredibly sensitive spectrometer to identify the ingredients in a soup by analyzing the light that passes through it. The telescope can detect specific chemicals in these distant atmospheres by observing how they absorb starlight. The researchers looked for various molecules including water vapor, carbon monoxide, methane, and hydrogen sulfide—essentially taking a detailed chemical fingerprint of each planet's atmosphere.</p>\n<h4>Key Findings</h4>\n<p>All three planets showed remarkably similar chemical compositions, packed with heavy elements far beyond what you'd expect if they formed purely by gathering gas. Most surprisingly, they contain high levels of sulfur—an element that can only come from solid rocks and ice, not gas. This chemical signature closely matches Jupiter and Saturn in our own Solar System, suggesting these distant giants formed the same way: by gobbling up enormous amounts of solid material during their youth, then wrapping themselves in thick blankets of hydrogen and helium gas.</p>\n<h4>Looking Forward</h4>\n<p>This discovery suggests that gas giants across the universe might follow a standard formation recipe, making planetary systems more predictable than previously thought. If giant planet formation is this consistent, it could help us better predict where to find Earth-like worlds—since Jupiter-like planets can either protect or destroy smaller planets depending on their orbits. Future observations of more planetary systems will test whether this pattern holds universally, potentially revolutionizing our understanding of how common habitable worlds might be.</p>",
      "tweet_hook": {
        "hook": "Three giant exoplanets have identical heavy element enrichment patterns - just like Jupiter and Saturn",
        "claim": "First evidence that multiple gas giants in other systems share Jupiter's formation pathway",
        "evidence": "JWST detected H2O, CO, CH4, CO2, H2S in all three HR 8799 planets with uniform metal enrichment",
        "question": "Does this mean gas giant formation is more predictable than we thought?"
      },
      "figure_url": "https://arxiv.org/html/2601.08227v1/x1.png"
    },
    {
      "id": "2601.11280v1",
      "title": "Detection of four cold Jupiters through combined analyses of radial velocity and astrometry data",
      "abstract": "Cold Jupiters play a crucial role in planet formation and dynamical evolution. Since their initial discovery around 47 UMa, they have attracted significant interest, yet their formation mechanisms remain uncertain, underscoring the need to expand the known population. In this work, we combine RV data with Gaia astrometry using Hipparcos-Gaia proper-motion anomalies over a 25-year baseline. By jointly modeling both datasets with the MCMC framework, we constrain planetary masses, orbital inclinations, and three-dimensional orbital architectures. This reduces RV degeneracies and improves mass determinations. Four cold Jupiters are reported: HD 68475 b and HD 100508 b are each the first confirmed planet in their systems, with orbital periods $7832_{-323}^{+463}$ d and $5681\\pm42$ d and dynamical masses of $5.16_{-0.47}^{+0.53} M_{\\text{Jup}}$ and $1.2_{-0.18}^{+0.30} M_{\\text{Jup}}$, respectively. In multi-planet systems, HD 48265 c has a period of $10418_{-1400}^{+2400}$ d and a mass of $3.71_{-0.43}^{+0.68} M_{\\text{Jup}}$, while HD 114386 c orbits at $444.00_{-0.88}^{+0.93}$ d with a minimum mass of $0.37 \\pm 0.03 M_{\\text{Jup}}$. The two planets in the HD 48265 system may exhibit a significant mutual inclination, making it a target for testing the von-Zeipel-Kozai-Lidov mechanism. HD 68475 b is a promising candidate for future direct imaging with ELT/METIS. We identified a Jupiter analog with the longest known orbital period among planets with masses between 0.5 and 2 $M_{\\text{Jup}}$, implying that a substantial population of cold Jupiters likely awaits discovery by Gaia. This study expands the sample of cold Jupiters with constrained orbits and dynamical masses, demonstrating the value of combining radial velocity and astrometry in exoplanet research.",
      "authors": [
        "Yiyun Wu",
        "Guang-Yao Xiao",
        "R. Paul Butler",
        "Fabo Feng",
        "Stephen A. Shectman",
        "Jeffrey D. Crane",
        "Johanna K. Teske",
        "Sharon X. Wang",
        "Yuri Beletsky",
        "Jennifer A. Burt",
        "Tansu Daylan",
        "Matias Diaz",
        "Diana Dragomir",
        "Erin Flowers",
        "Sydney Jenkins",
        "Shubham Kanodia",
        "Sangeetha Nandakumar",
        "Malena Rice",
        "Avi Shporer",
        "Sam Yee",
        "George Zhou",
        "Zitao Lin"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-16T13:25:14Z",
      "updated": "2026-01-16T13:25:14Z",
      "pdf_link": "https://arxiv.org/pdf/2601.11280v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.11280v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 11,
      "summary": "**Why It Matters**\n\nImagine trying to understand how planetary systems form by only studying our own solar system—it would be like trying to understand human diversity by studying just one family. Cold Jupiters, massive planets that orbit far from their host stars (similar to how Jupiter orbits far from our Sun), hold crucial clues about how planetary systems develop and evolve. These distant giants may act as cosmic shepherds, influencing where smaller, potentially habitable planets can form and survive. By finding more of these cold Jupiters, astronomers are building a more complete picture of planetary system architecture, which ultimately helps us understand whether systems like our own—with rocky planets in the \"Goldilocks zone\" where liquid water can exist—are common or rare in the universe.\n\n**What They Did**\n\nThe researchers used a detective approach, combining two different methods to hunt for planets orbiting distant stars. First, they used the \"wobble method\"—when a planet orbits a star, it causes the star to wobble slightly due to gravitational pull, like a hammer thrower spinning in circles. Second, they tracked tiny changes in stellar positions using space telescopes over 25 years, looking for stars that seemed to \"drift\" from their expected paths due to unseen planetary companions. By combining these techniques using sophisticated computer modeling, they could determine not just that planets exist, but also their actual masses and the tilts of their orbits—information that's usually much harder to pin down.\n\n**Key Findings**\n\nThe team discovered four new cold Jupiters—massive planets with orbital periods ranging from about 1.2 to 28 years (compared to Jupiter's 12-year orbit around our Sun). The most massive weighs about five times more than Jupiter, while the smallest is roughly one-third Jupiter's mass. One particularly exciting find is a \"Jupiter analog\"—a planet with the longest known orbital period among planets in its mass range, taking over 28 years to complete one orbit. The researchers also found evidence that some planets in multi-planet systems may have tilted orbits relative to each other, suggesting complex gravitational interactions shaped these systems over time.\n\n**Looking Forward**\n\nThis research demonstrates that combining multiple detection methods dramatically improves our ability to characterize distant worlds. The discovery of these cold Jupiters suggests many more are waiting to be found, potentially doubling or tripling the known population as future space missions collect more data. One of the newly discovered planets may even be bright enough for next-generation telescopes to photograph directly—a major step toward studying exoplanet atmospheres. These findings bring us closer to answering fundamental questions about planetary system formation and whether the architecture of our solar system is typical or unique in the cosmos.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to understand how planetary systems form by only studying our own solar system—it would be like trying to understand human diversity by studying just one family. Cold Jupiters, massive planets that orbit far from their host stars (similar to how Jupiter orbits far from our Sun), hold crucial clues about how planetary systems develop and evolve. These distant giants may act as cosmic shepherds, influencing where smaller, potentially habitable planets can form and survive. By finding more of these cold Jupiters, astronomers are building a more complete picture of planetary system architecture, which ultimately helps us understand whether systems like our own—with rocky planets in the \"Goldilocks zone\" where liquid water can exist—are common or rare in the universe.</p>\n<h4>What They Did</h4>\n<p>The researchers used a detective approach, combining two different methods to hunt for planets orbiting distant stars. First, they used the \"wobble method\"—when a planet orbits a star, it causes the star to wobble slightly due to gravitational pull, like a hammer thrower spinning in circles. Second, they tracked tiny changes in stellar positions using space telescopes over 25 years, looking for stars that seemed to \"drift\" from their expected paths due to unseen planetary companions. By combining these techniques using sophisticated computer modeling, they could determine not just that planets exist, but also their actual masses and the tilts of their orbits—information that's usually much harder to pin down.</p>\n<h4>Key Findings</h4>\n<p>The team discovered four new cold Jupiters—massive planets with orbital periods ranging from about 1.2 to 28 years (compared to Jupiter's 12-year orbit around our Sun). The most massive weighs about five times more than Jupiter, while the smallest is roughly one-third Jupiter's mass. One particularly exciting find is a \"Jupiter analog\"—a planet with the longest known orbital period among planets in its mass range, taking over 28 years to complete one orbit. The researchers also found evidence that some planets in multi-planet systems may have tilted orbits relative to each other, suggesting complex gravitational interactions shaped these systems over time.</p>\n<h4>Looking Forward</h4>\n<p>This research demonstrates that combining multiple detection methods dramatically improves our ability to characterize distant worlds. The discovery of these cold Jupiters suggests many more are waiting to be found, potentially doubling or tripling the known population as future space missions collect more data. One of the newly discovered planets may even be bright enough for next-generation telescopes to photograph directly—a major step toward studying exoplanet atmospheres. These findings bring us closer to answering fundamental questions about planetary system formation and whether the architecture of our solar system is typical or unique in the cosmos.</p>",
      "tweet_hook": {
        "hook": "Four massive cold Jupiters found lurking in the outer reaches of nearby star systems",
        "claim": "Combined Gaia astrometry + radial velocity reveals true masses and 3D orbits of distant giants",
        "evidence": "One Jupiter analog has longest known orbital period (28 years) for planets 0.5-2 Jupiter masses",
        "question": "How many more cold Jupiters is Gaia about to unveil in our solar neighborhood?"
      },
      "figure_url": "https://arxiv.org/html/2601.11280v1/x1.png"
    },
    {
      "id": "2601.09766v1",
      "title": "Habitable Worlds Observatory (HWO): Living Worlds Community Working Group: The Search for Life on Potentially Habitable Exoplanets",
      "abstract": "The discovery of a biosphere on another planet would transform how we view ourselves, and our planet Earth, in relation to the rest of the cosmos. We now know Earth is one planet among eight circling our sun; our sun is part of a swirling galaxy of over one hundred billion other suns; and our galaxy is one of untold billions in the universe. While we do not yet know how many, if any, other biospheres exist on the countless worlds orbiting countless other suns, we stand at the precipice of a new era of discovery, enabled by powerful new facilities able to peer across the light years into the atmospheres of planets similar to our own. This article is an adaptation of a science case document (SCDD) developed for the NASA Astrophysics Flagship mission the Habitable Worlds Observatory (HWO) Science, Technology, and Architecture Review Team (START) Living Worlds Community Working Group.",
      "authors": [
        "Giada Arney",
        "Niki Parenteau",
        "Natalie Hinkel",
        "Eric Mamajek",
        "Joshua Krissansen-Totton",
        "Stephanie Olson",
        "Edward Schwieterman",
        "Sara Walker",
        "Kevin Fogarty",
        "Ravi Kopparapu",
        "Jacob Lustig-Yaeger",
        "Mark Moussa",
        "Sukrit Ranjan",
        "Garima Singh",
        "Clara Sousa-Silva",
        "Ruslan Belikov",
        "Maxwell Frissell",
        "Samantha Gilbert-Janziek",
        "Vincent Kofman",
        "Natasha Latouf",
        "Mary Anne Limbach",
        "Rhonda Morgan",
        "Christopher Stark",
        "Armen Tokadjian",
        "Anna Grace Ulses",
        "Nicholas Wogan",
        "Mike Wong",
        "Amber Young"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-14T09:44:50Z",
      "updated": "2026-01-14T09:44:50Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09766v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09766v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 10,
      "summary": "**Why It Matters**\n\nImagine finding out we're not alone in the universe—that somewhere among the billions of stars twinkling in our night sky, there's another world teeming with life. This discovery would fundamentally change how we see ourselves and our place in the cosmos, much like when we first realized Earth orbits the Sun rather than being the center of everything. Scientists are now closer than ever to answering one of humanity's most profound questions: Is there life beyond Earth? With over 100 billion stars in our galaxy alone, and billions of galaxies beyond that, the universe contains more potential homes for life than grains of sand on all Earth's beaches combined.\n\n**What They Did**\n\nThis research isn't about a single discovery, but rather a comprehensive plan for humanity's most ambitious hunt for alien life. Scientists have designed a roadmap for the Habitable Worlds Observatory, a revolutionary space telescope that will act like a cosmic detective. Think of it as a super-powered magnifying glass that can peek into the atmospheres of Earth-like planets orbiting other stars—worlds that might be millions or billions of miles away. The team brought together experts from around the globe to determine exactly what this telescope should look for and how it should operate to maximize our chances of finding signs of life in these distant atmospheres.\n\n**Key Findings**\n\nRather than reporting new discoveries, this work establishes the scientific foundation for future breakthroughs. The researchers have identified the key \"biosignatures\"—chemical fingerprints that would indicate life—that the telescope should search for in alien atmospheres. They've also mapped out which types of planets offer the best chances of harboring life and determined the technical capabilities needed to study them effectively.\n\n**Looking Forward**\n\nThis roadmap sets the stage for what could be the most important scientific discovery in human history. The Habitable Worlds Observatory will launch within the next two decades, equipped to analyze dozens of potentially habitable worlds. If successful, we might finally answer whether Earth's story of life is unique or part of a much grander, more populated universe.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine finding out we're not alone in the universe—that somewhere among the billions of stars twinkling in our night sky, there's another world teeming with life. This discovery would fundamentally change how we see ourselves and our place in the cosmos, much like when we first realized Earth orbits the Sun rather than being the center of everything. Scientists are now closer than ever to answering one of humanity's most profound questions: Is there life beyond Earth? With over 100 billion stars in our galaxy alone, and billions of galaxies beyond that, the universe contains more potential homes for life than grains of sand on all Earth's beaches combined.</p>\n<h4>What They Did</h4>\n<p>This research isn't about a single discovery, but rather a comprehensive plan for humanity's most ambitious hunt for alien life. Scientists have designed a roadmap for the Habitable Worlds Observatory, a revolutionary space telescope that will act like a cosmic detective. Think of it as a super-powered magnifying glass that can peek into the atmospheres of Earth-like planets orbiting other stars—worlds that might be millions or billions of miles away. The team brought together experts from around the globe to determine exactly what this telescope should look for and how it should operate to maximize our chances of finding signs of life in these distant atmospheres.</p>\n<h4>Key Findings</h4>\n<p>Rather than reporting new discoveries, this work establishes the scientific foundation for future breakthroughs. The researchers have identified the key \"biosignatures\"—chemical fingerprints that would indicate life—that the telescope should search for in alien atmospheres. They've also mapped out which types of planets offer the best chances of harboring life and determined the technical capabilities needed to study them effectively.</p>\n<h4>Looking Forward</h4>\n<p>This roadmap sets the stage for what could be the most important scientific discovery in human history. The Habitable Worlds Observatory will launch within the next two decades, equipped to analyze dozens of potentially habitable worlds. If successful, we might finally answer whether Earth's story of life is unique or part of a much grander, more populated universe.</p>",
      "tweet_hook": {
        "hook": "We're about to peer directly into atmospheres of Earth-like planets orbiting other stars",
        "claim": "NASA's Habitable Worlds Observatory will search for biosignatures on potentially habitable exoplanets",
        "evidence": "Method: Direct imaging and spectroscopy of exoplanet atmospheres to detect signs of life",
        "question": "Which atmospheric biosignature would be most convincing evidence of alien life?"
      },
      "figure_url": "https://images.unsplash.com/photo-1451187580459-43490279c0fa?w=800&q=80"
    },
    {
      "id": "2601.08397v1",
      "title": "Anatomy of Empirical Transit Spectra of Mars based on TGO/NOMAD",
      "abstract": "Transit spectroscopy is a powerful tool for probing atmospheric structures of exoplanets. Accurately accounting for the effects of aerosols is key to reconstructing atmospheric properties from transit spectra, yet this remains a significant challenge. To advance this effort, it is invaluable to examine the spectral features of well-characterized planetary atmospheres. Here, we synthesize empirical transit spectra of Mars across different seasons based on data from the NOMAD's Solar Occultation channel onboard ExoMars/TGO, which operates at wavelengths of 0.2-0.65 and 2-4 micron. In the generated empirical transit spectra, the atmosphere below 25 km is found to be largely opaque due to the presence of micron-sized dust and water ice clouds, both of which substantially weaken spectral features. The spectra exhibit CO2 absorption features at 2.7-2.8 micron and signatures of sub-micron-sized mesospheric water ice clouds around 3.1 micron, accompanied by a continuum slope. The amplitudes of these spectral features are found to vary with the Martian seasons, where the dust storms weaken the CO2 signatures and strengthen the water ice features, which serve as potential indicators of a dusty planet like Mars. If TRAPPIST-1f possessed a Mars-like atmospheric structure, both CO2 and water ice features would be detectable at a noise level of 3 ppm, a level likely beyond current observational capabilities. Nevertheless, the 3.1 micron feature produced by sub-micron-sized mesospheric water ice clouds offers a novel avenue for characterizing the atmospheres of habitable-zone exoplanets.",
      "authors": [
        "Shohei Aoki",
        "Yuka Fujii",
        "Hideo Sagawa",
        "Geronimo L. Villanueva",
        "Ian Thomas",
        "Bojan Ristic",
        "Frank Daerden",
        "Miguel Angel López-Valverde",
        "Manish R. Patel",
        "Jonathon Mason",
        "Yannick Willame",
        "Giancarlo Bellucci",
        "Ann Carine Vandaele"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "published": "2026-01-13T10:05:41Z",
      "updated": "2026-01-13T10:05:41Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08397v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08397v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 10,
      "summary": "**Why It Matters**\n\nImagine trying to understand what a distant world is like by studying how starlight filters through its atmosphere—that's essentially what astronomers do when hunting for potentially habitable exoplanets. But there's a major challenge: clouds and dust in these alien atmospheres act like cosmic fog, obscuring the very signals that could tell us about conditions on these worlds. To crack this code, scientists are turning to a familiar neighbor for answers. By studying Mars as if it were a distant exoplanet, researchers are learning how to better decode the atmospheric secrets of worlds that might harbor life.\n\n**What They Did**\n\nUsing the European Space Agency's NOMAD instrument aboard the ExoMars orbiter, scientists observed Mars in a clever way—they watched how sunlight passed through the Martian atmosphere during what's essentially a Martian \"eclipse.\" Think of it like holding a colored filter up to a flashlight; different gases absorb different colors of light, creating a unique fingerprint. The researchers collected these light signatures across different Martian seasons, building up a comprehensive picture of how Mars would appear to alien astronomers studying it from afar. This technique, called transit spectroscopy, is the same method we use to study the atmospheres of planets orbiting other stars.\n\n**Key Findings**\n\nThe team discovered that Mars's lower atmosphere—everything below about 25 kilometers high—is essentially opaque due to dust storms and water ice clouds. These particles act like a thick blanket, hiding most atmospheric features from view. However, they found two key signatures that break through this cosmic haze: carbon dioxide absorption around 2.7-2.8 microns (a specific color of infrared light) and water ice cloud features at 3.1 microns. Remarkably, these signals change with Mars's seasons—dust storms weaken the carbon dioxide signatures while strengthening the water ice features, creating a seasonal atmospheric \"pulse.\"\n\n**Looking Forward**\n\nThis research provides astronomers with a crucial reference guide for interpreting observations of potentially Earth-like exoplanets. The study suggests that if we found a Mars-twin orbiting another star—like the intriguing TRAPPIST-1f—we could potentially detect both its carbon dioxide atmosphere and water ice clouds, though we'd need incredibly sensitive instruments. Most excitingly, the newly identified water ice signature at 3.1 microns offers a fresh way to study the atmospheres of potentially habitable worlds, giving us another tool in our quest to understand whether we're alone in the universe.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to understand what a distant world is like by studying how starlight filters through its atmosphere—that's essentially what astronomers do when hunting for potentially habitable exoplanets. But there's a major challenge: clouds and dust in these alien atmospheres act like cosmic fog, obscuring the very signals that could tell us about conditions on these worlds. To crack this code, scientists are turning to a familiar neighbor for answers. By studying Mars as if it were a distant exoplanet, researchers are learning how to better decode the atmospheric secrets of worlds that might harbor life.</p>\n<h4>What They Did</h4>\n<p>Using the European Space Agency's NOMAD instrument aboard the ExoMars orbiter, scientists observed Mars in a clever way—they watched how sunlight passed through the Martian atmosphere during what's essentially a Martian \"eclipse.\" Think of it like holding a colored filter up to a flashlight; different gases absorb different colors of light, creating a unique fingerprint. The researchers collected these light signatures across different Martian seasons, building up a comprehensive picture of how Mars would appear to alien astronomers studying it from afar. This technique, called transit spectroscopy, is the same method we use to study the atmospheres of planets orbiting other stars.</p>\n<h4>Key Findings</h4>\n<p>The team discovered that Mars's lower atmosphere—everything below about 25 kilometers high—is essentially opaque due to dust storms and water ice clouds. These particles act like a thick blanket, hiding most atmospheric features from view. However, they found two key signatures that break through this cosmic haze: carbon dioxide absorption around 2.7-2.8 microns (a specific color of infrared light) and water ice cloud features at 3.1 microns. Remarkably, these signals change with Mars's seasons—dust storms weaken the carbon dioxide signatures while strengthening the water ice features, creating a seasonal atmospheric \"pulse.\"</p>\n<h4>Looking Forward</h4>\n<p>This research provides astronomers with a crucial reference guide for interpreting observations of potentially Earth-like exoplanets. The study suggests that if we found a Mars-twin orbiting another star—like the intriguing TRAPPIST-1f—we could potentially detect both its carbon dioxide atmosphere and water ice clouds, though we'd need incredibly sensitive instruments. Most excitingly, the newly identified water ice signature at 3.1 microns offers a fresh way to study the atmospheres of potentially habitable worlds, giving us another tool in our quest to understand whether we're alone in the universe.</p>",
      "tweet_hook": {
        "hook": "Mars transit spectra reveal how dust storms would mask biosignatures on distant exoplanets",
        "claim": "Shows how aerosols weaken CO2 features but strengthen water ice signatures in transit observations",
        "evidence": "CO2 detection would need 3 ppm precision on TRAPPIST-1f - beyond current observational limits",
        "question": "Could mesospheric water ice clouds be a better exoplanet atmospheric probe than CO2?"
      },
      "figure_url": "https://arxiv.org/html/2601.08397v1/Fig1.png"
    },
    {
      "id": "2601.10508v1",
      "title": "sponchpop II: Population Synthesis to Investigate Volatile Sulfur as a Fingerprint of Gas Giant Formation Histories",
      "abstract": "Planet population synthesis is an integral tool for linking exoplanets to their formation environments. Most planet population synthesis studies have focused on the carbon-to-oxygen ratio (C/O) in gas or solids, yet more insight into planet formation may be afforded by considering a wider suite of elements. Sulfur is one such key element. It has been assumed to be entirely refractory in population synthesis models, restricting it to being a tracer of accreted rocky solids. However, sulfur also has a volatile reservoir dominant at the onset of star and planet formation. We investigate sulfur's wider potential as a formation history tracer by implementing the first multi-phase treatment of S in a planet population synthesis model. We present the planet formation module of \\textsc{sponchpop} and its first predicted planet growth tracks and populations. We explore the diversity of planet compositions in terms of their sulfur budget, including both refractory and volatile components, and apply a novel gas-grain conversion of sulfur to study how formation trajectories of giant planets relate to final core and envelope compositions. We show that planets inherit a wide range of core and envelope sulfur content related to accretion history while considering late-stage planetesimal infall, providing a new diagnostic tool for planet formation. The diverse sulfur content of planet cores suggests some rocky planets may be born sulfur-poor, with implications for their geochemistry and habitability. Enhanced sulfur abundances in gas-giant atmospheres can be attributed to formation beyond the H2S iceline, such as the giants in our Solar System.",
      "authors": [
        "Anna Sommerville-Thomas",
        "Mihkel Kama",
        "Oliver Shottle",
        "Jason Ran"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T15:34:21Z",
      "updated": "2026-01-15T15:34:21Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10508v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10508v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 9,
      "summary": "**Why It Matters**\n\nWhen astronomers discover new planets beyond our solar system, they're not just collecting cosmic stamps—they're trying to solve one of science's biggest puzzles: how do planets form, and could any of them harbor life? Understanding what planets are made of offers crucial clues to their birth stories and their potential to support life as we know it. This research focuses on sulfur, a common element that's been largely overlooked in planet formation studies. By tracking sulfur through the planet-building process, scientists can now read the chemical \"fingerprints\" that reveal where and how giant planets formed billions of years ago.\n\n**What They Did**\n\nThe researchers created a sophisticated computer simulation that models how planets grow from tiny dust grains to massive worlds over millions of years. Think of it like a cosmic recipe simulator that tracks not just the main ingredients, but also traces the journey of sulfur through different phases of planet formation. Previous studies treated sulfur as if it only existed in solid, rocky form—like assuming flour only exists as bread. But sulfur also exists as a gas or ice depending on temperature, so the team built the first model that follows sulfur through all its different states as planets assemble. They ran thousands of virtual planet formation scenarios to see how different conditions affect the final sulfur content of planets.\n\n**Key Findings**\n\nThe simulations revealed that planets end up with wildly different amounts of sulfur depending on their formation history. Gas giants that formed in the cold outer regions of their stellar systems—beyond where hydrogen sulfide freezes into ice—contain much more sulfur in their atmospheres, similar to Jupiter and Saturn in our solar system. Meanwhile, some rocky planets could be born surprisingly sulfur-poor, which would dramatically affect their geology and potentially their ability to support life, since sulfur plays important roles in atmospheric chemistry and biological processes.\n\n**Looking Forward**\n\nThis research provides astronomers with a new diagnostic tool for understanding exoplanet origins. By measuring sulfur content in planet atmospheres using space telescopes, scientists can now work backwards to determine where those planets likely formed and how they migrated to their current positions. This could revolutionize our understanding of planetary system architecture and help identify which worlds might be most suitable for life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>When astronomers discover new planets beyond our solar system, they're not just collecting cosmic stamps—they're trying to solve one of science's biggest puzzles: how do planets form, and could any of them harbor life? Understanding what planets are made of offers crucial clues to their birth stories and their potential to support life as we know it. This research focuses on sulfur, a common element that's been largely overlooked in planet formation studies. By tracking sulfur through the planet-building process, scientists can now read the chemical \"fingerprints\" that reveal where and how giant planets formed billions of years ago.</p>\n<h4>What They Did</h4>\n<p>The researchers created a sophisticated computer simulation that models how planets grow from tiny dust grains to massive worlds over millions of years. Think of it like a cosmic recipe simulator that tracks not just the main ingredients, but also traces the journey of sulfur through different phases of planet formation. Previous studies treated sulfur as if it only existed in solid, rocky form—like assuming flour only exists as bread. But sulfur also exists as a gas or ice depending on temperature, so the team built the first model that follows sulfur through all its different states as planets assemble. They ran thousands of virtual planet formation scenarios to see how different conditions affect the final sulfur content of planets.</p>\n<h4>Key Findings</h4>\n<p>The simulations revealed that planets end up with wildly different amounts of sulfur depending on their formation history. Gas giants that formed in the cold outer regions of their stellar systems—beyond where hydrogen sulfide freezes into ice—contain much more sulfur in their atmospheres, similar to Jupiter and Saturn in our solar system. Meanwhile, some rocky planets could be born surprisingly sulfur-poor, which would dramatically affect their geology and potentially their ability to support life, since sulfur plays important roles in atmospheric chemistry and biological processes.</p>\n<h4>Looking Forward</h4>\n<p>This research provides astronomers with a new diagnostic tool for understanding exoplanet origins. By measuring sulfur content in planet atmospheres using space telescopes, scientists can now work backwards to determine where those planets likely formed and how they migrated to their current positions. This could revolutionize our understanding of planetary system architecture and help identify which worlds might be most suitable for life.</p>",
      "tweet_hook": {
        "hook": "Some rocky planets may be born sulfur-poor, affecting their geochemistry and potential for life",
        "claim": "First population synthesis model tracks both solid and gas-phase sulfur in planet formation",
        "evidence": "Method: Novel gas-grain sulfur conversion reveals how formation beyond H2S iceline shapes composition",
        "question": "Could sulfur abundance be a better formation tracer than C/O ratios for gas giants?"
      },
      "figure_url": "https://arxiv.org/html/2601.10508v1/kama2019.png"
    },
    {
      "id": "2601.09330v1",
      "title": "NIRPS tightens the mass estimate of GJ 3090 b and detects a planet near the stellar rotation period",
      "abstract": "We present an updated characterization of the planetary system orbiting the nearby M2 dwarf GJ 3090 (TOI-177; $d = 22$ pc), based on new high-precision radial velocity (RV) observations from NIRPS and HARPS. With an orbital period of 2.85 d, the transiting sub-Neptune GJ 3090 b has a mass we refine to $4.52 \\pm 0.47 M_{\\oplus}$, which, combined with our derived radius of $2.18 \\pm 0.06 R_{\\oplus}$, yields a density of $2.40^{+0.33}_{-0.30}$ g cm$^{-3}$. The combined interior structure and atmospheric constraints indicate that GJ 3090 b is a compelling water-world candidate, with a volatile-rich envelope in which water likely represents a significant fraction. We also confirm the presence of a second planet, GJ 3090 c, a sub-Neptune with a 15.9 d orbit and a minimum mass of $10.0 \\pm 1.3 M_{\\oplus}$, which does not transit. Despite its proximity to the star's 18 d rotation period, our joint analysis using a multidimensional Gaussian process (GP) model that incorporates TESS photometry and differential stellar temperature measurements distinguishes this planetary signal from activity-induced variability. In addition, we place new constraints on a non-transiting planet candidate with a period of 12.7 d, suggested in earlier RV analyses. This candidate remains a compelling target for future monitoring. These results highlight the crucial role of multidimensional GP modelling in disentangling planetary signals from stellar activity, enabling the detection of a planet near the stellar rotation period that could have remained undetected with traditional approaches.",
      "authors": [
        "Pierrot Lamontagne",
        "Drew Weisserman",
        "Charles Cadieux",
        "David Lafrenière",
        "Alexandrine L'Heureux",
        "Mykhaylo Plotnykov",
        "Léna Parc",
        "Atanas K. Stefanov",
        "Leslie Moranta",
        "René Doyon",
        "François Bouchy",
        "Jean-Baptiste Delisle",
        "Louise D. Nielsen",
        "Gaspare Lo Curto",
        "Frédérique Baron",
        "Susana C. C. Barros",
        "Björn Benneke",
        "Xavier Bonfils",
        "Marta Bryan",
        "Bruno L. Canto Martins",
        "Ryan Cloutier",
        "Nicolas B. Cowan",
        "Daniel Brito de Freitas",
        "Jose Renan De Medeiros",
        "Xavier Delfosse",
        "Elisa Delgado-Mena",
        "Xavier Dumusque",
        "David Ehrenreich",
        "Pedro Figueira",
        "Jonay I. González Hernández",
        "Izan de Castro Leão",
        "Christophe Lovis",
        "Lison Malo",
        "Claudio Melo",
        "Lucile Mignon",
        "Christoph Mordasini",
        "Francesco Pepe",
        "Rafael Rebolo",
        "Jason Rowe",
        "Nuno C. Santos",
        "Damien Ségransan",
        "Alejandro Suárez Mascareño",
        "Stéphane Udry",
        "Diana Valencia",
        "Gregg Wade",
        "Manuel Abreu",
        "José Luan A. Aguiar",
        "Khaled Al Moulla",
        "Guillaume Allain",
        "Romain Allart",
        "Jose Manuel Almenara",
        "Tomy Arial",
        "Hugues Auger",
        "Luc Bazinet",
        "Nicolas Blind",
        "David Bohlender",
        "Étienne Artigau",
        "Isabelle Boisse",
        "Anne Boucher",
        "Vincent Bourrier",
        "Sébastien Bovay",
        "Pedro Branco",
        "Christopher Broeg",
        "Denis Brousseau",
        "Alexandre Cabral",
        "Andres Carmona",
        "Yann Carteret",
        "Zalpha Challita",
        "David Charbonneau",
        "Bruno Chazelas",
        "Catherine A. Clark",
        "João Coelho",
        "Marion Cointepas",
        "Karen A. Collins",
        "Kevin I. Collins",
        "Uriel Conod",
        "Eduardo Cristo",
        "Ana Rita Costa Silva",
        "Antoine Darveau-Bernier",
        "Laurie Dauplaise",
        "Roseane de Lima Gomes",
        "João Faria",
        "Dasaev O. Fontinele",
        "Thierry Forveille",
        "Yolanda G. C. Frensch",
        "Jonathan Gagné",
        "Frédéric Genest",
        "Ludovic Genolet",
        "João Gomes da Silva",
        "Félix Gracia Témich",
        "Nicole Gromek",
        "Nolan Grieves",
        "Olivier Hernandez",
        "Melissa J. Hobson",
        "H. Jens Hoeijmakers",
        "Norbert Hubin",
        "Neil J. Cook",
        "Marziye Jafariyazani",
        "Farbod Jahandar",
        "Ray Jayawardhana",
        "Hans-Ulrich Käufl",
        "Dan Kerley",
        "Johann Kolb",
        "Vigneshwaran Krishnamurthy",
        "Benjamin Kung",
        "Pierre Larue",
        "Henry Leath",
        "Olivia Lim",
        "Allan M. Martins",
        "Elisabeth C. Matthews",
        "Jaymie Matthews",
        "Jean-Sébastien Mayer",
        "Stan Metchev",
        "Lina Messamah",
        "Yuri S. Messias",
        "Dany Mounzer",
        "Nicola Nari",
        "Ares Osborn",
        "Mathieu Ouellet",
        "Jon Otegi",
        "Luca Pasquini",
        "Vera M. Passegger",
        "Stefan Pelletier",
        "Céline Peroux",
        "Caroline Piaulet-Ghorayeb",
        "Emanuela Pompei",
        "Anne-Sophie Poulin-Girard",
        "José Luis Rasilla",
        "Vladimir Reshetov",
        "Jonathan Saint-Antoine",
        "Mirsad Sarajlic",
        "Ivo Saviane",
        "Robin Schnell",
        "Alex Segovia",
        "Julia Seidel",
        "Armin Silber",
        "Peter Sinclair",
        "Michael Sordet",
        "Danuta Sosnowska",
        "Avidaan Srivastava",
        "Márcio A. Teixeira",
        "Simon Thibault",
        "Philippe Vallée",
        "Thomas Vandal",
        "Valentina Vaulato",
        "Joost P. Wardenier",
        "Bachar Wehbe",
        "Ivan Wevers",
        "François Wildi",
        "Vincent Yariv",
        "Gérard Zins"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T10:04:56Z",
      "updated": "2026-01-14T10:04:56Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09330v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09330v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 9,
      "summary": "**Why It Matters**\n\nFinding planets beyond our solar system isn't just about cataloging distant worlds—it's about discovering places that might harbor life. Scientists are particularly excited about \"water worlds,\" planets where liquid water could exist in abundance. These ocean-rich planets represent some of our best hopes for finding life elsewhere in the universe. This new research takes us closer to that goal by providing the most detailed look yet at a nearby planetary system that may contain not one, but potentially three planets, including what appears to be a compelling water world candidate.\n\n**What They Did**\n\nAstronomers used two powerful instruments called NIRPS and HARPS to measure tiny wobbles in a nearby red dwarf star called GJ 3090, located just 22 light-years away—practically next door in cosmic terms. When planets orbit a star, they cause it to wobble slightly due to gravitational pull, like a dog walker being tugged by their pet. By measuring these wobbles with incredible precision, scientists can determine a planet's mass and orbit. The challenge is that stars themselves are active, rotating and producing their own signals that can masquerade as planets. The team used sophisticated computer models to separate real planetary signals from this stellar \"noise\"—like filtering out background chatter to hear a whispered conversation.\n\n**Key Findings**\n\nThe researchers confirmed that GJ 3090 b, a planet about twice Earth's width, weighs roughly 4.5 times as much as our planet and orbits its star every 2.85 days. Its relatively low density suggests it's likely a water world with a thick, volatile-rich atmosphere where water plays a major role. They also confirmed a second planet, GJ 3090 c, which is larger but doesn't cross in front of its star from our viewpoint. Most impressively, they detected this second planet despite its 16-day orbit being very close to the star's 18-day rotation period—a feat that previous methods couldn't accomplish.\n\n**Looking Forward**\n\nThis research showcases how new techniques can tease apart planetary signals from stellar activity, opening the door to discovering planets that were previously hidden. The potential water world GJ 3090 b becomes a prime target for future space telescopes that could analyze its atmosphere and search for signs of habitability. The success in detecting planets near stellar rotation periods means astronomers can now explore a previously inaccessible population of worlds, potentially doubling the number of discoverable planets around active stars.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Finding planets beyond our solar system isn't just about cataloging distant worlds—it's about discovering places that might harbor life. Scientists are particularly excited about \"water worlds,\" planets where liquid water could exist in abundance. These ocean-rich planets represent some of our best hopes for finding life elsewhere in the universe. This new research takes us closer to that goal by providing the most detailed look yet at a nearby planetary system that may contain not one, but potentially three planets, including what appears to be a compelling water world candidate.</p>\n<h4>What They Did</h4>\n<p>Astronomers used two powerful instruments called NIRPS and HARPS to measure tiny wobbles in a nearby red dwarf star called GJ 3090, located just 22 light-years away—practically next door in cosmic terms. When planets orbit a star, they cause it to wobble slightly due to gravitational pull, like a dog walker being tugged by their pet. By measuring these wobbles with incredible precision, scientists can determine a planet's mass and orbit. The challenge is that stars themselves are active, rotating and producing their own signals that can masquerade as planets. The team used sophisticated computer models to separate real planetary signals from this stellar \"noise\"—like filtering out background chatter to hear a whispered conversation.</p>\n<h4>Key Findings</h4>\n<p>The researchers confirmed that GJ 3090 b, a planet about twice Earth's width, weighs roughly 4.5 times as much as our planet and orbits its star every 2.85 days. Its relatively low density suggests it's likely a water world with a thick, volatile-rich atmosphere where water plays a major role. They also confirmed a second planet, GJ 3090 c, which is larger but doesn't cross in front of its star from our viewpoint. Most impressively, they detected this second planet despite its 16-day orbit being very close to the star's 18-day rotation period—a feat that previous methods couldn't accomplish.</p>\n<h4>Looking Forward</h4>\n<p>This research showcases how new techniques can tease apart planetary signals from stellar activity, opening the door to discovering planets that were previously hidden. The potential water world GJ 3090 b becomes a prime target for future space telescopes that could analyze its atmosphere and search for signs of habitability. The success in detecting planets near stellar rotation periods means astronomers can now explore a previously inaccessible population of worlds, potentially doubling the number of discoverable planets around active stars.</p>",
      "tweet_hook": {
        "hook": "A water world candidate sits just 22 light-years from Earth, dense enough to hold vast oceans beneath thick atmosphere",
        "claim": "New precision RV data confirms GJ 3090 b as compelling water-world with volatile-rich envelope",
        "evidence": "Mass refined to 4.52±0.47 Earth masses, density 2.40 g/cm³ suggests significant water fraction",
        "question": "Could sub-Neptunes like this retain liquid water under their thick atmospheres?"
      },
      "figure_url": "https://arxiv.org/html/2601.09330v1/x1.png"
    },
    {
      "id": "2601.08952v1",
      "title": "Formation and evolution of planetary systems",
      "abstract": "Various problems of the formation and evolution of planetary systems are studied. Most of the studies are devoted to the Solar System. The collapse of the presolar cloud and the accumulation of planets are studied. The author considers the formation of the Earth-Moon system, binary trans-Neptunian objects, and the axial rotations of planets. He discusses the formation of asteroid and trans-Neptunian belts, including the evolution of resonant asteroid orbits and the formation of the Kirkwood gaps in the asteroid belt. The book discusses the migration of bodies during the formation of the Solar System and at present, including a discussion of the delivery of icy bodies from beyond the ice line to the terrestrial planets and the formation of craters on the Moon. The Deep Impact mission is discussed; during this mission the impact module of the spacecraft collided with the comet Tempel 1. The book studies the migration of dust in the Solar System and the formation of the zodiacal belt, as well as the migration of bodies and dust particles ejected from the terrestrial planets and the Moon. The author considers the migration of bodies in some exoplanetary systems (Proxima Centauri, Trappist 1, and Gliese 581), the spectra of Earth-like exoplanets with different rotation periods, as well as the efficiency of exoplanet searches using microlensing observations with various telescopes. English text is only in the list of publications and in the contents. An English reader can look the contents to find an interesting section. In this section he can find the numbers for relative publications. Using these numbers and the list of publications, he can find the websites where he can upload free files with these publications, and then he can read relevant papers in English and can get more detailed information than in this book.",
      "authors": [
        "S. I. Ipatov"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T19:43:28Z",
      "updated": "2026-01-13T19:43:28Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08952v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08952v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 9,
      "summary": "**Why It Matters**\n\nHow did our Solar System come to be, and are other planetary systems out there similar to ours? These fundamental questions drive one of astronomy's most exciting frontiers. Understanding how planets form and evolve doesn't just satisfy our curiosity about cosmic origins—it's essential for the search for life beyond Earth. By studying how planets migrate, how asteroid belts form, and how dust moves through space, scientists can better predict where to find Earth-like worlds that might harbor life. This research also helps us understand whether our Solar System is typical or unusual, giving us crucial context for our place in the universe.\n\n**What They Did**\n\nThis comprehensive study tackled planetary formation like a cosmic detective story, examining clues from multiple sources. The researchers investigated how our Solar System began from a collapsing cloud of gas and dust—imagine a slowly spinning cotton ball gradually flattening into a disk with the Sun forming at its center. They traced how planets accumulated from tiny particles, much like snowballs growing as they roll downhill. The team also studied how planets and smaller bodies migrate over time, moving inward and outward like cars changing lanes on a cosmic highway. They examined everything from crater formation on the Moon to the famous Deep Impact mission that deliberately crashed into a comet. Additionally, they analyzed data from distant exoplanetary systems, including the nearby Proxima Centauri system and the fascinating Trappist-1 system with its seven Earth-sized worlds.\n\n**Key Findings**\n\nThe research revealed that planetary systems are incredibly dynamic, with constant movement and evolution over billions of years. They discovered how the gaps in our asteroid belt—called Kirkwood gaps—formed through gravitational resonances, like cosmic speed bumps that sweep debris away. The study showed how icy bodies from the outer Solar System delivered water to Earth and other inner planets, essentially providing the ingredients for life. In examining exoplanetary systems, they found that planets can have dramatically different rotation periods, which would create vastly different climates and day-night cycles compared to Earth.\n\n**Looking Forward**\n\nThis work opens exciting possibilities for finding potentially habitable worlds. By understanding how planetary systems evolve, astronomers can better target their searches for Earth-like planets in stable orbits around other stars. The research also suggests new ways to study exoplanets using microlensing—a technique that acts like a cosmic magnifying glass when one star passes in front of another. As next-generation telescopes come online, this foundational knowledge will be crucial for identifying worlds where life might flourish.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>How did our Solar System come to be, and are other planetary systems out there similar to ours? These fundamental questions drive one of astronomy's most exciting frontiers. Understanding how planets form and evolve doesn't just satisfy our curiosity about cosmic origins—it's essential for the search for life beyond Earth. By studying how planets migrate, how asteroid belts form, and how dust moves through space, scientists can better predict where to find Earth-like worlds that might harbor life. This research also helps us understand whether our Solar System is typical or unusual, giving us crucial context for our place in the universe.</p>\n<h4>What They Did</h4>\n<p>This comprehensive study tackled planetary formation like a cosmic detective story, examining clues from multiple sources. The researchers investigated how our Solar System began from a collapsing cloud of gas and dust—imagine a slowly spinning cotton ball gradually flattening into a disk with the Sun forming at its center. They traced how planets accumulated from tiny particles, much like snowballs growing as they roll downhill. The team also studied how planets and smaller bodies migrate over time, moving inward and outward like cars changing lanes on a cosmic highway. They examined everything from crater formation on the Moon to the famous Deep Impact mission that deliberately crashed into a comet. Additionally, they analyzed data from distant exoplanetary systems, including the nearby Proxima Centauri system and the fascinating Trappist-1 system with its seven Earth-sized worlds.</p>\n<h4>Key Findings</h4>\n<p>The research revealed that planetary systems are incredibly dynamic, with constant movement and evolution over billions of years. They discovered how the gaps in our asteroid belt—called Kirkwood gaps—formed through gravitational resonances, like cosmic speed bumps that sweep debris away. The study showed how icy bodies from the outer Solar System delivered water to Earth and other inner planets, essentially providing the ingredients for life. In examining exoplanetary systems, they found that planets can have dramatically different rotation periods, which would create vastly different climates and day-night cycles compared to Earth.</p>\n<h4>Looking Forward</h4>\n<p>This work opens exciting possibilities for finding potentially habitable worlds. By understanding how planetary systems evolve, astronomers can better target their searches for Earth-like planets in stable orbits around other stars. The research also suggests new ways to study exoplanets using microlensing—a technique that acts like a cosmic magnifying glass when one star passes in front of another. As next-generation telescopes come online, this foundational knowledge will be crucial for identifying worlds where life might flourish.</p>",
      "tweet_hook": {
        "hook": "Planet migration delivers icy bodies from beyond the ice line to Earth-like worlds in multiple star systems",
        "claim": "New models show how water reaches terrestrial planets in our Solar System and nearby exoplanets",
        "evidence": "Method: Migration analysis applied to Proxima Centauri, TRAPPIST-1, and Gliese 581 systems",
        "question": "Which exoplanetary systems are most likely to have water-rich terrestrial worlds?"
      },
      "figure_url": "https://images.unsplash.com/photo-1614724723656-457ac62c2c98?w=800&q=80"
    },
    {
      "id": "2601.08890v1",
      "title": "Planet-Host Stars Across the Galaxy in the 2040s",
      "abstract": "By the 2040s, the exoplanet field will have moved from the discovery of a few thousand planets to hundreds of thousands, thanks to Gaia DR5, TESS, PLATO, Roman, and their successors. At that stage, the key bottleneck will no longer be planet detection, but our ability to understand how planetary systems form, evolve, and diversify across different stellar and Galactic environments. To address this, we need a large-scale, high-resolution spectroscopic survey of planet-host stars, spanning a broad range of Galactic environments (thin and thick disks, bulge, halo, clusters, associations), and including a well-defined control sample of non-hosts. Such a survey must deliver homogeneous stellar parameters, detailed abundance determinations, ages, and kinematics for tens of thousands of hosts, extending to the faint magnitudes probed by future missions but are beyond the reach of existing and currently planned spectroscopic facilities.",
      "authors": [
        "M. Tsantaki",
        "K. Biazzo",
        "F. Zahra Majidi",
        "G. Tautvaisiene",
        "I. Busa"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "published": "2026-01-13T10:20:31Z",
      "updated": "2026-01-13T10:20:31Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08890v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08890v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 8,
      "summary": "**Why It Matters**\n\nWe're living through a golden age of planet hunting. In just a few decades, we've gone from knowing about nine planets (the ones in our solar system) to discovering thousands of worlds orbiting other stars. But here's the exciting part: we're about to find hundreds of thousands more. This isn't just about collecting cosmic stamps—understanding how planets form around different types of stars, in different parts of our galaxy, could help us answer one of humanity's biggest questions: how common are planets like Earth? And ultimately, how likely are we to find life elsewhere in the universe?\n\n**What They Did**\n\nThis research is actually a roadmap for the 2040s, when space telescopes and surveys will be discovering planets faster than we can properly study them. The authors are proposing something like a massive census of star families across our entire galaxy. Just as a demographic survey might study families in cities, suburbs, and rural areas to understand different lifestyle patterns, astronomers want to study planet-hosting stars in different galactic neighborhoods—from the crowded central bulge to the sparse outer halo. They're calling for detailed analysis of tens of thousands of stars, measuring everything from their chemical composition (what elements they contain) to their ages and how they move through space.\n\n**Key Findings**\n\nRather than presenting new discoveries, this paper identifies a crucial upcoming challenge: we'll soon have more planets than we know what to do with. The bottleneck won't be finding planets anymore—it will be understanding the deep connections between stars and their planetary families. Current surveys can only study the brightest stars in detail, but future planet-hunting missions will find worlds around much fainter, more distant stars that we can't easily analyze with today's technology.\n\n**Looking Forward**\n\nThis research points toward a future where we'll understand planets not as isolated curiosities, but as products of their galactic environment. By the 2040s, we might discover that stars in certain parts of the galaxy are more likely to host Earth-like worlds, fundamentally changing how we search for potentially habitable planets and life beyond our solar system.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>We're living through a golden age of planet hunting. In just a few decades, we've gone from knowing about nine planets (the ones in our solar system) to discovering thousands of worlds orbiting other stars. But here's the exciting part: we're about to find hundreds of thousands more. This isn't just about collecting cosmic stamps—understanding how planets form around different types of stars, in different parts of our galaxy, could help us answer one of humanity's biggest questions: how common are planets like Earth? And ultimately, how likely are we to find life elsewhere in the universe?</p>\n<h4>What They Did</h4>\n<p>This research is actually a roadmap for the 2040s, when space telescopes and surveys will be discovering planets faster than we can properly study them. The authors are proposing something like a massive census of star families across our entire galaxy. Just as a demographic survey might study families in cities, suburbs, and rural areas to understand different lifestyle patterns, astronomers want to study planet-hosting stars in different galactic neighborhoods—from the crowded central bulge to the sparse outer halo. They're calling for detailed analysis of tens of thousands of stars, measuring everything from their chemical composition (what elements they contain) to their ages and how they move through space.</p>\n<h4>Key Findings</h4>\n<p>Rather than presenting new discoveries, this paper identifies a crucial upcoming challenge: we'll soon have more planets than we know what to do with. The bottleneck won't be finding planets anymore—it will be understanding the deep connections between stars and their planetary families. Current surveys can only study the brightest stars in detail, but future planet-hunting missions will find worlds around much fainter, more distant stars that we can't easily analyze with today's technology.</p>\n<h4>Looking Forward</h4>\n<p>This research points toward a future where we'll understand planets not as isolated curiosities, but as products of their galactic environment. By the 2040s, we might discover that stars in certain parts of the galaxy are more likely to host Earth-like worlds, fundamentally changing how we search for potentially habitable planets and life beyond our solar system.</p>",
      "tweet_hook": {
        "hook": "We'll know hundreds of thousands of exoplanets by the 2040s, but won't understand how they actually form",
        "claim": "Planet detection bottleneck will shift to understanding formation across different Galactic environments",
        "evidence": "Method: Large-scale spectroscopic survey spanning thin/thick disks, bulge, halo, and clusters",
        "question": "Which Galactic environment do you think produces the most Earth-like planets?"
      },
      "figure_url": "https://arxiv.org/html/2601.08890v1/exoplanets_future.png"
    },
    {
      "id": "2601.09492v1",
      "title": "Demographics of Close-In TESS Exoplanets Orbiting FGK Main-sequence Stars",
      "abstract": "Understanding the demographics of close-in planets is crucial for insights into exoplanet formation and evolution. We present a detailed analysis of occurrence rates for close-in (0.5-16 day) planets with radii between 2 and 20$\\,R_{\\oplus}$ around FGK main-sequence stars. Our study uses a comprehensive sample from four years of TESS Science Processing Operations Center full-frame image data cross-matched with Gaia, analysed through our rigorous detection, vetting, and validation pipeline. Using high-confidence planet candidates, we apply a hierarchical Bayesian model to determine occurrence rates in the two-dimensional orbital period-radius plane. Our results are presented using 10-by-10 bins across the period-radius parameter space, offering unprecedented resolution and statistical precision. We find an overall occurrence rate of $9.4^{+0.7}_{-0.6}\\%$. When using identical binning, our occurrence rate posteriors distributions align with Kepler's but have a magnitude smaller uncertainties on average. For hot Jupiters, we estimate the overall occurrence rate of $0.39^{+0.03}_{-0.02}\\%$. This value is consistent with the previous Kepler FGK-type result within $1σ$. We find an overall occurrence rate of Neptunian desert planets of $0.08\\pm0.01\\%$, to our knowledge the first such determination. Additionally, in a volume-limited Gaia subsample within 100 pc in the same parameter region, we measure an overall planet occurrence rate of $15.4^{+1.6}_{-1.5}\\%$ and a hot Jupiter occurrence rate of $0.42^{+0.16}_{-0.12}\\%$. Our results establishes an improved foundation for constraining theoretical models of exoplanet populations.",
      "authors": [
        "Kaiming Cui",
        "David J. Armstrong",
        "Andreas Hadjigeorghiou",
        "Marina Lafarga",
        "Vedad Kunovac",
        "Lauren Doyle",
        "Luis Agustín Nieto",
        "Rodrigo F. Díaz"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T13:59:49Z",
      "updated": "2026-01-14T13:59:49Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09492v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09492v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 7,
      "summary": "**Why It Matters**\n\nFor centuries, we wondered if planets like Earth were rare cosmic accidents or common features of the universe. Thanks to powerful space telescopes, we now know that planets are everywhere—but we're still figuring out what kinds of planets are most common and where they tend to form. This research tackles a particularly intriguing puzzle: the strange worlds that orbit incredibly close to their stars, completing full \"years\" in just days or weeks. These scorching planets, which include everything from super-sized Earths to gas giants larger than Jupiter, hold crucial clues about how planetary systems form and evolve. Understanding their abundance helps us piece together the story of planet formation—including how rare or common Earth-like worlds might be.\n\n**What They Did**\n\nThe researchers analyzed four years of data from TESS (Transiting Exoplanet Survey Satellite), a space telescope that watches for the tiny dimming that occurs when a planet passes in front of its star. Think of it like watching for the shadow of a moth crossing a distant streetlight. They focused on planets orbiting sun-like stars and took orbits lasting between half a day and 16 days—imagine worlds where a \"year\" is shorter than a typical vacation. The team then used sophisticated statistical methods to account for the planets they might have missed, similar to how pollsters adjust their samples to represent the broader population. This allowed them to calculate what percentage of sun-like stars actually host these close-orbiting worlds.\n\n**Key Findings**\n\nThe results reveal that close-in planets are surprisingly common. Overall, about 9.4% of sun-like stars host at least one planet orbiting closer than Mercury does to our Sun. The famous \"hot Jupiters\"—gas giants that complete their orbits in days—appear around roughly 0.4% of stars, confirming previous estimates. Perhaps most intriguingly, they found that planets in the so-called \"Neptunian desert\"—a mysterious gap where Neptune-sized planets seem to avoid forming—occur around just 0.08% of stars, providing the first precise measurement of this cosmic rarity.\n\n**Looking Forward**\n\nThese findings provide astronomers with a detailed census that will help refine theories about how planets form and migrate to their final orbits. The data suggests that the processes creating close-in planets are remarkably consistent across our galaxy. This work sets the stage for future missions that will study these worlds' atmospheres and compositions, potentially revealing how planetary systems evolve and what conditions might favor the formation of habitable worlds like Earth.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>For centuries, we wondered if planets like Earth were rare cosmic accidents or common features of the universe. Thanks to powerful space telescopes, we now know that planets are everywhere—but we're still figuring out what kinds of planets are most common and where they tend to form. This research tackles a particularly intriguing puzzle: the strange worlds that orbit incredibly close to their stars, completing full \"years\" in just days or weeks. These scorching planets, which include everything from super-sized Earths to gas giants larger than Jupiter, hold crucial clues about how planetary systems form and evolve. Understanding their abundance helps us piece together the story of planet formation—including how rare or common Earth-like worlds might be.</p>\n<h4>What They Did</h4>\n<p>The researchers analyzed four years of data from TESS (Transiting Exoplanet Survey Satellite), a space telescope that watches for the tiny dimming that occurs when a planet passes in front of its star. Think of it like watching for the shadow of a moth crossing a distant streetlight. They focused on planets orbiting sun-like stars and took orbits lasting between half a day and 16 days—imagine worlds where a \"year\" is shorter than a typical vacation. The team then used sophisticated statistical methods to account for the planets they might have missed, similar to how pollsters adjust their samples to represent the broader population. This allowed them to calculate what percentage of sun-like stars actually host these close-orbiting worlds.</p>\n<h4>Key Findings</h4>\n<p>The results reveal that close-in planets are surprisingly common. Overall, about 9.4% of sun-like stars host at least one planet orbiting closer than Mercury does to our Sun. The famous \"hot Jupiters\"—gas giants that complete their orbits in days—appear around roughly 0.4% of stars, confirming previous estimates. Perhaps most intriguingly, they found that planets in the so-called \"Neptunian desert\"—a mysterious gap where Neptune-sized planets seem to avoid forming—occur around just 0.08% of stars, providing the first precise measurement of this cosmic rarity.</p>\n<h4>Looking Forward</h4>\n<p>These findings provide astronomers with a detailed census that will help refine theories about how planets form and migrate to their final orbits. The data suggests that the processes creating close-in planets are remarkably consistent across our galaxy. This work sets the stage for future missions that will study these worlds' atmospheres and compositions, potentially revealing how planetary systems evolve and what conditions might favor the formation of habitable worlds like Earth.</p>",
      "tweet_hook": {
        "hook": "Only 1 in 250 Sun-like stars hosts a hot Jupiter, but 1 in 10 has close-in planets overall",
        "claim": "TESS data reveals precise occurrence rates for close-in exoplanets with 10x better precision than Kepler",
        "evidence": "9.4% of FGK stars have planets between 0.5-16 days; hot Jupiters at 0.39%; Neptunian desert at 0.08%",
        "question": "Why are hot Jupiters so rare when smaller close-in planets are common?"
      },
      "figure_url": "https://arxiv.org/html/2601.09492v1/stellar-temp.png"
    },
    {
      "id": "2601.09438v1",
      "title": "Mass estimates of the young TOI-451 transiting planets: Multidimensional Gaussian Process on stellar spectroscopic and photometric signals",
      "abstract": "The young TOI-451 planetary system, aged 125 Myr, provides a unique opportunity to test theories of planetary internal structures and atmospheric mass loss through examination of its three transiting planets. We present an exhaustive photometric and spectroscopic follow-up to determine the orbital and physical properties of the system. We perform multidimensional Gaussian Process regression with the code pyaneti on spectroscopic time-series and NGTS/LCO light curves to disentangle the stellar and planetary signal in ESPRESSO radial velocities. We show how contemporaneous photometry serves as an activity indicator to inform RV modelling within a multidimensional Gaussian Processes framework. We argue that this can be exploited when spectroscopic observations are adversely affected by low signal-to-noise and/or poor sampling. We estimate the Doppler semi-amplitudes of Kb = 2.6(+1.1,-1.2) m/s, Kc = 1.2(+1.0,-0.8) m/s and Kd = 2.7 +/- 1.2 m/s. This translates into 2-sigma mass estimates for TOI-451 b and d of Mb = 4.7(+2.1,-2.2) Earth masses and Md = 10.2(+4.6,-4.5) Earth masses, as well as a mass upper limit for TOI-451 c of Mc < 11.5 Earth masses. The derived planetary properties suggest that planets c and d contain significant hydrogen-rich envelopes. The inferred parameters of TOI-451 b are consistent with either a rocky world that still retains a small hydrogen envelope or a water world. These insights make the TOI-451 system an ideal laboratory for future follow-up studies aimed at measuring atmospheric compositions, detecting atmospheric mass-loss signatures, and further exploring planetary formation and evolution processes.",
      "authors": [
        "Oscar Barragán",
        "Manuel Mallorquín",
        "Jorge Fernández-Fernández",
        "Faith Hawthorn",
        "Alix V. Freckelton",
        "Marina Lafarga",
        "Michael Cretignier",
        "Yoshi N. E. Eschen",
        "Samuel Gill",
        "Víctor J. S. Béjar",
        "Nicolas Lodieu",
        "Haochuan Yu",
        "Thomas G. Wilson",
        "David Anderson",
        "Ioannis Apergis",
        "Matthew Battley",
        "Edward M. Bryant",
        "Pía Cortés-Zuleta",
        "Edward Gillen",
        "James S. Jenkins",
        "Baptiste Klein",
        "James McCormac",
        "Annabella Meech",
        "Erik Meier-Valdés",
        "Maximiliano Moyano",
        "Annelies Mortier",
        "Felipe Murgas",
        "Louise D. Nielsen",
        "Suman Saha",
        "José I. Vines",
        "Richard West",
        "Peter J. Wheatley",
        "Suzanne Aigrain"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T12:39:48Z",
      "updated": "2026-01-14T12:39:48Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09438v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09438v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 5,
      "summary": "**Why It Matters**\n\nImagine catching a glimpse of our solar system when it was just a baby—that's essentially what astronomers have done with TOI-451, a planetary system only 125 million years old. While that sounds ancient, it's practically infantile compared to our 4.6-billion-year-old solar system. This cosmic nursery gives us a rare window into how planets evolve, lose their atmospheres, and transform over time. Understanding these young worlds helps answer fundamental questions: How do planets like Earth form? What makes some planets keep their atmospheres while others lose them to space? By studying TOI-451, we're essentially looking at planetary adolescence—a crucial period that shaped the worlds we see today.\n\n**What They Did**\n\nThe research team used advanced telescopes to measure tiny wobbles in the star TOI-451 as its three planets tug on it gravitationally—like watching a person being gently pulled back and forth by invisible dance partners. This technique, called the radial velocity method, reveals how massive each planet is. The challenge was separating the planets' gravitational signals from the star's own natural brightness fluctuations, which can mask planetary signatures. To solve this, the researchers used sophisticated computer modeling that simultaneously analyzed the star's light patterns and its wobbling motion, essentially teaching their software to distinguish between stellar hiccups and genuine planetary pulls.\n\n**Key Findings**\n\nThe team successfully weighed all three planets in this young system. The innermost planet, TOI-451 b, weighs about 4.7 times more than Earth and could be either a rocky world with a thin atmosphere or a \"water world\" rich in H2O. The middle planet, TOI-451 c, proved more elusive—they could only establish it weighs less than 11.5 Earth masses. The outermost planet, TOI-451 d, tips the scales at roughly 10 Earth masses and likely sports a thick, hydrogen-rich atmosphere that makes it puffy and Neptune-like.\n\n**Looking Forward**\n\nThis research transforms TOI-451 into a cosmic laboratory for studying planetary evolution. Since these worlds are young, astronomers can potentially observe atmospheric loss in real-time and test theories about how planets shed their gaseous envelopes. Future observations with advanced telescopes could reveal the atmospheric compositions of these planets and catch them in the act of losing gas to space, providing unprecedented insights into the forces that sculpt planetary systems over cosmic time.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine catching a glimpse of our solar system when it was just a baby—that's essentially what astronomers have done with TOI-451, a planetary system only 125 million years old. While that sounds ancient, it's practically infantile compared to our 4.6-billion-year-old solar system. This cosmic nursery gives us a rare window into how planets evolve, lose their atmospheres, and transform over time. Understanding these young worlds helps answer fundamental questions: How do planets like Earth form? What makes some planets keep their atmospheres while others lose them to space? By studying TOI-451, we're essentially looking at planetary adolescence—a crucial period that shaped the worlds we see today.</p>\n<h4>What They Did</h4>\n<p>The research team used advanced telescopes to measure tiny wobbles in the star TOI-451 as its three planets tug on it gravitationally—like watching a person being gently pulled back and forth by invisible dance partners. This technique, called the radial velocity method, reveals how massive each planet is. The challenge was separating the planets' gravitational signals from the star's own natural brightness fluctuations, which can mask planetary signatures. To solve this, the researchers used sophisticated computer modeling that simultaneously analyzed the star's light patterns and its wobbling motion, essentially teaching their software to distinguish between stellar hiccups and genuine planetary pulls.</p>\n<h4>Key Findings</h4>\n<p>The team successfully weighed all three planets in this young system. The innermost planet, TOI-451 b, weighs about 4.7 times more than Earth and could be either a rocky world with a thin atmosphere or a \"water world\" rich in H2O. The middle planet, TOI-451 c, proved more elusive—they could only establish it weighs less than 11.5 Earth masses. The outermost planet, TOI-451 d, tips the scales at roughly 10 Earth masses and likely sports a thick, hydrogen-rich atmosphere that makes it puffy and Neptune-like.</p>\n<h4>Looking Forward</h4>\n<p>This research transforms TOI-451 into a cosmic laboratory for studying planetary evolution. Since these worlds are young, astronomers can potentially observe atmospheric loss in real-time and test theories about how planets shed their gaseous envelopes. Future observations with advanced telescopes could reveal the atmospheric compositions of these planets and catch them in the act of losing gas to space, providing unprecedented insights into the forces that sculpt planetary systems over cosmic time.</p>",
      "tweet_hook": {
        "hook": "Three planets around a 125-million-year-old star reveal how worlds lose their atmospheres in real-time",
        "claim": "First mass measurements of planets in the young TOI-451 system show active envelope evolution",
        "evidence": "RV measurements found TOI-451 d has 10.2 Earth masses with a thick hydrogen atmosphere",
        "question": "Which planet will lose its atmosphere first - the inner rocky world or outer giants?"
      },
      "figure_url": "https://arxiv.org/html/2601.09438v1/x1.png"
    },
    {
      "id": "2601.11313v1",
      "title": "Aligned, Misaligned and Polar Orbits of Hot Jupiters: Measuring Spin-Orbit Angles via Doppler Tomography with HARPS-N",
      "abstract": "Although the migration of hot Jupiters is not yet fully understood, measurements of the projected spin-orbit angle λ help shed light on the processes involved. Here we present Doppler tomography of three known hot Jupiters to determine their λ orientation: HAT-P-49 b, HAT-P-57A b, and XO-3A b. Our analysis explores the impact of cross-correlation processing methods on the detectability and characterization of the planet's Doppler shadow using up to three independent routines for cross-correlation functions extraction; those being: Yabi, iSpec and IRAF. After accounting for differences among the results obtained with the various routines, we report: first, the HAT-P-49 system is a case of a hot Jupiter on a polar orbit with λ=-85.3{\\pm}1.7°, second, HAT-P-57A indicates practically no deviation of the planet's projected orbit from the host's equatorial plane with λ=-0.4^{+1.4}_{-1.9}°, and third, the XO-3A system with the measured value of λ=38{+3}_{-4}° lies in between an aligned and a perpendicular orientation, which is a less populated region of the spin-orbit distribution. Our findings highlight both the diversity of spin-orbit angles among close-in giant planets and the potential discrepancies in their measurement that can arise from different approaches to constructing the cross-correlation functions.",
      "authors": [
        "Z. Balkóová",
        "J. Žák",
        "M. Skarka",
        "E. Knudstrup",
        "P. Gajdoš",
        "A. Bignamini",
        "P. Kabáth"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-16T14:10:19Z",
      "updated": "2026-01-16T14:10:19Z",
      "pdf_link": "https://arxiv.org/pdf/2601.11313v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.11313v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 4,
      "summary": "**Why It Matters**\n\nImagine if Earth orbited the Sun backwards, or if our planet looped around our star's poles instead of its equator. While that sounds like science fiction, astronomers are discovering that such bizarre arrangements are surprisingly common among planets orbiting other stars. These discoveries are revolutionizing our understanding of how planetary systems form and evolve, and they're making us reconsider just how special—or typical—our own solar system might be. By studying these cosmic oddballs, scientists can piece together the violent histories that shaped planetary systems across the galaxy, helping us understand whether Earth-like worlds and the conditions for life are rare cosmic accidents or natural outcomes of planet formation.\n\n**What They Did**\n\nThe researchers used a sophisticated technique called Doppler tomography to study three \"hot Jupiters\"—massive planets similar to Jupiter but orbiting extremely close to their stars, completing full orbits in just days rather than years. Think of it like using a cosmic stethoscope: when these planets pass in front of their stars, they block specific colors of starlight in a way that reveals which direction they're traveling. By carefully analyzing this \"shadow\" in the starlight using three different computer programs, the team could determine whether each planet orbits in the same direction as its star spins (like planets in our solar system) or in some other, more chaotic arrangement. They used data from HARPS-N, a highly sensitive instrument designed to detect the tiniest changes in starlight.\n\n**Key Findings**\n\nThe three planets revealed dramatically different stories. HAT-P-49 b shocked researchers by orbiting almost perfectly over its star's poles—imagine a planet traveling from the Sun's north pole to south pole instead of around its equator. HAT-P-57A b behaved more like planets in our solar system, orbiting neatly aligned with its star's rotation. XO-3A b fell somewhere in between, tilted at a 38-degree angle that represents a less common but intriguing middle ground. These measurements were remarkably precise, with uncertainties of just a few degrees.\n\n**Looking Forward**\n\nThese findings highlight how diverse planetary systems can be, suggesting that the calm, orderly arrangement of our solar system may be more of an exception than the rule. The research also revealed that different analysis methods can produce varying results, pointing to the need for more standardized approaches in exoplanet research. As astronomers discover more of these tilted worlds, they're building a clearer picture of the chaotic processes that can reshape entire planetary systems—knowledge that will prove crucial as we search for potentially habitable worlds and try to understand how common Earth-like conditions might be throughout the universe.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine if Earth orbited the Sun backwards, or if our planet looped around our star's poles instead of its equator. While that sounds like science fiction, astronomers are discovering that such bizarre arrangements are surprisingly common among planets orbiting other stars. These discoveries are revolutionizing our understanding of how planetary systems form and evolve, and they're making us reconsider just how special—or typical—our own solar system might be. By studying these cosmic oddballs, scientists can piece together the violent histories that shaped planetary systems across the galaxy, helping us understand whether Earth-like worlds and the conditions for life are rare cosmic accidents or natural outcomes of planet formation.</p>\n<h4>What They Did</h4>\n<p>The researchers used a sophisticated technique called Doppler tomography to study three \"hot Jupiters\"—massive planets similar to Jupiter but orbiting extremely close to their stars, completing full orbits in just days rather than years. Think of it like using a cosmic stethoscope: when these planets pass in front of their stars, they block specific colors of starlight in a way that reveals which direction they're traveling. By carefully analyzing this \"shadow\" in the starlight using three different computer programs, the team could determine whether each planet orbits in the same direction as its star spins (like planets in our solar system) or in some other, more chaotic arrangement. They used data from HARPS-N, a highly sensitive instrument designed to detect the tiniest changes in starlight.</p>\n<h4>Key Findings</h4>\n<p>The three planets revealed dramatically different stories. HAT-P-49 b shocked researchers by orbiting almost perfectly over its star's poles—imagine a planet traveling from the Sun's north pole to south pole instead of around its equator. HAT-P-57A b behaved more like planets in our solar system, orbiting neatly aligned with its star's rotation. XO-3A b fell somewhere in between, tilted at a 38-degree angle that represents a less common but intriguing middle ground. These measurements were remarkably precise, with uncertainties of just a few degrees.</p>\n<h4>Looking Forward</h4>\n<p>These findings highlight how diverse planetary systems can be, suggesting that the calm, orderly arrangement of our solar system may be more of an exception than the rule. The research also revealed that different analysis methods can produce varying results, pointing to the need for more standardized approaches in exoplanet research. As astronomers discover more of these tilted worlds, they're building a clearer picture of the chaotic processes that can reshape entire planetary systems—knowledge that will prove crucial as we search for potentially habitable worlds and try to understand how common Earth-like conditions might be throughout the universe.</p>",
      "tweet_hook": {
        "hook": "Hot Jupiter orbits backwards around its star's pole - complete opposite of how planets usually form",
        "claim": "HAT-P-49 b has polar retrograde orbit, challenging planet migration theories",
        "evidence": "Doppler tomography measured spin-orbit angle λ=-85.3±1.7° using HARPS-N spectrograph",
        "question": "What migration mechanism can flip a hot Jupiter into such an extreme orbit?"
      },
      "figure_url": "https://arxiv.org/html/2601.11313v1/shadow_YABI_HAT-P-49.png"
    },
    {
      "id": "2601.10450v1",
      "title": "TOI-3862 b: A dense super-Neptune deep in the hot Neptune desert",
      "abstract": "The structure and evolution of close-in exoplanets are shaped by atmospheric loss and migration processes, which give rise to key population features such as the hot Neptune desert, ridge, and savanna - regions of the period-radius space whose boundaries offer critical insights into planetary formation and survival. As part of the KESPRINT collaboration, we selected the TESS transiting planet candidate TOI-3862.01 for radial velocity follow-up to confirm its planetary nature and characterize its mass and bulk properties. This planet candidate is of particular interest due to its position in the middle of the hot Neptune desert, making it a valuable probe for testing theories of planet migration and atmospheric loss. We confirmed the planetary nature and determined the mass of TOI-3862.01 (hereinafter TOI-3862b) by performing a joint fit with both transit and radial velocity data, precisely characterizing the bulk properties of this planet. TOI-3862b is a super-Neptune on a 1.56-day orbit around a Sun-like star with an effective temperature of 5300$\\pm$50K. It has a mass of 53.7$_{-2.9}^{+2.8}$ M$_{\\oplus}$ and a radius of 5.53$\\pm$0.18 R$_{\\oplus}$, corresponding to a density of 1.7$\\pm$0.2 g/cm^3. This places it among the rare population of hot and dense super-Neptune desert planets. TOI-3862b, residing deep in the hot Neptune desert, represents a rare occurrence in an otherwise sparsely populated region, offering a valuable opportunity to probe the processes that may allow planets to survive in such environments.",
      "authors": [
        "Ilaria Carleo",
        "Amadeo Castro-González",
        "Enric Pallé",
        "Felipe Murgas",
        "Grzegorz Nowak",
        "Gaia Lacedelli",
        "Thomas Masseron",
        "Emily W. Wong",
        "Patrick Eggenberger",
        "Vincent Bourrier",
        "Dawid Jankowski",
        "Krzysztof Goździewski",
        "Douglas R. Alves",
        "James S. Jenkins",
        "Sergio Messina",
        "Keivan G. Stassun",
        "Jose I. Vines",
        "Matteo Brogi",
        "David R. Ciardi",
        "Catherine A. Clark",
        "William Cochran",
        "Karen A. Collins",
        "Hans J. Deeg",
        "Elise Furlan",
        "Davide Gandolfi",
        "Samuel Geraldía González",
        "Artie P. Hatzes",
        "Coel Hellier",
        "Steve B. Howell",
        "Judith Korth",
        "Jorge Lillo-Box",
        "John H. Livingston",
        "Jaume Orell-Miquel",
        "Carina M. Persson",
        "Seth Redfield",
        "Boris Safonov",
        "David Baker",
        "Rafael Delfin Barrena Delgado",
        "Allyson Bieryla",
        "Andrew Boyle",
        "Pau Bosch-Cabot",
        "Núria Casasayas Barris",
        "Stavros Chairetas",
        "Jerome P. de Leon",
        "Izuru Fukuda",
        "Akihiko Fukui",
        "Pere Guerra",
        "Kai Ikuta",
        "Kiyoe Kawauchi",
        "Emil Knudstrup",
        "Florence Libotte",
        "Michael B. Lund",
        "Rafael Luque",
        "Eduardo Lorenzo Martín Guerrero de Escalante",
        "Bob Massey",
        "Edward J. Michaels",
        "Giuseppe Morello",
        "Norio Narita",
        "Hannu Parvianien",
        "Richard P. Schwarz",
        "Avi Shporer",
        "Monika Stangret",
        "Noriharu Watanabe",
        "Cristilyn N. Watkins"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T14:39:32Z",
      "updated": "2026-01-15T14:39:32Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10450v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10450v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 3,
      "summary": "**Why It Matters**\n\nImagine trying to understand how neighborhoods form by studying only the houses that survived natural disasters. That's essentially what astronomers face when studying planets close to their stars. Most planets that orbit extremely close to their host stars have either been stripped down to rocky cores or puffed up into gas giants—creating what scientists call the \"hot Neptune desert,\" a region where medium-sized planets are mysteriously rare. Finding planets in this cosmic wasteland helps us understand the violent processes that shape planetary systems, including our own. By studying these survivors, we gain crucial insights into how planets migrate, evolve, and sometimes endure in the harshest environments imaginable.\n\n**What They Did**\n\nResearchers used NASA's planet-hunting telescope TESS (Transiting Exoplanet Survey Satellite) to spot a potential planet candidate called TOI-3862.01. When a planet crosses in front of its star from our perspective, it creates a tiny dimming—like a moth passing in front of a streetlight. But seeing this dimming isn't enough to confirm it's actually a planet. The team then used ground-based telescopes to measure how the planet's gravity tugs on its star, causing the star to wobble slightly. By combining both techniques—watching the planet block starlight and measuring the star's wobble—they could determine both the planet's size and mass, giving them a complete picture of this cosmic oddball.\n\n**Key Findings**\n\nTOI-3862b is truly exceptional. This \"super-Neptune\" is about 5.5 times wider than Earth but packs 54 times Earth's mass, making it surprisingly dense for a planet of its type. It races around its Sun-like star in just 1.56 days—imagine a year lasting less than two Earth days! The planet sits right in the middle of the hot Neptune desert, where planets this size simply shouldn't exist. Its density suggests it's managed to hold onto a substantial atmosphere despite being bombarded by intense radiation from its nearby star.\n\n**Looking Forward**\n\nThis discovery challenges our understanding of planetary survival. How did TOI-3862b keep its thick atmosphere in such a hostile environment? Future observations with powerful telescopes like the James Webb Space Telescope could reveal the composition of its atmosphere, potentially showing us new ways planets can endure extreme conditions. Each planet found in the hot Neptune desert helps refine our models of planetary evolution and might even inform our search for habitable worlds in other star systems.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to understand how neighborhoods form by studying only the houses that survived natural disasters. That's essentially what astronomers face when studying planets close to their stars. Most planets that orbit extremely close to their host stars have either been stripped down to rocky cores or puffed up into gas giants—creating what scientists call the \"hot Neptune desert,\" a region where medium-sized planets are mysteriously rare. Finding planets in this cosmic wasteland helps us understand the violent processes that shape planetary systems, including our own. By studying these survivors, we gain crucial insights into how planets migrate, evolve, and sometimes endure in the harshest environments imaginable.</p>\n<h4>What They Did</h4>\n<p>Researchers used NASA's planet-hunting telescope TESS (Transiting Exoplanet Survey Satellite) to spot a potential planet candidate called TOI-3862.01. When a planet crosses in front of its star from our perspective, it creates a tiny dimming—like a moth passing in front of a streetlight. But seeing this dimming isn't enough to confirm it's actually a planet. The team then used ground-based telescopes to measure how the planet's gravity tugs on its star, causing the star to wobble slightly. By combining both techniques—watching the planet block starlight and measuring the star's wobble—they could determine both the planet's size and mass, giving them a complete picture of this cosmic oddball.</p>\n<h4>Key Findings</h4>\n<p>TOI-3862b is truly exceptional. This \"super-Neptune\" is about 5.5 times wider than Earth but packs 54 times Earth's mass, making it surprisingly dense for a planet of its type. It races around its Sun-like star in just 1.56 days—imagine a year lasting less than two Earth days! The planet sits right in the middle of the hot Neptune desert, where planets this size simply shouldn't exist. Its density suggests it's managed to hold onto a substantial atmosphere despite being bombarded by intense radiation from its nearby star.</p>\n<h4>Looking Forward</h4>\n<p>This discovery challenges our understanding of planetary survival. How did TOI-3862b keep its thick atmosphere in such a hostile environment? Future observations with powerful telescopes like the James Webb Space Telescope could reveal the composition of its atmosphere, potentially showing us new ways planets can endure extreme conditions. Each planet found in the hot Neptune desert helps refine our models of planetary evolution and might even inform our search for habitable worlds in other star systems.</p>",
      "tweet_hook": {
        "hook": "A super-Neptune survived in the \"hot Neptune desert\" where planets aren't supposed to exist",
        "claim": "TOI-3862b challenges our understanding of how close-in planets avoid atmospheric destruction",
        "evidence": "Dense 1.7 g/cm³ planet orbits every 1.56 days in the sparsely populated hot Neptune desert region",
        "question": "What mechanisms allow some Neptunes to keep their atmospheres so close to their stars?"
      },
      "figure_url": "https://arxiv.org/html/2601.10450v1/x1.png"
    },
    {
      "id": "2601.10598v1",
      "title": "A young progenitor for the most common planetary systems in the Galaxy",
      "abstract": "The Galaxy's most common known planetary systems have several Earth-to-Neptune-size planets in compact orbits. At small orbital separations, larger planets are less common than their smaller counterparts by an order of magnitude. The young star V1298 Tau hosts one such compact planetary system, albeit with four planets that are uncommonly large (5 to 10 Earth radii). The planets form a chain of near-resonances that result in transit-timing variations of several hours. Here we present a multi-year campaign to characterize this system with transit-timing variations, a method insensitive to the intense magnetic activity of the star. Through targeted observations, we first resolved the previously unknown orbital period of the outermost planet. The full 9-year baseline from these and archival data then enabled robust determination of the masses and orbital parameters for all four planets. We find the planets have low, sub-Neptune masses and nearly circular orbits, implying a dynamically tranquil history. Their low masses and large radii indicate that the inner planets underwent a period of rapid cooling immediately after dispersal of the protoplanetary disk. Still, they are much less dense than mature planets of comparable size. We predict the planets will contract to 1.5-4.0 Earth radii and join the population of super-Earths and sub-Neptunes that nature produces in abundance.",
      "authors": [
        "John H. Livingston",
        "Erik A. Petigura",
        "Trevor J. David",
        "Kento Masuda",
        "James Owen",
        "David Nesvorný",
        "Konstantin Batygin",
        "Jerome de Leon",
        "Mayuko Mori",
        "Kai Ikuta",
        "Akihiko Fukui",
        "Noriharu Watanabe",
        "Jaume Orell Miquel",
        "Felipe Murgas",
        "Hannu Parviainen",
        "Judith Korth",
        "Florence Libotte",
        "Néstor Abreu García",
        "Pedro Pablo Meni Gallardo",
        "Norio Narita",
        "Enric Pallé",
        "Motohide Tamura",
        "Atsunori Yonehara",
        "Andrew Ridden-Harper",
        "Allyson Bieryla",
        "Alessandro A. Trani",
        "Eric E. Mamajek",
        "David R. Ciardi",
        "Varoujan Gorjian",
        "Lynne A. Hillenbrand",
        "Luisa M. Rebull",
        "Elisabeth R. Newton",
        "Andrew W. Mann",
        "Andrew Vanderburg",
        "Guðmundur Stefánsson",
        "Suvrath Mahadevan",
        "Caleb Cañas",
        "Joe Ninan",
        "Jesus Higuera",
        "Kamen Todorov",
        "Jean-Michel Désert",
        "Lorenzo Pino"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T17:07:23Z",
      "updated": "2026-01-15T17:07:23Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10598v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10598v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 2,
      "summary": "**Why It Matters**\n\nMost planetary systems in our galaxy look nothing like our own solar system. While we have small, rocky planets close to the Sun and gas giants farther out, the most common arrangement elsewhere features several medium-sized planets packed tightly around their star. Understanding how these systems form and evolve helps us grasp how planetary systems—including potentially habitable ones—come to be. This research gives us a rare glimpse at what these common systems look like in their youth, before billions of years of evolution shape their final form.\n\n**What They Did**\n\nThe researchers studied a young star called V1298 Tau, which hosts four unusually puffy planets. Because this star is extremely active—constantly flaring and changing brightness—traditional methods of studying planets wouldn't work. Instead, they used a clever technique called transit timing variations. Imagine planets as runners on a track, each in their own lane but gravitationally tugging on each other as they pass by. These tiny tugs cause the planets to arrive at their \"finish line\" (crossing in front of their star) slightly early or late. By precisely timing these transits over nine years, the team could weigh each planet and map their orbits without interference from the star's chaotic behavior.\n\n**Key Findings**\n\nThe four planets are surprisingly light for their size—each about 5 to 10 times wider than Earth but with masses closer to Neptune than Jupiter. They're essentially cosmic balloons, puffed up with thick atmospheres. The planets orbit in nearly perfect circles and maintain a delicate gravitational dance, suggesting their system formed peacefully without major collisions or disruptions. Most importantly, the researchers discovered these bloated worlds are rapidly shrinking as they cool down from their formation.\n\n**Looking Forward**\n\nThis discovery provides a missing piece of the planetary evolution puzzle. The team predicts these puffy planets will eventually shrink to become the compact, medium-sized worlds that dominate our galaxy. By watching this transformation in real-time, astronomers can better understand how the universe's most common planetary systems reach their mature state—and whether any might harbor conditions suitable for life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Most planetary systems in our galaxy look nothing like our own solar system. While we have small, rocky planets close to the Sun and gas giants farther out, the most common arrangement elsewhere features several medium-sized planets packed tightly around their star. Understanding how these systems form and evolve helps us grasp how planetary systems—including potentially habitable ones—come to be. This research gives us a rare glimpse at what these common systems look like in their youth, before billions of years of evolution shape their final form.</p>\n<h4>What They Did</h4>\n<p>The researchers studied a young star called V1298 Tau, which hosts four unusually puffy planets. Because this star is extremely active—constantly flaring and changing brightness—traditional methods of studying planets wouldn't work. Instead, they used a clever technique called transit timing variations. Imagine planets as runners on a track, each in their own lane but gravitationally tugging on each other as they pass by. These tiny tugs cause the planets to arrive at their \"finish line\" (crossing in front of their star) slightly early or late. By precisely timing these transits over nine years, the team could weigh each planet and map their orbits without interference from the star's chaotic behavior.</p>\n<h4>Key Findings</h4>\n<p>The four planets are surprisingly light for their size—each about 5 to 10 times wider than Earth but with masses closer to Neptune than Jupiter. They're essentially cosmic balloons, puffed up with thick atmospheres. The planets orbit in nearly perfect circles and maintain a delicate gravitational dance, suggesting their system formed peacefully without major collisions or disruptions. Most importantly, the researchers discovered these bloated worlds are rapidly shrinking as they cool down from their formation.</p>\n<h4>Looking Forward</h4>\n<p>This discovery provides a missing piece of the planetary evolution puzzle. The team predicts these puffy planets will eventually shrink to become the compact, medium-sized worlds that dominate our galaxy. By watching this transformation in real-time, astronomers can better understand how the universe's most common planetary systems reach their mature state—and whether any might harbor conditions suitable for life.</p>",
      "tweet_hook": {
        "hook": "These puffy young planets will shrink to become the Galaxy's most common planetary type",
        "claim": "First mass measurements show how super-Earths and sub-Neptunes form from inflated precursors",
        "evidence": "V1298 Tau's planets are 5-10 Earth radii now but will contract to just 1.5-4.0 Earth radii",
        "question": "Why does nature produce compact multi-planet systems so abundantly?"
      },
      "figure_url": "https://arxiv.org/html/2601.10598v1/x1.png"
    },
    {
      "id": "2601.10794v1",
      "title": "Metal Pipe: A Broadly-Applicable Stellar Abundance Pipeline Using Isochronal Parameters",
      "abstract": "Characterizing exoplanet host stars at a population level requires a method of homogeneously characterizing stellar properties across all spectral types. To this end, we have developed Metal Pipe, a new code for determining stellar parameters and abundances, which is designed for use across a wider range of spectral types than many commonly used codes. It combines the widely-used package MOOG with photometric stellar parameters, a user-supplied high-resolution spectrum, and a newly curated list of spectral lines. Metal Pipe outputs values for $T_{\\rm{eff}}$, $\\log{(g)}$, $M_*$, $R_*$, and $L_*$ from isochrones, and abundances of C, O, Na, Mg, Al, Si, S, Ca, Ti, and Fe from MOOG. In this paper, we describe the Metal Pipe algorithm and tests of Metal Pipe against previous abundance measurements on archival HIRES spectra of 503 F, G, and K type stars. We find RMS scatters of ~100 K in $T_{\\rm{eff}}$, ~0.10 dex in $\\log{(g)}$, and ~0.10 dex for all measured abundances. These values are comparable to estimated measurement uncertainties, verifying Metal Pipe for continued use in building a detailed abundance catalog. Future papers in this series will test Metal Pipe's applicability to late K and M dwarf stars, and provide other improvements.",
      "authors": [
        "Jared R. Kolecki",
        "Lauren M. Weiss"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-15T19:00:20Z",
      "updated": "2026-01-15T19:00:20Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10794v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10794v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\n\nThe hunt for planets beyond our solar system has revealed thousands of alien worlds, but finding them is only half the battle. To truly understand these exoplanets—including which ones might harbor life—scientists need to know what their host stars are made of. Just as a plant's health depends on the soil it grows in, a planet's characteristics are intimately linked to the chemical makeup of the star it orbits around. Stars rich in heavy elements like iron and silicon tend to host rocky planets like Earth, while stars with different chemical recipes may produce entirely different types of worlds. But analyzing the chemical fingerprints of stars is like trying to determine the ingredients in thousands of different soup recipes by taste-testing them one by one—it requires consistent, reliable methods that work across many different types of stars.\n\n**What They Did**\n\nResearchers developed a new software tool called \"Metal Pipe\" (where \"metals\" in astronomy refers to any element heavier than hydrogen and helium) that acts like a universal translator for stellar chemistry. Think of it as creating a standardized recipe analyzer that can work on everything from chicken soup to beef stew. The tool combines two types of stellar data: light captured by telescopes that reveals the star's chemical signature, and brightness measurements that help determine the star's basic properties like temperature and size. They tested this new tool on 503 sun-like stars of different types, comparing their results to previous measurements to ensure accuracy.\n\n**Key Findings**\n\nThe new tool proved remarkably precise, with measurements accurate to within about 100 degrees Kelvin in temperature (roughly the difference between a hot summer day and a mild spring day, but applied to stars burning at thousands of degrees). It can reliably detect ten different chemical elements in starlight and determine fundamental stellar properties with uncertainties of only about 10%—imagine measuring the height of a skyscraper and being off by just one floor.\n\n**Looking Forward**\n\nThis breakthrough means astronomers can now efficiently analyze the chemical composition of thousands of exoplanet host stars using a single, consistent method. This will help reveal patterns between stellar chemistry and the types of planets that form, potentially guiding our search for Earth-like worlds and advancing our understanding of how planetary systems—including our own—came to be.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>The hunt for planets beyond our solar system has revealed thousands of alien worlds, but finding them is only half the battle. To truly understand these exoplanets—including which ones might harbor life—scientists need to know what their host stars are made of. Just as a plant's health depends on the soil it grows in, a planet's characteristics are intimately linked to the chemical makeup of the star it orbits around. Stars rich in heavy elements like iron and silicon tend to host rocky planets like Earth, while stars with different chemical recipes may produce entirely different types of worlds. But analyzing the chemical fingerprints of stars is like trying to determine the ingredients in thousands of different soup recipes by taste-testing them one by one—it requires consistent, reliable methods that work across many different types of stars.</p>\n<h4>What They Did</h4>\n<p>Researchers developed a new software tool called \"Metal Pipe\" (where \"metals\" in astronomy refers to any element heavier than hydrogen and helium) that acts like a universal translator for stellar chemistry. Think of it as creating a standardized recipe analyzer that can work on everything from chicken soup to beef stew. The tool combines two types of stellar data: light captured by telescopes that reveals the star's chemical signature, and brightness measurements that help determine the star's basic properties like temperature and size. They tested this new tool on 503 sun-like stars of different types, comparing their results to previous measurements to ensure accuracy.</p>\n<h4>Key Findings</h4>\n<p>The new tool proved remarkably precise, with measurements accurate to within about 100 degrees Kelvin in temperature (roughly the difference between a hot summer day and a mild spring day, but applied to stars burning at thousands of degrees). It can reliably detect ten different chemical elements in starlight and determine fundamental stellar properties with uncertainties of only about 10%—imagine measuring the height of a skyscraper and being off by just one floor.</p>\n<h4>Looking Forward</h4>\n<p>This breakthrough means astronomers can now efficiently analyze the chemical composition of thousands of exoplanet host stars using a single, consistent method. This will help reveal patterns between stellar chemistry and the types of planets that form, potentially guiding our search for Earth-like worlds and advancing our understanding of how planetary systems—including our own—came to be.</p>",
      "tweet_hook": {
        "hook": "New pipeline can measure stellar abundances across F, G, K, and M dwarf stars using the same method",
        "claim": "Metal Pipe homogeneously characterizes 10 elements across broader spectral range than existing codes",
        "evidence": "Method: Combines MOOG spectral analysis with photometric parameters, tested on 503 HIRES spectra",
        "question": "Which stellar abundance patterns will reveal the most about planet formation?"
      },
      "figure_url": "https://arxiv.org/html/2601.10794v1/22Lines.png"
    },
    {
      "id": "2601.10285v1",
      "title": "How disc initial conditions sculpt the atmospheric composition of giant planets",
      "abstract": "Past studies have revealed the dependency of the disc parameters (mass, radius, viscosity, grain fragmentation velocity, dust-to-gas ratio) on the formation of giant planets, where more massive discs seem beneficial for giant planet formation. It is unclear how the different disc properties influence the composition of forming giant planets. The idea that the atmospheric abundances can trace directly the formation location of planets is put into question, due to the chemical evolution of the disc, caused by inward drifting and evaporating pebbles. This complicates the idea of a relation between atmospheric abundances and planet formation locations. We use planet formation simulations that include the effects of pebble drift and evaporation and investigate how the different disc parameters influence the atmospheric composition of giant planets. We focus on the atmospheric C/O, C/H, O/H and S/H ratios allowing us to probe tracers for volatiles and refractories and thus different accretion pathways of giant planets. We find that most of the disc parameters have only a limited influence on the atmospheric abundances of gas giants, except for the dust-to-gas ratio, where a larger value results in higher atmospheric abundances. However the atmospheric abundances are determined by the planetary formation location, even in the pebble drift and evaporation scenario. Our study suggests that volatile-rich giant exoplanets predominantly form in the inner disc regions, where they can accrete large fractions of vapour-enhanced gas. Our study shows that simulations that try to trace the origin of giant planets via their atmospheric abundances do not have to probe all disc parameters, as long as the disc parameters allow the formation of giant planets. Our study thus suggests that the diversity of observed planetary compositions is a direct consequence of their formation location and migration history.",
      "authors": [
        "Angie Daniela Guzmán Franco",
        "Sofia Savvidou",
        "Bertram Bitsch"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T11:01:08Z",
      "updated": "2026-01-15T11:01:08Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10285v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10285v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "**Why It Matters**\n\nWhen we look up at the night sky, we're seeing just a tiny fraction of the planets that exist in our galaxy. Scientists have discovered thousands of exoplanets—worlds orbiting other stars—and many are giant planets like Jupiter and Saturn. But here's the fascinating puzzle: these distant worlds have wildly different atmospheric compositions, even when they're similar in size. Some are rich in carbon, others in oxygen, and still others contain surprising amounts of sulfur. Understanding why planets turn out so different helps us piece together the story of how planetary systems form, including our own. It also guides our search for worlds that might harbor life, since a planet's atmosphere largely determines whether it could support the chemistry of living things.\n\n**What They Did**\n\nThe researchers created detailed computer simulations to watch giant planets form from scratch. Think of a planetary system's birth like a cosmic construction site: there's a spinning disk of gas and dust around a young star, and within this disk, planets slowly assemble themselves. The team focused on tiny particles called pebbles—cosmic dust grains that drift inward toward the star, picking up and releasing different chemical ingredients as they travel. As these pebbles encounter temperature changes, they evaporate and enrich the surrounding gas with various elements. The scientists then tracked how forming giant planets gobble up this chemically-evolving gas, testing different starting conditions for their cosmic construction sites to see how each scenario affected the final planetary recipes.\n\n**Key Findings**\n\nThe study revealed that most factors affecting planet formation—like how massive or viscous the initial disk is—barely influence what ends up in a giant planet's atmosphere. However, one factor made a huge difference: the amount of dust compared to gas in the original disk. More dust means richer planetary atmospheres. Surprisingly, even though the disk's chemistry constantly changes as material moves around, a planet's location during formation still acts like its postal code—planets forming closer to their star end up with more volatile-rich atmospheres because they can feast on gas that's been enriched by evaporating materials.\n\n**Looking Forward**\n\nThese findings simplify the detective work of tracing exoplanets back to their origins. Scientists studying distant worlds through their atmospheric fingerprints now know they don't need to worry about every possible formation scenario—location is king. This research suggests that the incredible diversity we observe in exoplanet atmospheres isn't random but tells a coherent story of where and how these worlds formed. As next-generation telescopes come online, astronomers will be able to analyze many more exoplanet atmospheres, using these insights to map out the formation histories of entire planetary systems and better understand the cosmic processes that create worlds like our own.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>When we look up at the night sky, we're seeing just a tiny fraction of the planets that exist in our galaxy. Scientists have discovered thousands of exoplanets—worlds orbiting other stars—and many are giant planets like Jupiter and Saturn. But here's the fascinating puzzle: these distant worlds have wildly different atmospheric compositions, even when they're similar in size. Some are rich in carbon, others in oxygen, and still others contain surprising amounts of sulfur. Understanding why planets turn out so different helps us piece together the story of how planetary systems form, including our own. It also guides our search for worlds that might harbor life, since a planet's atmosphere largely determines whether it could support the chemistry of living things.</p>\n<h4>What They Did</h4>\n<p>The researchers created detailed computer simulations to watch giant planets form from scratch. Think of a planetary system's birth like a cosmic construction site: there's a spinning disk of gas and dust around a young star, and within this disk, planets slowly assemble themselves. The team focused on tiny particles called pebbles—cosmic dust grains that drift inward toward the star, picking up and releasing different chemical ingredients as they travel. As these pebbles encounter temperature changes, they evaporate and enrich the surrounding gas with various elements. The scientists then tracked how forming giant planets gobble up this chemically-evolving gas, testing different starting conditions for their cosmic construction sites to see how each scenario affected the final planetary recipes.</p>\n<h4>Key Findings</h4>\n<p>The study revealed that most factors affecting planet formation—like how massive or viscous the initial disk is—barely influence what ends up in a giant planet's atmosphere. However, one factor made a huge difference: the amount of dust compared to gas in the original disk. More dust means richer planetary atmospheres. Surprisingly, even though the disk's chemistry constantly changes as material moves around, a planet's location during formation still acts like its postal code—planets forming closer to their star end up with more volatile-rich atmospheres because they can feast on gas that's been enriched by evaporating materials.</p>\n<h4>Looking Forward</h4>\n<p>These findings simplify the detective work of tracing exoplanets back to their origins. Scientists studying distant worlds through their atmospheric fingerprints now know they don't need to worry about every possible formation scenario—location is king. This research suggests that the incredible diversity we observe in exoplanet atmospheres isn't random but tells a coherent story of where and how these worlds formed. As next-generation telescopes come online, astronomers will be able to analyze many more exoplanet atmospheres, using these insights to map out the formation histories of entire planetary systems and better understand the cosmic processes that create worlds like our own.</p>",
      "tweet_hook": {
        "hook": "Giant planets get their weird atmospheric chemistry from where they form, not how much dust was in their birth disk",
        "claim": "Planet formation location determines atmospheric composition even when pebbles drift and evaporate",
        "evidence": "Only dust-to-gas ratio significantly affects atmospheric abundances; other disc parameters have limited impact",
        "question": "Could JWST atmospheric surveys map out the original formation zones of migrated hot Jupiters?"
      },
      "figure_url": "https://arxiv.org/html/2601.10285v1/Plots/growth_ratios_ufrag.png"
    },
    {
      "id": "2601.09835v1",
      "title": "A Robust Launching Mechanism for Freely-Floating Planets from Host Stars with Close-in Planets",
      "abstract": "Secular perturbations from binary stars and distant massive planets can drive cold planets onto nearly parabolic orbits with pericenter passages extremely close to their host stars. Meanwhile, short-period super-Earths are frequently observed around nearby stars. Gravitational scattering between these two distinct populations can lead to substantial orbital energy exchange, liberating some intruders from the gravitational confinement of their host systems. This process offers a robust formation channel for a subset of the abundant freely floating planet population. It may also significantly perturb the original orbits of close-in planets, induce collisional trajectories between close-in planets and their host stars, and disrupt the dynamical evolution of cold planets toward close stellar encounters.",
      "authors": [
        "Xiaochen Zheng",
        "Zhuoya Cao",
        "Shigeru Ida",
        "Douglas N. C. Lin",
        "Shude Mao"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T19:49:45Z",
      "updated": "2026-01-14T19:49:45Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09835v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09835v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0,
      "summary": "# Cosmic Billiards: How Planets Get Kicked Out of Their Solar Systems\n\n**Why It Matters**\n\nImagine entire planets—some potentially Earth-like—wandering alone through the darkness of space, untethered to any star. These \"rogue planets\" have fascinated astronomers for years, and we now know there could be billions of them drifting through our galaxy. But how do planets get ejected from their home solar systems in the first place? This research tackles that mystery and reveals a surprisingly common cosmic process that reshapes planetary systems throughout the universe. Understanding how planets get displaced helps us grasp how rare or common stable, life-friendly solar systems like ours might be—a question central to our search for life beyond Earth.\n\n**What They Did**\n\nThe researchers used computer simulations to model a cosmic game of billiards happening in distant solar systems. They focused on systems with two key ingredients: planets orbiting very close to their stars (closer than Mercury orbits our Sun) and distant, massive planets that occasionally get nudged toward the inner solar system by gravitational influences from companion stars or other distant planets. Think of it like a bowling ball rolling down a lane toward tightly clustered pins. When these distant intruder planets swing close to their star, they can gravitationally scatter the close-in planets, sometimes with enough force to fling them completely out of the solar system.\n\n**Key Findings**\n\nThe team discovered that this planetary billiards process is remarkably efficient at creating rogue planets. When a massive intruder planet swoops through the inner regions of a solar system, it can transfer enough gravitational energy to permanently eject smaller planets from their orbits. The process doesn't just create wandering planets—it also disrupts entire planetary systems, potentially sending some planets crashing into their host stars while dramatically altering the orbits of survivors.\n\n**Looking Forward**\n\nThis research provides a compelling explanation for the abundance of free-floating planets that upcoming space telescopes are expected to discover. It also suggests that planetary systems might be far more dynamic and unstable than previously thought, with major reshuffling events occurring throughout their lifetimes. Future observations of rogue planets and disrupted solar systems could help astronomers test these predictions and better understand how common stable, potentially habitable worlds really are.",
      "summary_html": "<p># Cosmic Billiards: How Planets Get Kicked Out of Their Solar Systems</p>\n<h4>Why It Matters</h4>\n<p>Imagine entire planets—some potentially Earth-like—wandering alone through the darkness of space, untethered to any star. These \"rogue planets\" have fascinated astronomers for years, and we now know there could be billions of them drifting through our galaxy. But how do planets get ejected from their home solar systems in the first place? This research tackles that mystery and reveals a surprisingly common cosmic process that reshapes planetary systems throughout the universe. Understanding how planets get displaced helps us grasp how rare or common stable, life-friendly solar systems like ours might be—a question central to our search for life beyond Earth.</p>\n<h4>What They Did</h4>\n<p>The researchers used computer simulations to model a cosmic game of billiards happening in distant solar systems. They focused on systems with two key ingredients: planets orbiting very close to their stars (closer than Mercury orbits our Sun) and distant, massive planets that occasionally get nudged toward the inner solar system by gravitational influences from companion stars or other distant planets. Think of it like a bowling ball rolling down a lane toward tightly clustered pins. When these distant intruder planets swing close to their star, they can gravitationally scatter the close-in planets, sometimes with enough force to fling them completely out of the solar system.</p>\n<h4>Key Findings</h4>\n<p>The team discovered that this planetary billiards process is remarkably efficient at creating rogue planets. When a massive intruder planet swoops through the inner regions of a solar system, it can transfer enough gravitational energy to permanently eject smaller planets from their orbits. The process doesn't just create wandering planets—it also disrupts entire planetary systems, potentially sending some planets crashing into their host stars while dramatically altering the orbits of survivors.</p>\n<h4>Looking Forward</h4>\n<p>This research provides a compelling explanation for the abundance of free-floating planets that upcoming space telescopes are expected to discover. It also suggests that planetary systems might be far more dynamic and unstable than previously thought, with major reshuffling events occurring throughout their lifetimes. Future observations of rogue planets and disrupted solar systems could help astronomers test these predictions and better understand how common stable, potentially habitable worlds really are.</p>",
      "tweet_hook": {
        "hook": "Planets can get ejected into interstellar space when cold worlds dive close to their stars and slam into hot super-Earths",
        "claim": "Gravitational scattering between these populations creates freely floating planets robustly",
        "evidence": "Method: Secular perturbations drive cold planets onto parabolic orbits with extreme stellar pericenters",
        "question": "How many rogue planets in our galaxy formed this way versus in stellar nurseries?"
      },
      "figure_url": "https://arxiv.org/html/2601.09835v1/scenario.png"
    },
    {
      "id": "2601.07088v1",
      "title": "On the 3D time evolution of the dust size distribution in protostellar envelopes",
      "abstract": "Dust plays a fundamental role during protostellar collapse, disk and planet formation. Recent observations suggest that efficient dust growth may begin early, in the protostellar envelopes, potentially even before the formation of the disk. Three-dimensional models of protostellar evolution, addressing multi-size dust growth, gas and dust dynamics and magnetohydrodynamics, are required to characterize the dust evolution in the embedded stages of star formation. We aim to establish a new framework for dust evolution models, following in 3D the dust size distribution both in time and space, in MHD models describing the formation and evolution of star-disk systems, at low numerical cost. We present our work coupling the COALA dust evolution module into the code RAMSES, performing the first 3D MHD simulation of protostellar collapse including simultaneously polydisperse dust growth modeled by the Smoluchowski equation as well as dust dynamics in the terminal velocity approximation. Ice-coated micron-sized grains can rapidly grow in the envelope and survive by not entering the fragmentation regime. The evolution of the dust size distribution is highly anisotropic due to the turbulent nature of the collapse and the development of favorable locations such as outflow cavity walls, which enhance locally the dust-to-gas ratio. We analyzed the first 3D non-ideal MHD simulations that self-consistently account for the dust dynamics and growth during the protostellar stage. Very early in the lifetime of a young embedded protostar, micron-sized grains can grow, and locally the dust size distribution deviates significantly from the MRN initial shape. This new numerical method opens the perspective to treat simultaneously gas/dust dynamics and dust growth in 3D simulations at a low numerical cost for several astrophysical environments.",
      "authors": [
        "Maxime Lombart",
        "Ugo Lebreuilly",
        "Anaëlle Maury"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "published": "2026-01-11T22:50:21Z",
      "updated": "2026-01-11T22:50:21Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07088v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07088v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 10,
      "summary": "**Why It Matters**\n\nThe story of how planets form begins long before we typically imagine—not in the swirling disks around young stars that make stunning space photos, but in the chaotic, collapsing clouds of gas and dust that give birth to stars themselves. Understanding this earliest chapter is crucial because it determines what raw materials are available to build planets, and ultimately, what types of worlds might harbor life. This research tackles a fundamental question: how do tiny specks of cosmic dust grow into the building blocks of planets? The answer could help explain why some star systems produce Earth-like worlds while others create only gas giants or remain barren.\n\n**What They Did**\n\nThe researchers created the most sophisticated computer simulation ever made of star birth, tracking millions of dust particles as they grow and move through three-dimensional space over time. Think of it like creating a detailed movie of how flour particles might clump together in a mixing bowl—except this \"bowl\" is a collapsing cloud of gas and dust hundreds of times larger than our solar system, with powerful magnetic fields and turbulent flows stirring everything together. Their simulation follows dust grains as small as those in cigarette smoke as they stick together and grow, while also tracking the complex dance of gas, magnetic fields, and gravity that shapes the entire system. This required connecting multiple computer codes—like linking several different movie studios to create one epic film.\n\n**Key Findings**\n\nThe simulation revealed that dust grains start growing much earlier than scientists expected—essentially as soon as star formation begins. Microscopic dust particles, initially smaller than bacteria, can rapidly grow to become thousands of times larger while still in the chaotic envelope surrounding the forming star. Surprisingly, this growth happens unevenly throughout space, with some regions like the walls of gas outflows becoming cosmic \"sweet spots\" where dust particles are concentrated and grow especially fast. The researchers found that ice-coated grains are particularly successful at growing because they stick together easily and avoid getting smashed apart by turbulent gas flows.\n\n**Looking Forward**\n\nThis breakthrough opens a new window into planet formation by showing that the construction materials for worlds begin assembling much earlier than previously thought. The method developed here can now be applied to study how different environments might produce different types of planetary systems, potentially helping explain the incredible diversity of exoplanets we've discovered. Future research could reveal whether systems like ours, capable of producing rocky planets in habitable zones, require specific early conditions during star formation—knowledge that would guide our search for potentially life-bearing worlds.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>The story of how planets form begins long before we typically imagine—not in the swirling disks around young stars that make stunning space photos, but in the chaotic, collapsing clouds of gas and dust that give birth to stars themselves. Understanding this earliest chapter is crucial because it determines what raw materials are available to build planets, and ultimately, what types of worlds might harbor life. This research tackles a fundamental question: how do tiny specks of cosmic dust grow into the building blocks of planets? The answer could help explain why some star systems produce Earth-like worlds while others create only gas giants or remain barren.</p>\n<h4>What They Did</h4>\n<p>The researchers created the most sophisticated computer simulation ever made of star birth, tracking millions of dust particles as they grow and move through three-dimensional space over time. Think of it like creating a detailed movie of how flour particles might clump together in a mixing bowl—except this \"bowl\" is a collapsing cloud of gas and dust hundreds of times larger than our solar system, with powerful magnetic fields and turbulent flows stirring everything together. Their simulation follows dust grains as small as those in cigarette smoke as they stick together and grow, while also tracking the complex dance of gas, magnetic fields, and gravity that shapes the entire system. This required connecting multiple computer codes—like linking several different movie studios to create one epic film.</p>\n<h4>Key Findings</h4>\n<p>The simulation revealed that dust grains start growing much earlier than scientists expected—essentially as soon as star formation begins. Microscopic dust particles, initially smaller than bacteria, can rapidly grow to become thousands of times larger while still in the chaotic envelope surrounding the forming star. Surprisingly, this growth happens unevenly throughout space, with some regions like the walls of gas outflows becoming cosmic \"sweet spots\" where dust particles are concentrated and grow especially fast. The researchers found that ice-coated grains are particularly successful at growing because they stick together easily and avoid getting smashed apart by turbulent gas flows.</p>\n<h4>Looking Forward</h4>\n<p>This breakthrough opens a new window into planet formation by showing that the construction materials for worlds begin assembling much earlier than previously thought. The method developed here can now be applied to study how different environments might produce different types of planetary systems, potentially helping explain the incredible diversity of exoplanets we've discovered. Future research could reveal whether systems like ours, capable of producing rocky planets in habitable zones, require specific early conditions during star formation—knowledge that would guide our search for potentially life-bearing worlds.</p>",
      "tweet_hook": {
        "hook": "Dust grains grow to micron size before protoplanetary disks even form, transforming our timeline of planet formation",
        "claim": "First 3D simulation shows dust evolution begins in collapsing envelopes, not just disks",
        "evidence": "Method: Coupled Smoluchowski equation with MHD simulations using RAMSES code + COALA module",
        "question": "Does earlier dust growth mean planets form faster than we thought?"
      },
      "figure_url": "https://arxiv.org/html/2601.07088v1/x1.png"
    },
    {
      "id": "2601.08923v1",
      "title": "Origin of asteroid (469219) Kamo`oalewa: the main asteroid belt or the Giordano Bruno crater on the Moon?",
      "abstract": "Asteroid Kamo`oalewa is the target of the Tianwen-2 sample-return mission by CNSA. Because of its orbit and its spectral properties, it was proposed that Kamo`oalewa originated from the Moon as impact ejecta, possibly from the Giordano Bruno crater. We aim at estimating the relative contribution of Kamo`oalewa-like objects originating from the general near-Earth asteroid (NEA) population which originated in the main asteroid belt, and compare it with the relative contribution of Giordano Bruno ejecta. We first estimate the average fraction of quasi-satellite orbits at any given time. By using recently developed NEA population models, we extract the expected number of Earth co-orbitals of the same size of Kamo`oalewa, and then get an estimate of the average number of Kamo`oalewa-like objects using the fraction computed before. Similarly, we obtain an estimate for the number of Kamo`oalewa-like objects that may originate as ejecta from the Giordano Bruno impact. We also performed survey simulations to estimate their efficiency in the detection of Kamo`oalewa-like objects. We found that the main belt accounts for 1.23 \\pm 0.13 Kamo`oalewa-like objects on average. The expected number of Kamo`oalewa-like objects originated as Giordano Bruno ejecta is 0.042, which is more than order of magnitude smaller. We found a discovery efficiency of Earth quasi-satellites between 95% and 70% for absolute magnitude between 22 and 25 for the Pan-STARRS survey, and population models show that this is in agreement with the known population. The Vera Rubin Observatory should reach an efficiency of 92% down to absolute magnitude 25. These estimates show that population models of NEAs are capable to account for Kamo`oalewa-like objects, thus supporting the hypothesis that that Kamo'oalewa originated from the main belt. This will be further investigated by the in-situ exploration of the Tianwen-2 mission.",
      "authors": [
        "M. Fenucci",
        "B. Novaković",
        "M. Granvik",
        "P. Zhang"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T19:02:05Z",
      "updated": "2026-01-13T19:02:05Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08923v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08923v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 8,
      "summary": "**Why It Matters**\n\nThere's a mysterious space rock called Kamo'oalewa that follows Earth around like a loyal companion, staying roughly the same distance from our planet as it orbits the Sun. This asteroid has puzzled scientists because it might actually be a chunk of our own Moon that was blasted into space by an ancient impact. Understanding where Kamo'oalewa came from helps us piece together the violent history of our solar system—how planets and moons were shaped by countless collisions over billions of years. China is planning to send a spacecraft to collect samples from this enigmatic object, making it crucial to understand its origins before the mission launches.\n\n**What They Did**\n\nThe researchers tackled this mystery like detectives weighing two competing theories. They used computer models to calculate how many Kamo'oalewa-like objects we should expect to find if they come from the main asteroid belt (the ring of rocky debris between Mars and Jupiter) versus how many should exist if they're chunks blown off the Moon. Specifically, they investigated whether Kamo'oalewa might have originated from the Giordano Bruno crater, a relatively young impact site on the Moon's far side. Think of it like estimating how many red cars you'd expect to see in a parking lot based on different manufacturing scenarios, then comparing those predictions to what you actually observe.\n\n**Key Findings**\n\nThe numbers tell a clear story: if Kamo'oalewa-type objects come mainly from the asteroid belt, we should expect to find about 1.23 such objects at any given time. But if they're Moon chunks from the Giordano Bruno crater impact, we'd only expect to find 0.042 objects—more than 25 times fewer. Since we've actually discovered Kamo'oalewa, the asteroid belt origin is far more likely mathematically. The researchers also found that current sky surveys are quite good at spotting these objects, catching between 70-95% of them depending on their brightness.\n\n**Looking Forward**\n\nThis research suggests that even the most unusual asteroids in Earth's neighborhood probably have ordinary origins in the main asteroid belt, rather than exotic lunar beginnings. The upcoming Chinese Tianwen-2 mission will provide the definitive answer by analyzing actual samples from Kamo'oalewa's surface, potentially revealing whether it's made of Moon rock or typical asteroid material. This detective work also helps scientists understand how effectively we're finding dangerous near-Earth asteroids—knowledge that could prove vital for planetary defense against future impacts.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>There's a mysterious space rock called Kamo'oalewa that follows Earth around like a loyal companion, staying roughly the same distance from our planet as it orbits the Sun. This asteroid has puzzled scientists because it might actually be a chunk of our own Moon that was blasted into space by an ancient impact. Understanding where Kamo'oalewa came from helps us piece together the violent history of our solar system—how planets and moons were shaped by countless collisions over billions of years. China is planning to send a spacecraft to collect samples from this enigmatic object, making it crucial to understand its origins before the mission launches.</p>\n<h4>What They Did</h4>\n<p>The researchers tackled this mystery like detectives weighing two competing theories. They used computer models to calculate how many Kamo'oalewa-like objects we should expect to find if they come from the main asteroid belt (the ring of rocky debris between Mars and Jupiter) versus how many should exist if they're chunks blown off the Moon. Specifically, they investigated whether Kamo'oalewa might have originated from the Giordano Bruno crater, a relatively young impact site on the Moon's far side. Think of it like estimating how many red cars you'd expect to see in a parking lot based on different manufacturing scenarios, then comparing those predictions to what you actually observe.</p>\n<h4>Key Findings</h4>\n<p>The numbers tell a clear story: if Kamo'oalewa-type objects come mainly from the asteroid belt, we should expect to find about 1.23 such objects at any given time. But if they're Moon chunks from the Giordano Bruno crater impact, we'd only expect to find 0.042 objects—more than 25 times fewer. Since we've actually discovered Kamo'oalewa, the asteroid belt origin is far more likely mathematically. The researchers also found that current sky surveys are quite good at spotting these objects, catching between 70-95% of them depending on their brightness.</p>\n<h4>Looking Forward</h4>\n<p>This research suggests that even the most unusual asteroids in Earth's neighborhood probably have ordinary origins in the main asteroid belt, rather than exotic lunar beginnings. The upcoming Chinese Tianwen-2 mission will provide the definitive answer by analyzing actual samples from Kamo'oalewa's surface, potentially revealing whether it's made of Moon rock or typical asteroid material. This detective work also helps scientists understand how effectively we're finding dangerous near-Earth asteroids—knowledge that could prove vital for planetary defense against future impacts.</p>",
      "tweet_hook": {
        "hook": "Kamo`oalewa asteroid is 30x more likely from the main belt than lunar impact ejecta from Giordano Bruno crater",
        "claim": "Statistical models show Earth's quasi-satellite probably didn't originate from the Moon",
        "evidence": "Main belt accounts for 1.23 ± 0.13 Kamo`oalewa-like objects vs 0.042 from lunar ejecta",
        "question": "Will Tianwen-2 sample return definitively settle the lunar vs main belt origin debate?"
      },
      "figure_url": "https://arxiv.org/html/2601.08923v1/figures/QS_identification.png"
    },
    {
      "id": "2601.09671v1",
      "title": "Parallaxes, Proper Motions, and Near-Infrared Photometry for 173 L and T Dwarfs From The US Naval Observatory Infrared Astrometry Program",
      "abstract": "We present near-infrared parallax and proper motion astrometry for 74 L-dwarfs and 99 T-dwarfs, as single objects or in binary systems, obtained with the ASTROCAM astrometric imager on the USNO, Flagstaff Station 1.55-m telescope over two observing periods. For all 173 objects the median number of observational epochs was 62 with a median time frame of 5.25 years, resulting in median uncertainties of $σ$($π_{abs}$) = 1.51 mas, $σ$($μ_{abs}$) = 1.02 mas yr$^{-1}$, and $σ$($V_{\\rm tan}$) = 1.01 km s$^{-1}$. Our observations provide the first parallax/proper motion results for 16 objects and the highest precision parallaxes/proper motions for an additional 116 objects. A serendipitous overlap of 40 objects with Gaia DR3 astrometry allows direct comparison and confirmation of our results, along with an investigation on the effects of resolved binarity on astrometric results. We also provide a uniform set of $J$-, $H$-, $K_{S}$-band photometry in the UKIRT/MKO system, most of it being from new observations. We use these results to examine objects included in this study of special-interest populations, consisting of binaries, wide companions, young objects, subdwarfs, and brown dwarf spectral standards.",
      "authors": [
        "Frederick J. Vrba",
        "Adam C. Schneider",
        "Jeffrey A. Munn",
        "Arne A. Henden",
        "Christain B. Luginbuhl",
        "Conard C. Dahn",
        "Harry H. Guetter",
        "Blaise J. Canzian",
        "Trudy M. Tilleman",
        "Scott E. Dahm",
        "Stephen J. Williams",
        "Justice E. Bruursema",
        "J. Davy Kirkpatrick",
        "Adam J. Burgasser"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-14T18:12:18Z",
      "updated": "2026-01-14T18:12:18Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09671v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09671v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 7,
      "summary": "**Why It Matters**\n\nImagine trying to find planets around stars so dim they're barely visible, even with powerful telescopes. Brown dwarfs—often called \"failed stars\"—are cosmic objects that never got quite massive enough to ignite nuclear fusion like our Sun. These mysterious objects blur the line between planets and stars, and studying them helps us understand how planetary systems form and evolve. By precisely tracking the movements and distances of these elusive brown dwarfs, astronomers can better understand the building blocks of our galaxy and potentially discover new worlds orbiting these dim stellar cousins.\n\n**What They Did**\n\nUsing a specialized telescope in Arizona over more than five years, researchers carefully tracked 173 brown dwarfs as they moved across the sky. Think of it like watching fireflies on a summer night—except these \"fireflies\" are light-years away and barely glowing in infrared light. The team measured two key things: how far away these objects are (called parallax, similar to how your finger appears to shift when you close one eye, then the other) and how fast they're moving sideways across space (proper motion). They took an average of 62 observations per object, creating an incredibly detailed map of these brown dwarfs' locations and movements through space.\n\n**Key Findings**\n\nThe study achieved remarkable precision, measuring distances accurate to within about 1.5 milliarcseconds—imagine spotting a quarter from 100 miles away. For 16 brown dwarfs, this represents the first time anyone has precisely measured their distance and movement. The team also created the most accurate measurements yet for 116 additional objects. Their results matched beautifully with data from the European Space Agency's Gaia spacecraft, confirming the reliability of both datasets.\n\n**Looking Forward**\n\nThese precise measurements create a crucial foundation for future discoveries. By knowing exactly where brown dwarfs are and how they move, astronomers can better search for planets orbiting them and understand how these systems compare to our own solar system. This work also helps refine our understanding of how stars and planets form throughout the galaxy.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to find planets around stars so dim they're barely visible, even with powerful telescopes. Brown dwarfs—often called \"failed stars\"—are cosmic objects that never got quite massive enough to ignite nuclear fusion like our Sun. These mysterious objects blur the line between planets and stars, and studying them helps us understand how planetary systems form and evolve. By precisely tracking the movements and distances of these elusive brown dwarfs, astronomers can better understand the building blocks of our galaxy and potentially discover new worlds orbiting these dim stellar cousins.</p>\n<h4>What They Did</h4>\n<p>Using a specialized telescope in Arizona over more than five years, researchers carefully tracked 173 brown dwarfs as they moved across the sky. Think of it like watching fireflies on a summer night—except these \"fireflies\" are light-years away and barely glowing in infrared light. The team measured two key things: how far away these objects are (called parallax, similar to how your finger appears to shift when you close one eye, then the other) and how fast they're moving sideways across space (proper motion). They took an average of 62 observations per object, creating an incredibly detailed map of these brown dwarfs' locations and movements through space.</p>\n<h4>Key Findings</h4>\n<p>The study achieved remarkable precision, measuring distances accurate to within about 1.5 milliarcseconds—imagine spotting a quarter from 100 miles away. For 16 brown dwarfs, this represents the first time anyone has precisely measured their distance and movement. The team also created the most accurate measurements yet for 116 additional objects. Their results matched beautifully with data from the European Space Agency's Gaia spacecraft, confirming the reliability of both datasets.</p>\n<h4>Looking Forward</h4>\n<p>These precise measurements create a crucial foundation for future discoveries. By knowing exactly where brown dwarfs are and how they move, astronomers can better search for planets orbiting them and understand how these systems compare to our own solar system. This work also helps refine our understanding of how stars and planets form throughout the galaxy.</p>",
      "tweet_hook": {
        "hook": "173 brown dwarfs mapped with milliarcsecond precision reveal hidden binaries and motion patterns across 5+ years",
        "claim": "Highest precision parallaxes ever measured for 116 L and T dwarfs using ground-based astrometry",
        "evidence": "Median uncertainties of 1.51 mas for distance and 1.02 mas/yr for proper motion over 62 epochs each",
        "question": "How will these precise brown dwarf kinematics change our models of Galactic structure?"
      },
      "figure_url": "https://arxiv.org/html/2601.09671v1/x1.png"
    },
    {
      "id": "2601.09639v1",
      "title": "Constraining the size, shape, and albedo of the large Trans-Neptunian Object (28978) Ixion with multi-chord stellar occultations",
      "abstract": "Trans-Neptunian objects (TNOs) are among the most primitive remnants of the early Solar System, and constraining their sizes, shapes, albedos, and surface properties is essential for understanding their origin and evolution. Stellar occultations provide highly accurate size and shape measurements for TNOs, while photometry constrains their albedo and surface colours. (28978) Ixion is one of the largest TNOs and a prominent Plutino, making it a key target for comparative studies. We aim to constrain Ixion's projected size, shape, absolute magnitude, geometric albedo, and surface colours, and to search for evidence of an atmosphere or circum-object material. We analysed stellar occultation campaigns by Ixion conducted between 2020 and 2023 within the Lucky Star collaboration, comprising 51 observations from eight events, including 30 positive detections. Five multi-chord events enabled a global limb fit and an accurate reconstruction of Ixion's projected shape. The occultations reveal a slightly elongated limb well represented by a single projected ellipse, yielding an area-equivalent diameter of $D_{\\mathrm{equiv}} = 696.78^{+10.75}_{-8.87}$ km and an apparent oblateness $ε' = 0.081^{+0.004}_{-0.010}$. Typical radial residuals of order $\\sim$10 km indicate a largely stable shape across epochs, with modest epoch-dependent variations. Calibrated photometric data yield an absolute magnitude of $H_V = 3.845 \\pm 0.006$, a phase-curve slope of $β= 0.1301 \\pm 0.0078$ mag deg$^{-1}$, and a visible geometric albedo of $p_V = 0.106^{+0.003}_{-0.003}$, with colours consistent with moderately red TNO surfaces. No atmosphere or circum-object material is detected down to our sensitivity limits. The best-sampled event also allows a precise measurement of the angular diameter of the occulted star Gaia DR3 4056440205544338944, $θ_\\star = 0.670 \\pm 0.010$ mas.",
      "authors": [
        "Y. Kilic",
        "F. Braga-Ribas",
        "C. L. Pereira",
        "J. L. Ortiz",
        "B. Sicardy",
        "P. Santos-Sanz",
        "O. Erece",
        "J. L. Rizos",
        "J. M. Gómez-Limón",
        "G. Margoti",
        "D. Souami",
        "B. Morgado",
        "A. Gomes-Junior",
        "L. M. Catani",
        "J. Desmars",
        "M. Kretlow",
        "F. Rommel",
        "R. Duffard",
        "A. Alvarez-Candal",
        "J. I. B. Camargo",
        "M. Kaplan",
        "N. Morales",
        "D. Herald",
        "M. Assafin",
        "G. Benedetti-Rossi",
        "R. Sfair",
        "R. Savalle",
        "J. Arcas-Silva",
        "L. Bernasconi",
        "T. Blank",
        "M. Bonavita",
        "N. Carlson",
        "B. Christophe",
        "C. A. Colesanti",
        "M. Collins",
        "G. Columba",
        "R. Dunford",
        "D. W. Dunham",
        "J. Dunham",
        "M. Emilio",
        "W. G. Ferrante",
        "T. George",
        "W. Hanna",
        "G. Isopi",
        "R. Jones",
        "D. A. Kenyon",
        "S. Kerr",
        "V. Kouprianov",
        "P. D. Maley",
        "F. Mallia",
        "J. Mattei",
        "M. Meunier",
        "T. Napoleao",
        "V. F. Peixoto",
        "J. Pollock",
        "C. Snodgrass",
        "A. Stechina",
        "W. Thomas",
        "R. Venable",
        "G. R. Viscome",
        "A. Zapparata",
        "J. Bardecker",
        "N. Castro",
        "C. Cebral",
        "A. Chapman",
        "C. Gao",
        "K. Green",
        "A. Guimaraes",
        "C. Jacques",
        "E. Jehin",
        "M. Konishi",
        "R. Leiva",
        "L. Liberato",
        "C. Magliano",
        "L. A. Mammana",
        "M. Melita",
        "V. Moura",
        "Y. Olivera-Cuello",
        "L. Peiro",
        "J. Spagnotto",
        "P. C. Stuart",
        "L. Vanzi",
        "A. Wilberger",
        "M. Malacarne"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T17:20:09Z",
      "updated": "2026-01-14T17:20:09Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09639v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09639v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 7,
      "summary": "**Why It Matters**\n\nOur solar system extends far beyond the familiar planets, into a mysterious realm of icy worlds called Trans-Neptunian Objects—ancient remnants from when our solar system was first forming 4.6 billion years ago. These distant objects are like cosmic time capsules, preserving clues about the raw materials and processes that built the planets we know today. Understanding these primitive worlds helps us piece together the story of how Earth and the other planets came to be, and reveals the incredible diversity of objects that populate planetary systems throughout the universe.\n\n**What They Did**\n\nScientists used a clever technique called stellar occultation to study Ixion, one of the largest of these distant icy worlds. Think of it like watching Ixion's shadow as it passes in front of a distant star—just as you might block out the sun with your thumb to study its size and shape. When Ixion moved between Earth and a background star, it created a brief shadow that swept across our planet. By coordinating 51 telescopes around the world during eight different shadow events between 2020 and 2023, researchers could precisely measure how long the star disappeared from each location. This gave them multiple \"chords\" cutting across Ixion's silhouette, like slicing through an apple to understand its shape.\n\n**Key Findings**\n\nIxion turned out to be roughly 697 kilometers across—about the width of Texas—making it significantly smaller than our Moon but still one of the largest objects in the outer solar system. The measurements revealed it's slightly oval-shaped rather than perfectly round, stretched out by about 8%. Its surface is quite dark, reflecting only about 11% of the sunlight that hits it—darker than charcoal but brighter than fresh asphalt. The researchers found no evidence of an atmosphere or rings around Ixion.\n\n**Looking Forward**\n\nThese precise measurements of Ixion provide a crucial benchmark for understanding how large icy worlds form and evolve in the outer reaches of planetary systems. As we discover similar objects around other stars, Ixion serves as a local example of what these distant worlds might be like, helping us understand the full diversity of planetary system architecture across the galaxy.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Our solar system extends far beyond the familiar planets, into a mysterious realm of icy worlds called Trans-Neptunian Objects—ancient remnants from when our solar system was first forming 4.6 billion years ago. These distant objects are like cosmic time capsules, preserving clues about the raw materials and processes that built the planets we know today. Understanding these primitive worlds helps us piece together the story of how Earth and the other planets came to be, and reveals the incredible diversity of objects that populate planetary systems throughout the universe.</p>\n<h4>What They Did</h4>\n<p>Scientists used a clever technique called stellar occultation to study Ixion, one of the largest of these distant icy worlds. Think of it like watching Ixion's shadow as it passes in front of a distant star—just as you might block out the sun with your thumb to study its size and shape. When Ixion moved between Earth and a background star, it created a brief shadow that swept across our planet. By coordinating 51 telescopes around the world during eight different shadow events between 2020 and 2023, researchers could precisely measure how long the star disappeared from each location. This gave them multiple \"chords\" cutting across Ixion's silhouette, like slicing through an apple to understand its shape.</p>\n<h4>Key Findings</h4>\n<p>Ixion turned out to be roughly 697 kilometers across—about the width of Texas—making it significantly smaller than our Moon but still one of the largest objects in the outer solar system. The measurements revealed it's slightly oval-shaped rather than perfectly round, stretched out by about 8%. Its surface is quite dark, reflecting only about 11% of the sunlight that hits it—darker than charcoal but brighter than fresh asphalt. The researchers found no evidence of an atmosphere or rings around Ixion.</p>\n<h4>Looking Forward</h4>\n<p>These precise measurements of Ixion provide a crucial benchmark for understanding how large icy worlds form and evolve in the outer reaches of planetary systems. As we discover similar objects around other stars, Ixion serves as a local example of what these distant worlds might be like, helping us understand the full diversity of planetary system architecture across the galaxy.</p>",
      "tweet_hook": {
        "hook": "Ixion is 697 km across and slightly squashed - stellar occultations reveal precise shape of this ancient Plutino",
        "claim": "First accurate size and shape measurement of one of the largest Trans-Neptunian objects",
        "evidence": "Multi-chord occultations from 51 observations show oblateness of 0.081 and 10.6% albedo",
        "question": "Why do some large TNOs stay round while others get elongated or deformed?"
      },
      "figure_url": "https://arxiv.org/html/2601.09639v1/x1.png"
    },
    {
      "id": "2601.09401v1",
      "title": "True Masses using RV data with Hipparcos and Gaia Astrometry",
      "abstract": "Long-period companions are detected and characterized thanks to long-baseline radial velocity surveys. Combining Doppler time-series with astrometry, and in particular with proper motion anomalies technique, it is possible to put strong constraints on their orbital inclination and true mass. This work aims to present a model that combines Hipparcos and Gaia astrometric data with radial velocity measurements to constrain the orbital inclinations and true masses of long-period companions. Additionally, we re-analyse a small sample of targets that have not yet been studied using this combined approach. This research leverages the simultaneous modelling of proper motion anomalies and radial velocities, in conjunction with an analysis of the sensitivity curve. This approach serves not only as a verification of the parameters but also as a means to acquire valuable insights into planetary systems. The new analyses reveal that some of the targets classified as brown dwarfs or small-mass stars have a planetary nature. HD 5388 b and HD 6718 b are likely planets. HD 141937 b is likely a planet, but the current dataset does not allow us to firmly constrain its true mass. HD 16760 b belongs to the brown dwarf regime and it has a probable second companion. 30 Ari B b falls within the stellar regime, but the presence of an additional stellar companion could compromise the reliability of the final results. For HD 148427 b, HD 96127 b and HIP 65891 b we determined a range for the orbital inclinations.",
      "authors": [
        "G. Piccinini",
        "A. Petralia",
        "A. Sozzetti",
        "S. Benatti",
        "D. Gandolfi",
        "G. Micela"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T11:44:26Z",
      "updated": "2026-01-14T11:44:26Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09401v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09401v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 7,
      "summary": "**Why It Matters**\n\nImagine trying to weigh an invisible bowling ball by watching how it makes a rope swing when tied to the other end. That's essentially the challenge astronomers face when studying distant planets orbiting other stars. For decades, we've been finding these \"exoplanets\" by detecting their gravitational tugs on their host stars, but determining their actual masses—a crucial detail for understanding what they're made of and whether they could support life—has remained frustratingly difficult. This research tackles that fundamental problem, helping us distinguish between true planets, failed stars called brown dwarfs, and small stellar companions. Getting these classifications right is essential for understanding how planetary systems form and for identifying worlds that might be habitable.\n\n**What They Did**\n\nThe researchers combined two powerful detective techniques to solve the mass mystery. First, they used radial velocity measurements—essentially watching stars wobble back and forth as unseen companions orbit them, like watching a parent spin around while holding a child's hands. Second, they analyzed tiny changes in how stars move across the sky over decades, comparing ultra-precise measurements from two space missions: Hipparcos (launched in 1989) and Gaia (launched in 2013). By combining these complementary approaches, they could determine not just that something was orbiting these stars, but also the angle at which we're viewing the orbit—the key missing piece needed to calculate true masses rather than just minimum estimates.\n\n**Key Findings**\n\nThe team re-examined eight mysterious objects and discovered that some previously misclassified companions are actually planets in disguise. Two objects around stars HD 5388 and HD 6718 turned out to be planets rather than brown dwarfs. Another companion around HD 141937 likely falls into the planetary category, though more data is needed for certainty. However, HD 16760's companion confirmed its status as a brown dwarf—a \"failed star\" too small to sustain nuclear fusion—and revealed hints of a second hidden companion in the system.\n\n**Looking Forward**\n\nThis work demonstrates how combining different observational techniques can revolutionize our understanding of distant worlds. As Gaia continues collecting data and future space missions provide even more precise measurements, we'll be able to determine true masses for thousands of exoplanets. This will help astronomers better understand how planetary systems form and evolve, and more accurately identify Earth-like worlds that might harbor life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to weigh an invisible bowling ball by watching how it makes a rope swing when tied to the other end. That's essentially the challenge astronomers face when studying distant planets orbiting other stars. For decades, we've been finding these \"exoplanets\" by detecting their gravitational tugs on their host stars, but determining their actual masses—a crucial detail for understanding what they're made of and whether they could support life—has remained frustratingly difficult. This research tackles that fundamental problem, helping us distinguish between true planets, failed stars called brown dwarfs, and small stellar companions. Getting these classifications right is essential for understanding how planetary systems form and for identifying worlds that might be habitable.</p>\n<h4>What They Did</h4>\n<p>The researchers combined two powerful detective techniques to solve the mass mystery. First, they used radial velocity measurements—essentially watching stars wobble back and forth as unseen companions orbit them, like watching a parent spin around while holding a child's hands. Second, they analyzed tiny changes in how stars move across the sky over decades, comparing ultra-precise measurements from two space missions: Hipparcos (launched in 1989) and Gaia (launched in 2013). By combining these complementary approaches, they could determine not just that something was orbiting these stars, but also the angle at which we're viewing the orbit—the key missing piece needed to calculate true masses rather than just minimum estimates.</p>\n<h4>Key Findings</h4>\n<p>The team re-examined eight mysterious objects and discovered that some previously misclassified companions are actually planets in disguise. Two objects around stars HD 5388 and HD 6718 turned out to be planets rather than brown dwarfs. Another companion around HD 141937 likely falls into the planetary category, though more data is needed for certainty. However, HD 16760's companion confirmed its status as a brown dwarf—a \"failed star\" too small to sustain nuclear fusion—and revealed hints of a second hidden companion in the system.</p>\n<h4>Looking Forward</h4>\n<p>This work demonstrates how combining different observational techniques can revolutionize our understanding of distant worlds. As Gaia continues collecting data and future space missions provide even more precise measurements, we'll be able to determine true masses for thousands of exoplanets. This will help astronomers better understand how planetary systems form and evolve, and more accurately identify Earth-like worlds that might harbor life.</p>",
      "tweet_hook": {
        "hook": "Some \"brown dwarfs\" are actually planets - we've been measuring their masses wrong this whole time",
        "claim": "Combining Gaia+Hipparcos astrometry with RV data reveals true masses of long-period companions",
        "evidence": "Method: Proper motion anomalies + radial velocities constrain orbital inclinations and masses",
        "question": "How many other \"failed stars\" will turn out to be massive planets instead?"
      },
      "figure_url": "https://arxiv.org/html/2601.09401v1/Figures/Validation/senscurve_TOT_GJ463b_DR3.png"
    }
  ]
}