{
  "updated_at": "2026-01-16T18:16:04.831798+00:00",
  "category": "astro-ph.EP",
  "paper_count": 15,
  "papers": [
    {
      "id": "2601.10598v1",
      "title": "A young progenitor for the most common planetary systems in the Galaxy",
      "abstract": "The Galaxy's most common known planetary systems have several Earth-to-Neptune-size planets in compact orbits. At small orbital separations, larger planets are less common than their smaller counterparts by an order of magnitude. The young star V1298 Tau hosts one such compact planetary system, albeit with four planets that are uncommonly large (5 to 10 Earth radii). The planets form a chain of near-resonances that result in transit-timing variations of several hours. Here we present a multi-year campaign to characterize this system with transit-timing variations, a method insensitive to the intense magnetic activity of the star. Through targeted observations, we first resolved the previously unknown orbital period of the outermost planet. The full 9-year baseline from these and archival data then enabled robust determination of the masses and orbital parameters for all four planets. We find the planets have low, sub-Neptune masses and nearly circular orbits, implying a dynamically tranquil history. Their low masses and large radii indicate that the inner planets underwent a period of rapid cooling immediately after dispersal of the protoplanetary disk. Still, they are much less dense than mature planets of comparable size. We predict the planets will contract to 1.5-4.0 Earth radii and join the population of super-Earths and sub-Neptunes that nature produces in abundance.",
      "authors": [
        "John H. Livingston",
        "Erik A. Petigura",
        "Trevor J. David",
        "Kento Masuda",
        "James Owen",
        "David Nesvorný",
        "Konstantin Batygin",
        "Jerome de Leon",
        "Mayuko Mori",
        "Kai Ikuta",
        "Akihiko Fukui",
        "Noriharu Watanabe",
        "Jaume Orell Miquel",
        "Felipe Murgas",
        "Hannu Parviainen",
        "Judith Korth",
        "Florence Libotte",
        "Néstor Abreu García",
        "Pedro Pablo Meni Gallardo",
        "Norio Narita",
        "Enric Pallé",
        "Motohide Tamura",
        "Atsunori Yonehara",
        "Andrew Ridden-Harper",
        "Allyson Bieryla",
        "Alessandro A. Trani",
        "Eric E. Mamajek",
        "David R. Ciardi",
        "Varoujan Gorjian",
        "Lynne A. Hillenbrand",
        "Luisa M. Rebull",
        "Elisabeth R. Newton",
        "Andrew W. Mann",
        "Andrew Vanderburg",
        "Guðmundur Stefánsson",
        "Suvrath Mahadevan",
        "Caleb Cañas",
        "Joe Ninan",
        "Jesus Higuera",
        "Kamen Todorov",
        "Jean-Michel Désert",
        "Lorenzo Pino"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T17:07:23Z",
      "updated": "2026-01-15T17:07:23Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10598v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10598v1",
      "summary": "**Why It Matters**\n\nMost planetary systems in our galaxy look nothing like our solar system. Instead of having small rocky planets close to their star and gas giants farther out, the typical system has several medium-sized planets packed tightly together, all orbiting closer to their star than Mercury orbits our Sun. Understanding how these common systems form and evolve helps us grasp the fundamental processes that create planets throughout the universe. It also gives us insight into whether Earth-like conditions might be common or rare, which has profound implications for the search for life beyond our solar system.\n\n**What They Did**\n\nAstronomers spent nine years carefully studying a young star called V1298 Tau, located about 350 light-years away. This star hosts four planets that are much larger than Earth but smaller than Jupiter—think Neptune-sized worlds. The researchers used a clever technique called transit-timing variations, which works like tracking a train schedule. When planets pass in front of their star (called a transit), they should arrive on a predictable schedule. But when multiple planets gravitationally tug on each other, these \"trains\" run early or late by hours. By precisely measuring these timing changes over nearly a decade, scientists could determine each planet's mass and orbit without being fooled by the young star's intense magnetic activity.\n\n**Key Findings**\n\nThe four planets are surprisingly puffy—about 5 to 10 times Earth's radius but with relatively low masses, making them much less dense than a mature planet should be. They're like cosmic cotton balls compared to the dense, compressed planets we typically see. The planets orbit in a delicate gravitational dance, with their orbital periods related by simple ratios. Despite their current large size, the researchers calculated that these planets are rapidly shrinking as they cool down from their recent formation.\n\n**Looking Forward**\n\nThis discovery provides a rare glimpse into planetary adolescence—catching planets in the act of growing up. The researchers predict these bloated worlds will shrink to 1.5 to 4 times Earth's size, becoming the super-Earths and mini-Neptunes that represent the galaxy's most common planet types. This finding helps solve the mystery of how such systems form and suggests we're witnessing the early stages of what will become a typical planetary family.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Most planetary systems in our galaxy look nothing like our solar system. Instead of having small rocky planets close to their star and gas giants farther out, the typical system has several medium-sized planets packed tightly together, all orbiting closer to their star than Mercury orbits our Sun. Understanding how these common systems form and evolve helps us grasp the fundamental processes that create planets throughout the universe. It also gives us insight into whether Earth-like conditions might be common or rare, which has profound implications for the search for life beyond our solar system.</p>\n<h4>What They Did</h4>\n<p>Astronomers spent nine years carefully studying a young star called V1298 Tau, located about 350 light-years away. This star hosts four planets that are much larger than Earth but smaller than Jupiter—think Neptune-sized worlds. The researchers used a clever technique called transit-timing variations, which works like tracking a train schedule. When planets pass in front of their star (called a transit), they should arrive on a predictable schedule. But when multiple planets gravitationally tug on each other, these \"trains\" run early or late by hours. By precisely measuring these timing changes over nearly a decade, scientists could determine each planet's mass and orbit without being fooled by the young star's intense magnetic activity.</p>\n<h4>Key Findings</h4>\n<p>The four planets are surprisingly puffy—about 5 to 10 times Earth's radius but with relatively low masses, making them much less dense than a mature planet should be. They're like cosmic cotton balls compared to the dense, compressed planets we typically see. The planets orbit in a delicate gravitational dance, with their orbital periods related by simple ratios. Despite their current large size, the researchers calculated that these planets are rapidly shrinking as they cool down from their recent formation.</p>\n<h4>Looking Forward</h4>\n<p>This discovery provides a rare glimpse into planetary adolescence—catching planets in the act of growing up. The researchers predict these bloated worlds will shrink to 1.5 to 4 times Earth's size, becoming the super-Earths and mini-Neptunes that represent the galaxy's most common planet types. This finding helps solve the mystery of how such systems form and suggests we're witnessing the early stages of what will become a typical planetary family.</p>"
    },
    {
      "id": "2601.10508v1",
      "title": "sponchpop II: Population Synthesis to Investigate Volatile Sulfur as a Fingerprint of Gas Giant Formation Histories",
      "abstract": "Planet population synthesis is an integral tool for linking exoplanets to their formation environments. Most planet population synthesis studies have focused on the carbon-to-oxygen ratio (C/O) in gas or solids, yet more insight into planet formation may be afforded by considering a wider suite of elements. Sulfur is one such key element. It has been assumed to be entirely refractory in population synthesis models, restricting it to being a tracer of accreted rocky solids. However, sulfur also has a volatile reservoir dominant at the onset of star and planet formation. We investigate sulfur's wider potential as a formation history tracer by implementing the first multi-phase treatment of S in a planet population synthesis model. We present the planet formation module of \\textsc{sponchpop} and its first predicted planet growth tracks and populations. We explore the diversity of planet compositions in terms of their sulfur budget, including both refractory and volatile components, and apply a novel gas-grain conversion of sulfur to study how formation trajectories of giant planets relate to final core and envelope compositions. We show that planets inherit a wide range of core and envelope sulfur content related to accretion history while considering late-stage planetesimal infall, providing a new diagnostic tool for planet formation. The diverse sulfur content of planet cores suggests some rocky planets may be born sulfur-poor, with implications for their geochemistry and habitability. Enhanced sulfur abundances in gas-giant atmospheres can be attributed to formation beyond the H2S iceline, such as the giants in our Solar System.",
      "authors": [
        "Anna Sommerville-Thomas",
        "Mihkel Kama",
        "Oliver Shottle",
        "Jason Ran"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T15:34:21Z",
      "updated": "2026-01-15T15:34:21Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10508v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10508v1",
      "summary": "**Why It Matters**\n\nWhen we look up at the night sky, we're seeing just a tiny fraction of the planets that exist in our galaxy. Scientists have discovered thousands of exoplanets—worlds orbiting other stars—but we're still piecing together how these alien worlds formed and whether any might harbor life. This research focuses on sulfur, a common element that could serve as a cosmic detective, revealing the life story of planets from their birth in swirling disks of gas and dust around young stars. Understanding how planets form isn't just academic curiosity—it helps us understand how rare or common Earth-like worlds might be, and whether the conditions that led to life here exist elsewhere in the universe.\n\n**What They Did**\n\nThe researchers created a sophisticated computer simulation that models how planets form and grow over millions of years. Think of it like a cosmic recipe simulator that tracks not just the main ingredients (like carbon and oxygen), but also sulfur—an element that behaves differently depending on temperature and location in a planetary system. Previous models treated sulfur as if it only existed in solid, rocky form. But the team recognized that sulfur can also exist as a gas, especially in the cold outer regions of planetary systems where it freezes into ice. Their simulation follows virtual planets as they gobble up material and migrate through their solar systems, tracking how much sulfur they collect and in what form.\n\n**Key Findings**\n\nThe simulation revealed that planets are like cosmic hoarders with very different sulfur collections depending on where and how they formed. Gas giants that formed in the cold outer reaches of their solar systems—beyond what scientists call the \"sulfur snow line\" where sulfur compounds freeze—end up with sulfur-rich atmospheres, much like Jupiter and Saturn in our own solar system. Meanwhile, rocky planets closer to their stars can end up surprisingly sulfur-poor, which could dramatically affect their geology and potential for hosting life, since sulfur plays important roles in planetary chemistry and atmosphere formation.\n\n**Looking Forward**\n\nThis research opens up exciting new possibilities for understanding exoplanets. As next-generation telescopes come online, astronomers will be able to detect sulfur in the atmospheres of distant worlds, essentially reading their formation stories written in starlight. This could help us identify which planets formed in environments similar to Earth, bringing us closer to answering whether our planet's life-friendly conditions are common or extraordinarily rare in the cosmos.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>When we look up at the night sky, we're seeing just a tiny fraction of the planets that exist in our galaxy. Scientists have discovered thousands of exoplanets—worlds orbiting other stars—but we're still piecing together how these alien worlds formed and whether any might harbor life. This research focuses on sulfur, a common element that could serve as a cosmic detective, revealing the life story of planets from their birth in swirling disks of gas and dust around young stars. Understanding how planets form isn't just academic curiosity—it helps us understand how rare or common Earth-like worlds might be, and whether the conditions that led to life here exist elsewhere in the universe.</p>\n<h4>What They Did</h4>\n<p>The researchers created a sophisticated computer simulation that models how planets form and grow over millions of years. Think of it like a cosmic recipe simulator that tracks not just the main ingredients (like carbon and oxygen), but also sulfur—an element that behaves differently depending on temperature and location in a planetary system. Previous models treated sulfur as if it only existed in solid, rocky form. But the team recognized that sulfur can also exist as a gas, especially in the cold outer regions of planetary systems where it freezes into ice. Their simulation follows virtual planets as they gobble up material and migrate through their solar systems, tracking how much sulfur they collect and in what form.</p>\n<h4>Key Findings</h4>\n<p>The simulation revealed that planets are like cosmic hoarders with very different sulfur collections depending on where and how they formed. Gas giants that formed in the cold outer reaches of their solar systems—beyond what scientists call the \"sulfur snow line\" where sulfur compounds freeze—end up with sulfur-rich atmospheres, much like Jupiter and Saturn in our own solar system. Meanwhile, rocky planets closer to their stars can end up surprisingly sulfur-poor, which could dramatically affect their geology and potential for hosting life, since sulfur plays important roles in planetary chemistry and atmosphere formation.</p>\n<h4>Looking Forward</h4>\n<p>This research opens up exciting new possibilities for understanding exoplanets. As next-generation telescopes come online, astronomers will be able to detect sulfur in the atmospheres of distant worlds, essentially reading their formation stories written in starlight. This could help us identify which planets formed in environments similar to Earth, bringing us closer to answering whether our planet's life-friendly conditions are common or extraordinarily rare in the cosmos.</p>"
    },
    {
      "id": "2601.10450v1",
      "title": "TOI-3862 b: A dense super-Neptune deep in the hot Neptune desert",
      "abstract": "The structure and evolution of close-in exoplanets are shaped by atmospheric loss and migration processes, which give rise to key population features such as the hot Neptune desert, ridge, and savanna - regions of the period-radius space whose boundaries offer critical insights into planetary formation and survival. As part of the KESPRINT collaboration, we selected the TESS transiting planet candidate TOI-3862.01 for radial velocity follow-up to confirm its planetary nature and characterize its mass and bulk properties. This planet candidate is of particular interest due to its position in the middle of the hot Neptune desert, making it a valuable probe for testing theories of planet migration and atmospheric loss. We confirmed the planetary nature and determined the mass of TOI-3862.01 (hereinafter TOI-3862b) by performing a joint fit with both transit and radial velocity data, precisely characterizing the bulk properties of this planet. TOI-3862b is a super-Neptune on a 1.56-day orbit around a Sun-like star with an effective temperature of 5300$\\pm$50K. It has a mass of 53.7$_{-2.9}^{+2.8}$ M$_{\\oplus}$ and a radius of 5.53$\\pm$0.18 R$_{\\oplus}$, corresponding to a density of 1.7$\\pm$0.2 g/cm^3. This places it among the rare population of hot and dense super-Neptune desert planets. TOI-3862b, residing deep in the hot Neptune desert, represents a rare occurrence in an otherwise sparsely populated region, offering a valuable opportunity to probe the processes that may allow planets to survive in such environments.",
      "authors": [
        "Ilaria Carleo",
        "Amadeo Castro-González",
        "Enric Pallé",
        "Felipe Murgas",
        "Grzegorz Nowak",
        "Gaia Lacedelli",
        "Thomas Masseron",
        "Emily W. Wong",
        "Patrick Eggenberger",
        "Vincent Bourrier",
        "Dawid Jankowski",
        "Krzysztof Goździewski",
        "Douglas R. Alves",
        "James S. Jenkins",
        "Sergio Messina",
        "Keivan G. Stassun",
        "Jose I. Vines",
        "Matteo Brogi",
        "David R. Ciardi",
        "Catherine A. Clark",
        "William Cochran",
        "Karen A. Collins",
        "Hans J. Deeg",
        "Elise Furlan",
        "Davide Gandolfi",
        "Samuel Geraldía González",
        "Artie P. Hatzes",
        "Coel Hellier",
        "Steve B. Howell",
        "Judith Korth",
        "Jorge Lillo-Box",
        "John H. Livingston",
        "Jaume Orell-Miquel",
        "Carina M. Persson",
        "Seth Redfield",
        "Boris Safonov",
        "David Baker",
        "Rafael Delfin Barrena Delgado",
        "Allyson Bieryla",
        "Andrew Boyle",
        "Pau Bosch-Cabot",
        "Núria Casasayas Barris",
        "Stavros Chairetas",
        "Jerome P. de Leon",
        "Izuru Fukuda",
        "Akihiko Fukui",
        "Pere Guerra",
        "Kai Ikuta",
        "Kiyoe Kawauchi",
        "Emil Knudstrup",
        "Florence Libotte",
        "Michael B. Lund",
        "Rafael Luque",
        "Eduardo Lorenzo Martín Guerrero de Escalante",
        "Bob Massey",
        "Edward J. Michaels",
        "Giuseppe Morello",
        "Norio Narita",
        "Hannu Parvianien",
        "Richard P. Schwarz",
        "Avi Shporer",
        "Monika Stangret",
        "Noriharu Watanabe",
        "Cristilyn N. Watkins"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T14:39:32Z",
      "updated": "2026-01-15T14:39:32Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10450v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10450v1",
      "summary": "**Why It Matters**\n\nImagine trying to survive in the Sahara Desert—it's possible, but extremely rare to find thriving life there. Astronomers have discovered a similar \"desert\" in space, but instead of lacking water, it lacks a specific type of planet. This cosmic desert is missing hot Neptunes—planets about the size of Neptune that orbit dangerously close to their stars. Understanding why this desert exists helps us piece together the epic story of how planets form, migrate, and sometimes get their atmospheres stripped away by stellar radiation. Each rare planet found surviving in this hostile environment is like discovering a thriving oasis, offering clues about planetary evolution that could ultimately help us understand how worlds like Earth come to exist and persist.\n\n**What They Did**\n\nThe research team used NASA's planet-hunting TESS telescope to spot a promising candidate planet, then followed up with ground-based telescopes to confirm it was real. They employed two complementary techniques: watching the planet transit (cross in front of) its star to measure its size, and detecting the tiny wobble the planet causes in its star's motion to determine its mass. Think of it like weighing and measuring a person to calculate their density—except this \"person\" is a planet 53 times more massive than Earth, located hundreds of light-years away.\n\n**Key Findings**\n\nThe newly confirmed planet, TOI-3862b, is truly remarkable. It's about 5.5 times wider than Earth and 54 times more massive, making it a \"super-Neptune.\" This dense world whips around its Sun-like star in just 1.56 days—imagine a year lasting less than two Earth days! What makes it special is its location in the hot Neptune desert, where such planets are incredibly rare. Its density of 1.7 grams per cubic centimeter suggests it has managed to retain a substantial atmosphere despite the intense stellar radiation trying to strip it away.\n\n**Looking Forward**\n\nThis discovery opens exciting new questions about planetary survival. How did TOI-3862b avoid the fate that befell other planets in this cosmic desert? Did it migrate inward recently, or does it have some special protection mechanism? Future observations with advanced telescopes could analyze its atmosphere, potentially revealing the secrets of its survival and helping astronomers understand the complex dance of planetary formation and evolution throughout the galaxy.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to survive in the Sahara Desert—it's possible, but extremely rare to find thriving life there. Astronomers have discovered a similar \"desert\" in space, but instead of lacking water, it lacks a specific type of planet. This cosmic desert is missing hot Neptunes—planets about the size of Neptune that orbit dangerously close to their stars. Understanding why this desert exists helps us piece together the epic story of how planets form, migrate, and sometimes get their atmospheres stripped away by stellar radiation. Each rare planet found surviving in this hostile environment is like discovering a thriving oasis, offering clues about planetary evolution that could ultimately help us understand how worlds like Earth come to exist and persist.</p>\n<h4>What They Did</h4>\n<p>The research team used NASA's planet-hunting TESS telescope to spot a promising candidate planet, then followed up with ground-based telescopes to confirm it was real. They employed two complementary techniques: watching the planet transit (cross in front of) its star to measure its size, and detecting the tiny wobble the planet causes in its star's motion to determine its mass. Think of it like weighing and measuring a person to calculate their density—except this \"person\" is a planet 53 times more massive than Earth, located hundreds of light-years away.</p>\n<h4>Key Findings</h4>\n<p>The newly confirmed planet, TOI-3862b, is truly remarkable. It's about 5.5 times wider than Earth and 54 times more massive, making it a \"super-Neptune.\" This dense world whips around its Sun-like star in just 1.56 days—imagine a year lasting less than two Earth days! What makes it special is its location in the hot Neptune desert, where such planets are incredibly rare. Its density of 1.7 grams per cubic centimeter suggests it has managed to retain a substantial atmosphere despite the intense stellar radiation trying to strip it away.</p>\n<h4>Looking Forward</h4>\n<p>This discovery opens exciting new questions about planetary survival. How did TOI-3862b avoid the fate that befell other planets in this cosmic desert? Did it migrate inward recently, or does it have some special protection mechanism? Future observations with advanced telescopes could analyze its atmosphere, potentially revealing the secrets of its survival and helping astronomers understand the complex dance of planetary formation and evolution throughout the galaxy.</p>"
    },
    {
      "id": "2601.10285v1",
      "title": "How disc initial conditions sculpt the atmospheric composition of giant planets",
      "abstract": "Past studies have revealed the dependency of the disc parameters (mass, radius, viscosity, grain fragmentation velocity, dust-to-gas ratio) on the formation of giant planets, where more massive discs seem beneficial for giant planet formation. It is unclear how the different disc properties influence the composition of forming giant planets. The idea that the atmospheric abundances can trace directly the formation location of planets is put into question, due to the chemical evolution of the disc, caused by inward drifting and evaporating pebbles. This complicates the idea of a relation between atmospheric abundances and planet formation locations. We use planet formation simulations that include the effects of pebble drift and evaporation and investigate how the different disc parameters influence the atmospheric composition of giant planets. We focus on the atmospheric C/O, C/H, O/H and S/H ratios allowing us to probe tracers for volatiles and refractories and thus different accretion pathways of giant planets. We find that most of the disc parameters have only a limited influence on the atmospheric abundances of gas giants, except for the dust-to-gas ratio, where a larger value results in higher atmospheric abundances. However the atmospheric abundances are determined by the planetary formation location, even in the pebble drift and evaporation scenario. Our study suggests that volatile-rich giant exoplanets predominantly form in the inner disc regions, where they can accrete large fractions of vapour-enhanced gas. Our study shows that simulations that try to trace the origin of giant planets via their atmospheric abundances do not have to probe all disc parameters, as long as the disc parameters allow the formation of giant planets. Our study thus suggests that the diversity of observed planetary compositions is a direct consequence of their formation location and migration history.",
      "authors": [
        "Angie Daniela Guzmán Franco",
        "Sofia Savvidou",
        "Bertram Bitsch"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T11:01:08Z",
      "updated": "2026-01-15T11:01:08Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10285v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10285v1",
      "summary": "**Why It Matters**\n\nWhen we look up at the night sky and wonder about other worlds, one of the biggest questions is: where do planets come from, and why are they so different from each other? Scientists have discovered thousands of planets orbiting other stars, and they come in an amazing variety—some are gas giants bigger than Jupiter, others are rocky worlds, and many have atmospheric compositions unlike anything in our solar system. Understanding how these distant worlds formed doesn't just satisfy our cosmic curiosity; it helps us understand how rare or common Earth-like planets might be, and ultimately, how likely we are to find life elsewhere in the universe.\n\n**What They Did**\n\nThe researchers created detailed computer simulations of planetary nurseries—the swirling disks of gas and dust that surround newborn stars, where planets are born. Think of these disks like cosmic construction sites, with tiny particles constantly moving around and sticking together to eventually build planets. The team focused specifically on how giant planets (like Jupiter or Saturn) form and what their atmospheres end up looking like. They paid special attention to how dust and ice particles drift inward toward the star over time, evaporating and releasing gases that get mixed into the planetary atmospheres. By tweaking different conditions in their simulated disks—like how much dust was present or how massive the disk was—they could see how these factors influenced the final atmospheric recipes of the giant planets that formed.\n\n**Key Findings**\n\nSurprisingly, most of the disk conditions they tested didn't dramatically change what ended up in giant planets' atmospheres. The main exception was the amount of dust relative to gas—more dusty disks produced planets with richer, more chemically diverse atmospheres. But here's the key discovery: where a planet forms in the disk matters much more than the overall disk conditions. Planets that form closer to their star tend to have atmospheres loaded with volatile compounds (substances that easily turn from solid to gas), because there's more evaporated material in those inner regions for them to gobble up during formation.\n\n**Looking Forward**\n\nThis research suggests that when astronomers study the atmospheres of distant giant planets—something we're getting better at with powerful new telescopes—they're essentially reading the planets' birth certificates. The chemical fingerprints tell us not just what these worlds are made of, but where they formed and how they traveled to their current locations. This could revolutionize how we interpret observations of exoplanets and help us build a clearer picture of how planetary systems, including our own, came to be arranged the way they are.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>When we look up at the night sky and wonder about other worlds, one of the biggest questions is: where do planets come from, and why are they so different from each other? Scientists have discovered thousands of planets orbiting other stars, and they come in an amazing variety—some are gas giants bigger than Jupiter, others are rocky worlds, and many have atmospheric compositions unlike anything in our solar system. Understanding how these distant worlds formed doesn't just satisfy our cosmic curiosity; it helps us understand how rare or common Earth-like planets might be, and ultimately, how likely we are to find life elsewhere in the universe.</p>\n<h4>What They Did</h4>\n<p>The researchers created detailed computer simulations of planetary nurseries—the swirling disks of gas and dust that surround newborn stars, where planets are born. Think of these disks like cosmic construction sites, with tiny particles constantly moving around and sticking together to eventually build planets. The team focused specifically on how giant planets (like Jupiter or Saturn) form and what their atmospheres end up looking like. They paid special attention to how dust and ice particles drift inward toward the star over time, evaporating and releasing gases that get mixed into the planetary atmospheres. By tweaking different conditions in their simulated disks—like how much dust was present or how massive the disk was—they could see how these factors influenced the final atmospheric recipes of the giant planets that formed.</p>\n<h4>Key Findings</h4>\n<p>Surprisingly, most of the disk conditions they tested didn't dramatically change what ended up in giant planets' atmospheres. The main exception was the amount of dust relative to gas—more dusty disks produced planets with richer, more chemically diverse atmospheres. But here's the key discovery: where a planet forms in the disk matters much more than the overall disk conditions. Planets that form closer to their star tend to have atmospheres loaded with volatile compounds (substances that easily turn from solid to gas), because there's more evaporated material in those inner regions for them to gobble up during formation.</p>\n<h4>Looking Forward</h4>\n<p>This research suggests that when astronomers study the atmospheres of distant giant planets—something we're getting better at with powerful new telescopes—they're essentially reading the planets' birth certificates. The chemical fingerprints tell us not just what these worlds are made of, but where they formed and how they traveled to their current locations. This could revolutionize how we interpret observations of exoplanets and help us build a clearer picture of how planetary systems, including our own, came to be arranged the way they are.</p>"
    },
    {
      "id": "2601.09835v1",
      "title": "A Robust Launching Mechanism for Freely-Floating Planets from Host Stars with Close-in Planets",
      "abstract": "Secular perturbations from binary stars and distant massive planets can drive cold planets onto nearly parabolic orbits with pericenter passages extremely close to their host stars. Meanwhile, short-period super-Earths are frequently observed around nearby stars. Gravitational scattering between these two distinct populations can lead to substantial orbital energy exchange, liberating some intruders from the gravitational confinement of their host systems. This process offers a robust formation channel for a subset of the abundant freely floating planet population. It may also significantly perturb the original orbits of close-in planets, induce collisional trajectories between close-in planets and their host stars, and disrupt the dynamical evolution of cold planets toward close stellar encounters.",
      "authors": [
        "Xiaochen Zheng",
        "Zhuoya Cao",
        "Shigeru Ida",
        "Douglas N. C. Lin",
        "Shude Mao"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T19:49:45Z",
      "updated": "2026-01-14T19:49:45Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09835v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09835v1",
      "summary": "**Why It Matters**\n\nImagine planets wandering through space without any star to call home—cosmic orphans drifting in the cold darkness between star systems. Astronomers have discovered that these \"rogue planets\" might be surprisingly common in our galaxy, possibly outnumbering planets that orbit stars like Earth does. Understanding how these lonely worlds form helps us grasp the chaotic and dynamic nature of planetary systems everywhere. It also reshapes our thinking about where life might exist in the universe, since some of these wandering worlds could potentially harbor conditions suitable for life, even without a nearby star's warmth.\n\n**What They Did**\n\nThe researchers used computer simulations to model a cosmic game of planetary billiards. They studied what happens when distant forces—like a companion star or a massive outer planet—gradually push a cold, outer planet toward its host star on a highly stretched, oval-shaped orbit. Picture a planet normally orbiting far from its star suddenly getting nudged into a path that brings it screaming inward, almost grazing the star's surface. The scientists then examined what occurs when this incoming \"intruder\" planet encounters the small, rocky worlds that often orbit very close to their stars. These inner planets, called super-Earths, are like cosmic sitting ducks in the path of the incoming visitor.\n\n**Key Findings**\n\nThe research revealed a surprisingly efficient mechanism for launching planets into interstellar space. When the incoming outer planet gravitationally interacts with the close-in planets, it's like a cosmic slingshot effect. Sometimes the outer planet gets flung completely out of the star system, becoming a freely floating world. Other times, the encounter dramatically alters the orbits of the inner planets, potentially sending them crashing into their star or ejecting them as well. This process provides a robust explanation for how many rogue planets throughout the galaxy might have formed.\n\n**Looking Forward**\n\nThis discovery offers a new lens for understanding planetary system evolution and the abundance of rogue planets. Future space telescopes might detect these wandering worlds, allowing astronomers to test these predictions. The research also suggests that planetary systems undergo more violent reshuffling than previously thought, which could help explain the diverse arrangements of planets we observe around other stars.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine planets wandering through space without any star to call home—cosmic orphans drifting in the cold darkness between star systems. Astronomers have discovered that these \"rogue planets\" might be surprisingly common in our galaxy, possibly outnumbering planets that orbit stars like Earth does. Understanding how these lonely worlds form helps us grasp the chaotic and dynamic nature of planetary systems everywhere. It also reshapes our thinking about where life might exist in the universe, since some of these wandering worlds could potentially harbor conditions suitable for life, even without a nearby star's warmth.</p>\n<h4>What They Did</h4>\n<p>The researchers used computer simulations to model a cosmic game of planetary billiards. They studied what happens when distant forces—like a companion star or a massive outer planet—gradually push a cold, outer planet toward its host star on a highly stretched, oval-shaped orbit. Picture a planet normally orbiting far from its star suddenly getting nudged into a path that brings it screaming inward, almost grazing the star's surface. The scientists then examined what occurs when this incoming \"intruder\" planet encounters the small, rocky worlds that often orbit very close to their stars. These inner planets, called super-Earths, are like cosmic sitting ducks in the path of the incoming visitor.</p>\n<h4>Key Findings</h4>\n<p>The research revealed a surprisingly efficient mechanism for launching planets into interstellar space. When the incoming outer planet gravitationally interacts with the close-in planets, it's like a cosmic slingshot effect. Sometimes the outer planet gets flung completely out of the star system, becoming a freely floating world. Other times, the encounter dramatically alters the orbits of the inner planets, potentially sending them crashing into their star or ejecting them as well. This process provides a robust explanation for how many rogue planets throughout the galaxy might have formed.</p>\n<h4>Looking Forward</h4>\n<p>This discovery offers a new lens for understanding planetary system evolution and the abundance of rogue planets. Future space telescopes might detect these wandering worlds, allowing astronomers to test these predictions. The research also suggests that planetary systems undergo more violent reshuffling than previously thought, which could help explain the diverse arrangements of planets we observe around other stars.</p>"
    },
    {
      "id": "2601.09492v1",
      "title": "Demographics of Close-In TESS Exoplanets Orbiting FGK Main-sequence Stars",
      "abstract": "Understanding the demographics of close-in planets is crucial for insights into exoplanet formation and evolution. We present a detailed analysis of occurrence rates for close-in (0.5-16 day) planets with radii between 2 and 20$\\,R_{\\oplus}$ around FGK main-sequence stars. Our study uses a comprehensive sample from four years of TESS Science Processing Operations Center full-frame image data cross-matched with Gaia, analysed through our rigorous detection, vetting, and validation pipeline. Using high-confidence planet candidates, we apply a hierarchical Bayesian model to determine occurrence rates in the two-dimensional orbital period-radius plane. Our results are presented using 10-by-10 bins across the period-radius parameter space, offering unprecedented resolution and statistical precision. We find an overall occurrence rate of $9.4^{+0.7}_{-0.6}\\%$. When using identical binning, our occurrence rate posteriors distributions align with Kepler's but have a magnitude smaller uncertainties on average. For hot Jupiters, we estimate the overall occurrence rate of $0.39^{+0.03}_{-0.02}\\%$. This value is consistent with the previous Kepler FGK-type result within $1σ$. We find an overall occurrence rate of Neptunian desert planets of $0.08\\pm0.01\\%$, to our knowledge the first such determination. Additionally, in a volume-limited Gaia subsample within 100 pc in the same parameter region, we measure an overall planet occurrence rate of $15.4^{+1.6}_{-1.5}\\%$ and a hot Jupiter occurrence rate of $0.42^{+0.16}_{-0.12}\\%$. Our results establishes an improved foundation for constraining theoretical models of exoplanet populations.",
      "authors": [
        "Kaiming Cui",
        "David J. Armstrong",
        "Andreas Hadjigeorghiou",
        "Marina Lafarga",
        "Vedad Kunovac",
        "Lauren Doyle",
        "Luis Agustín Nieto",
        "Rodrigo F. Díaz"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T13:59:49Z",
      "updated": "2026-01-14T13:59:49Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09492v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09492v1",
      "summary": "**Why It Matters**\n\nImagine trying to understand what makes a typical neighborhood by only studying one house—your own. That's essentially where we've been with planets until recently. We know our solar system has eight planets in fairly circular orbits, but what about the thousands of other planetary systems out there? This new research helps answer one of astronomy's biggest questions: how common are different types of planets, and what does that tell us about how planetary systems form? By creating the most detailed census yet of planets that orbit extremely close to their stars, scientists are building a cosmic population map that could eventually help us understand whether Earth-like worlds are rare or common in our galaxy.\n\n**What They Did**\n\nThe researchers used data from TESS (Transiting Exoplanet Survey Satellite), a space telescope that watches for the tiny dimming that occurs when a planet passes in front of its star—like a moth crossing a streetlight. They focused on planets orbiting sun-like stars, looking specifically at worlds that complete their orbits in just half a day to 16 days (compared to Earth's 365-day year). These \"close-in\" planets range from about twice Earth's size up to smaller gas giants. Using four years of TESS observations combined with precise star measurements from the Gaia spacecraft, they applied sophisticated statistical methods to determine not just which planets exist, but how common each type actually is throughout our galaxy.\n\n**Key Findings**\n\nThe results reveal that about 9.4% of sun-like stars host close-in planets between 2 and 20 times Earth's radius. Perhaps most intriguingly, they found that \"hot Jupiters\"—gas giants orbiting scorchingly close to their stars—appear around only 0.39% of stars, confirming these dramatic worlds are quite rare. They also measured planets in the \"Neptunian desert,\" a mysterious region where few Neptune-sized worlds are found close to their stars, discovering they occur around just 0.08% of stars. When they looked at nearby stars within about 326 light-years of Earth, the numbers were even higher, with 15.4% hosting close-in planets.\n\n**Looking Forward**\n\nThis cosmic census provides crucial benchmarks for testing theories about how planets form and migrate inward toward their stars. The precision of these measurements will help astronomers refine computer models of planetary system evolution and better predict where to search for potentially habitable worlds. As TESS continues surveying the sky and the James Webb Space Telescope begins studying exoplanet atmospheres, having accurate population statistics becomes essential for understanding which types of discoveries represent typical cosmic scenarios versus rare cosmic accidents.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to understand what makes a typical neighborhood by only studying one house—your own. That's essentially where we've been with planets until recently. We know our solar system has eight planets in fairly circular orbits, but what about the thousands of other planetary systems out there? This new research helps answer one of astronomy's biggest questions: how common are different types of planets, and what does that tell us about how planetary systems form? By creating the most detailed census yet of planets that orbit extremely close to their stars, scientists are building a cosmic population map that could eventually help us understand whether Earth-like worlds are rare or common in our galaxy.</p>\n<h4>What They Did</h4>\n<p>The researchers used data from TESS (Transiting Exoplanet Survey Satellite), a space telescope that watches for the tiny dimming that occurs when a planet passes in front of its star—like a moth crossing a streetlight. They focused on planets orbiting sun-like stars, looking specifically at worlds that complete their orbits in just half a day to 16 days (compared to Earth's 365-day year). These \"close-in\" planets range from about twice Earth's size up to smaller gas giants. Using four years of TESS observations combined with precise star measurements from the Gaia spacecraft, they applied sophisticated statistical methods to determine not just which planets exist, but how common each type actually is throughout our galaxy.</p>\n<h4>Key Findings</h4>\n<p>The results reveal that about 9.4% of sun-like stars host close-in planets between 2 and 20 times Earth's radius. Perhaps most intriguingly, they found that \"hot Jupiters\"—gas giants orbiting scorchingly close to their stars—appear around only 0.39% of stars, confirming these dramatic worlds are quite rare. They also measured planets in the \"Neptunian desert,\" a mysterious region where few Neptune-sized worlds are found close to their stars, discovering they occur around just 0.08% of stars. When they looked at nearby stars within about 326 light-years of Earth, the numbers were even higher, with 15.4% hosting close-in planets.</p>\n<h4>Looking Forward</h4>\n<p>This cosmic census provides crucial benchmarks for testing theories about how planets form and migrate inward toward their stars. The precision of these measurements will help astronomers refine computer models of planetary system evolution and better predict where to search for potentially habitable worlds. As TESS continues surveying the sky and the James Webb Space Telescope begins studying exoplanet atmospheres, having accurate population statistics becomes essential for understanding which types of discoveries represent typical cosmic scenarios versus rare cosmic accidents.</p>"
    },
    {
      "id": "2601.09438v1",
      "title": "Mass estimates of the young TOI-451 transiting planets: Multidimensional Gaussian Process on stellar spectroscopic and photometric signals",
      "abstract": "The young TOI-451 planetary system, aged 125 Myr, provides a unique opportunity to test theories of planetary internal structures and atmospheric mass loss through examination of its three transiting planets. We present an exhaustive photometric and spectroscopic follow-up to determine the orbital and physical properties of the system. We perform multidimensional Gaussian Process regression with the code pyaneti on spectroscopic time-series and NGTS/LCO light curves to disentangle the stellar and planetary signal in ESPRESSO radial velocities. We show how contemporaneous photometry serves as an activity indicator to inform RV modelling within a multidimensional Gaussian Processes framework. We argue that this can be exploited when spectroscopic observations are adversely affected by low signal-to-noise and/or poor sampling. We estimate the Doppler semi-amplitudes of Kb = 2.6(+1.1,-1.2) m/s, Kc = 1.2(+1.0,-0.8) m/s and Kd = 2.7 +/- 1.2 m/s. This translates into 2-sigma mass estimates for TOI-451 b and d of Mb = 4.7(+2.1,-2.2) Earth masses and Md = 10.2(+4.6,-4.5) Earth masses, as well as a mass upper limit for TOI-451 c of Mc < 11.5 Earth masses. The derived planetary properties suggest that planets c and d contain significant hydrogen-rich envelopes. The inferred parameters of TOI-451 b are consistent with either a rocky world that still retains a small hydrogen envelope or a water world. These insights make the TOI-451 system an ideal laboratory for future follow-up studies aimed at measuring atmospheric compositions, detecting atmospheric mass-loss signatures, and further exploring planetary formation and evolution processes.",
      "authors": [
        "Oscar Barragán",
        "Manuel Mallorquín",
        "Jorge Fernández-Fernández",
        "Faith Hawthorn",
        "Alix V. Freckelton",
        "Marina Lafarga",
        "Michael Cretignier",
        "Yoshi N. E. Eschen",
        "Samuel Gill",
        "Víctor J. S. Béjar",
        "Nicolas Lodieu",
        "Haochuan Yu",
        "Thomas G. Wilson",
        "David Anderson",
        "Ioannis Apergis",
        "Matthew Battley",
        "Edward M. Bryant",
        "Pía Cortés-Zuleta",
        "Edward Gillen",
        "James S. Jenkins",
        "Baptiste Klein",
        "James McCormac",
        "Annabella Meech",
        "Erik Meier-Valdés",
        "Maximiliano Moyano",
        "Annelies Mortier",
        "Felipe Murgas",
        "Louise D. Nielsen",
        "Suman Saha",
        "José I. Vines",
        "Richard West",
        "Peter J. Wheatley",
        "Suzanne Aigrain"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T12:39:48Z",
      "updated": "2026-01-14T12:39:48Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09438v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09438v1",
      "summary": "**Why It Matters**\n\nImagine finding a cosmic nursery where baby planets are still growing up—that's essentially what astronomers have discovered in the TOI-451 system. At just 125 million years old (practically an infant in cosmic terms), this planetary system offers a rare window into how worlds evolve during their formative years. Understanding young planets helps us answer fundamental questions: How do planets lose their atmospheres over time? What determines whether a world becomes rocky like Earth or gassy like Neptune? By studying these cosmic toddlers, we're essentially looking back in time to understand how our own solar system—and potentially habitable worlds—came to be.\n\n**What They Did**\n\nThe researchers used multiple telescopes to play cosmic detective, measuring tiny wobbles in the host star caused by the gravitational tug of orbiting planets. Think of it like watching a dancer spin with invisible partners—you can figure out the partners' weights by how much the dancer wobbles. They combined this technique (called radial velocity) with observations of planetary transits, where planets briefly dim their star as they pass in front of it, like moths crossing a streetlight. The challenge was separating the planets' gravitational effects from the star's own natural flickering—young stars are notoriously active and spotty, making this like trying to hear a whisper during a thunderstorm.\n\n**Key Findings**\n\nThe team successfully weighed three planets in this young system. The innermost world, TOI-451 b, weighs about 4.7 times more than Earth and could be either a rocky planet with a thin atmosphere or a \"water world.\" The middle planet, TOI-451 c, proved too lightweight to measure precisely, but the outer planet, TOI-451 d, tips the scales at about 10 Earth masses. Remarkably, planets c and d appear to be wrapped in thick, hydrogen-rich atmospheres—like cosmic cotton candy surrounding solid cores.\n\n**Looking Forward**\n\nThis system is now a prime target for next-generation telescopes that can analyze planetary atmospheres directly. Scientists hope to watch these young worlds lose their atmospheres in real-time, testing theories about how planets shed their gaseous envelopes as they age. This research brings us closer to understanding the diversity of worlds in our galaxy and the conditions that create planets suitable for life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine finding a cosmic nursery where baby planets are still growing up—that's essentially what astronomers have discovered in the TOI-451 system. At just 125 million years old (practically an infant in cosmic terms), this planetary system offers a rare window into how worlds evolve during their formative years. Understanding young planets helps us answer fundamental questions: How do planets lose their atmospheres over time? What determines whether a world becomes rocky like Earth or gassy like Neptune? By studying these cosmic toddlers, we're essentially looking back in time to understand how our own solar system—and potentially habitable worlds—came to be.</p>\n<h4>What They Did</h4>\n<p>The researchers used multiple telescopes to play cosmic detective, measuring tiny wobbles in the host star caused by the gravitational tug of orbiting planets. Think of it like watching a dancer spin with invisible partners—you can figure out the partners' weights by how much the dancer wobbles. They combined this technique (called radial velocity) with observations of planetary transits, where planets briefly dim their star as they pass in front of it, like moths crossing a streetlight. The challenge was separating the planets' gravitational effects from the star's own natural flickering—young stars are notoriously active and spotty, making this like trying to hear a whisper during a thunderstorm.</p>\n<h4>Key Findings</h4>\n<p>The team successfully weighed three planets in this young system. The innermost world, TOI-451 b, weighs about 4.7 times more than Earth and could be either a rocky planet with a thin atmosphere or a \"water world.\" The middle planet, TOI-451 c, proved too lightweight to measure precisely, but the outer planet, TOI-451 d, tips the scales at about 10 Earth masses. Remarkably, planets c and d appear to be wrapped in thick, hydrogen-rich atmospheres—like cosmic cotton candy surrounding solid cores.</p>\n<h4>Looking Forward</h4>\n<p>This system is now a prime target for next-generation telescopes that can analyze planetary atmospheres directly. Scientists hope to watch these young worlds lose their atmospheres in real-time, testing theories about how planets shed their gaseous envelopes as they age. This research brings us closer to understanding the diversity of worlds in our galaxy and the conditions that create planets suitable for life.</p>"
    },
    {
      "id": "2601.09401v1",
      "title": "True Masses using RV data with Hipparcos and Gaia Astrometry",
      "abstract": "Long-period companions are detected and characterized thanks to long-baseline radial velocity surveys. Combining Doppler time-series with astrometry, and in particular with proper motion anomalies technique, it is possible to put strong constraints on their orbital inclination and true mass. This work aims to present a model that combines Hipparcos and Gaia astrometric data with radial velocity measurements to constrain the orbital inclinations and true masses of long-period companions. Additionally, we re-analyse a small sample of targets that have not yet been studied using this combined approach. This research leverages the simultaneous modelling of proper motion anomalies and radial velocities, in conjunction with an analysis of the sensitivity curve. This approach serves not only as a verification of the parameters but also as a means to acquire valuable insights into planetary systems. The new analyses reveal that some of the targets classified as brown dwarfs or small-mass stars have a planetary nature. HD 5388 b and HD 6718 b are likely planets. HD 141937 b is likely a planet, but the current dataset does not allow us to firmly constrain its true mass. HD 16760 b belongs to the brown dwarf regime and it has a probable second companion. 30 Ari B b falls within the stellar regime, but the presence of an additional stellar companion could compromise the reliability of the final results. For HD 148427 b, HD 96127 b and HIP 65891 b we determined a range for the orbital inclinations.",
      "authors": [
        "G. Piccinini",
        "A. Petralia",
        "A. Sozzetti",
        "S. Benatti",
        "D. Gandolfi",
        "G. Micela"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T11:44:26Z",
      "updated": "2026-01-14T11:44:26Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09401v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09401v1",
      "summary": "**Why It Matters**\n\nImagine trying to weigh a friend standing across a football field—except you can only see their shadow and feel the tiny tremor their footsteps make in the ground. This is essentially the challenge astronomers face when studying distant planets orbiting other stars. For decades, we've discovered thousands of these \"exoplanets,\" but determining their true mass—a crucial detail that tells us whether we're looking at a rocky world like Earth, a gas giant like Jupiter, or something in between—has remained frustratingly difficult. This research tackles that fundamental problem, helping us better understand what kinds of worlds populate our galaxy and how planetary systems like our own actually form and evolve.\n\n**What They Did**\n\nThe researchers developed a clever detective technique that combines two different ways of \"weighing\" distant planets. First, they used the radial velocity method, which detects the tiny wobble a planet causes in its host star as gravity pulls them back and forth—like watching a hammer thrower spin, where you can tell something heavy is attached even if you can't see the hammer. Second, they incorporated data from European space telescopes called Hipparcos and Gaia, which precisely track how stars move across the sky over many years. When a star has an unseen companion, its path through space develops a subtle wiggle. By combining these two independent measurements and using mathematical models, the team could determine not just that these companions exist, but also their true masses and orbital tilts.\n\n**Key Findings**\n\nThe analysis revealed some surprising identity switches in our cosmic catalog. Several objects previously classified as brown dwarfs—failed stars too small to sustain nuclear fusion—turned out to be genuine planets instead. Two systems, HD 5388 and HD 6718, likely host planets rather than the small stars scientists initially thought they contained. The team also discovered that HD 16760 probably hosts a brown dwarf with a second hidden companion lurking in the system. Meanwhile, 30 Ari B appears to have a true stellar companion, though additional stars in the system make this conclusion less certain.\n\n**Looking Forward**\n\nThis research demonstrates how combining different observation techniques can revolutionize our understanding of distant worlds. As more precise data becomes available from current and future space missions, astronomers will be able to apply this method to hundreds more systems, creating a clearer picture of how common different types of planets really are. This could help answer fundamental questions about planetary formation and potentially guide our search for worlds that might harbor life.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine trying to weigh a friend standing across a football field—except you can only see their shadow and feel the tiny tremor their footsteps make in the ground. This is essentially the challenge astronomers face when studying distant planets orbiting other stars. For decades, we've discovered thousands of these \"exoplanets,\" but determining their true mass—a crucial detail that tells us whether we're looking at a rocky world like Earth, a gas giant like Jupiter, or something in between—has remained frustratingly difficult. This research tackles that fundamental problem, helping us better understand what kinds of worlds populate our galaxy and how planetary systems like our own actually form and evolve.</p>\n<h4>What They Did</h4>\n<p>The researchers developed a clever detective technique that combines two different ways of \"weighing\" distant planets. First, they used the radial velocity method, which detects the tiny wobble a planet causes in its host star as gravity pulls them back and forth—like watching a hammer thrower spin, where you can tell something heavy is attached even if you can't see the hammer. Second, they incorporated data from European space telescopes called Hipparcos and Gaia, which precisely track how stars move across the sky over many years. When a star has an unseen companion, its path through space develops a subtle wiggle. By combining these two independent measurements and using mathematical models, the team could determine not just that these companions exist, but also their true masses and orbital tilts.</p>\n<h4>Key Findings</h4>\n<p>The analysis revealed some surprising identity switches in our cosmic catalog. Several objects previously classified as brown dwarfs—failed stars too small to sustain nuclear fusion—turned out to be genuine planets instead. Two systems, HD 5388 and HD 6718, likely host planets rather than the small stars scientists initially thought they contained. The team also discovered that HD 16760 probably hosts a brown dwarf with a second hidden companion lurking in the system. Meanwhile, 30 Ari B appears to have a true stellar companion, though additional stars in the system make this conclusion less certain.</p>\n<h4>Looking Forward</h4>\n<p>This research demonstrates how combining different observation techniques can revolutionize our understanding of distant worlds. As more precise data becomes available from current and future space missions, astronomers will be able to apply this method to hundreds more systems, creating a clearer picture of how common different types of planets really are. This could help answer fundamental questions about planetary formation and potentially guide our search for worlds that might harbor life.</p>"
    },
    {
      "id": "2601.09330v1",
      "title": "NIRPS tightens the mass estimate of GJ 3090 b and detects a planet near the stellar rotation period",
      "abstract": "We present an updated characterization of the planetary system orbiting the nearby M2 dwarf GJ 3090 (TOI-177; $d = 22$ pc), based on new high-precision radial velocity (RV) observations from NIRPS and HARPS. With an orbital period of 2.85 d, the transiting sub-Neptune GJ 3090 b has a mass we refine to $4.52 \\pm 0.47 M_{\\oplus}$, which, combined with our derived radius of $2.18 \\pm 0.06 R_{\\oplus}$, yields a density of $2.40^{+0.33}_{-0.30}$ g cm$^{-3}$. The combined interior structure and atmospheric constraints indicate that GJ 3090 b is a compelling water-world candidate, with a volatile-rich envelope in which water likely represents a significant fraction. We also confirm the presence of a second planet, GJ 3090 c, a sub-Neptune with a 15.9 d orbit and a minimum mass of $10.0 \\pm 1.3 M_{\\oplus}$, which does not transit. Despite its proximity to the star's 18 d rotation period, our joint analysis using a multidimensional Gaussian process (GP) model that incorporates TESS photometry and differential stellar temperature measurements distinguishes this planetary signal from activity-induced variability. In addition, we place new constraints on a non-transiting planet candidate with a period of 12.7 d, suggested in earlier RV analyses. This candidate remains a compelling target for future monitoring. These results highlight the crucial role of multidimensional GP modelling in disentangling planetary signals from stellar activity, enabling the detection of a planet near the stellar rotation period that could have remained undetected with traditional approaches.",
      "authors": [
        "Pierrot Lamontagne",
        "Drew Weisserman",
        "Charles Cadieux",
        "David Lafrenière",
        "Alexandrine L'Heureux",
        "Mykhaylo Plotnykov",
        "Léna Parc",
        "Atanas K. Stefanov",
        "Leslie Moranta",
        "René Doyon",
        "François Bouchy",
        "Jean-Baptiste Delisle",
        "Louise D. Nielsen",
        "Gaspare Lo Curto",
        "Frédérique Baron",
        "Susana C. C. Barros",
        "Björn Benneke",
        "Xavier Bonfils",
        "Marta Bryan",
        "Bruno L. Canto Martins",
        "Ryan Cloutier",
        "Nicolas B. Cowan",
        "Daniel Brito de Freitas",
        "Jose Renan De Medeiros",
        "Xavier Delfosse",
        "Elisa Delgado-Mena",
        "Xavier Dumusque",
        "David Ehrenreich",
        "Pedro Figueira",
        "Jonay I. González Hernández",
        "Izan de Castro Leão",
        "Christophe Lovis",
        "Lison Malo",
        "Claudio Melo",
        "Lucile Mignon",
        "Christoph Mordasini",
        "Francesco Pepe",
        "Rafael Rebolo",
        "Jason Rowe",
        "Nuno C. Santos",
        "Damien Ségransan",
        "Alejandro Suárez Mascareño",
        "Stéphane Udry",
        "Diana Valencia",
        "Gregg Wade",
        "Manuel Abreu",
        "José Luan A. Aguiar",
        "Khaled Al Moulla",
        "Guillaume Allain",
        "Romain Allart",
        "Jose Manuel Almenara",
        "Tomy Arial",
        "Hugues Auger",
        "Luc Bazinet",
        "Nicolas Blind",
        "David Bohlender",
        "Étienne Artigau",
        "Isabelle Boisse",
        "Anne Boucher",
        "Vincent Bourrier",
        "Sébastien Bovay",
        "Pedro Branco",
        "Christopher Broeg",
        "Denis Brousseau",
        "Alexandre Cabral",
        "Andres Carmona",
        "Yann Carteret",
        "Zalpha Challita",
        "David Charbonneau",
        "Bruno Chazelas",
        "Catherine A. Clark",
        "João Coelho",
        "Marion Cointepas",
        "Karen A. Collins",
        "Kevin I. Collins",
        "Uriel Conod",
        "Eduardo Cristo",
        "Ana Rita Costa Silva",
        "Antoine Darveau-Bernier",
        "Laurie Dauplaise",
        "Roseane de Lima Gomes",
        "João Faria",
        "Dasaev O. Fontinele",
        "Thierry Forveille",
        "Yolanda G. C. Frensch",
        "Jonathan Gagné",
        "Frédéric Genest",
        "Ludovic Genolet",
        "João Gomes da Silva",
        "Félix Gracia Témich",
        "Nicole Gromek",
        "Nolan Grieves",
        "Olivier Hernandez",
        "Melissa J. Hobson",
        "H. Jens Hoeijmakers",
        "Norbert Hubin",
        "Neil J. Cook",
        "Marziye Jafariyazani",
        "Farbod Jahandar",
        "Ray Jayawardhana",
        "Hans-Ulrich Käufl",
        "Dan Kerley",
        "Johann Kolb",
        "Vigneshwaran Krishnamurthy",
        "Benjamin Kung",
        "Pierre Larue",
        "Henry Leath",
        "Olivia Lim",
        "Allan M. Martins",
        "Elisabeth C. Matthews",
        "Jaymie Matthews",
        "Jean-Sébastien Mayer",
        "Stan Metchev",
        "Lina Messamah",
        "Yuri S. Messias",
        "Dany Mounzer",
        "Nicola Nari",
        "Ares Osborn",
        "Mathieu Ouellet",
        "Jon Otegi",
        "Luca Pasquini",
        "Vera M. Passegger",
        "Stefan Pelletier",
        "Céline Peroux",
        "Caroline Piaulet-Ghorayeb",
        "Emanuela Pompei",
        "Anne-Sophie Poulin-Girard",
        "José Luis Rasilla",
        "Vladimir Reshetov",
        "Jonathan Saint-Antoine",
        "Mirsad Sarajlic",
        "Ivo Saviane",
        "Robin Schnell",
        "Alex Segovia",
        "Julia Seidel",
        "Armin Silber",
        "Peter Sinclair",
        "Michael Sordet",
        "Danuta Sosnowska",
        "Avidaan Srivastava",
        "Márcio A. Teixeira",
        "Simon Thibault",
        "Philippe Vallée",
        "Thomas Vandal",
        "Valentina Vaulato",
        "Joost P. Wardenier",
        "Bachar Wehbe",
        "Ivan Wevers",
        "François Wildi",
        "Vincent Yariv",
        "Gérard Zins"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T10:04:56Z",
      "updated": "2026-01-14T10:04:56Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09330v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09330v1",
      "summary": "**Why It Matters**\n\nImagine discovering a world where vast oceans might stretch beneath thick, steamy atmospheres—a \"water world\" unlike anything in our solar system. That's exactly what astronomers may have found orbiting a nearby red dwarf star just 22 light-years away. This discovery matters because it adds another piece to the cosmic puzzle of planetary diversity and helps us understand how common Earth-like conditions might be throughout the galaxy. Every new world we characterize brings us closer to answering the profound question: are we alone?\n\n**What They Did**\n\nAstronomers used two powerful instruments—NIRPS and HARPS—to play cosmic detective with a star called GJ 3090. These tools work like incredibly sensitive speedometers, measuring tiny wobbles in the star's motion caused by orbiting planets tugging on it gravitationally. Think of it like watching a dog walker being pulled back and forth by invisible leashes—by studying the motion, you can figure out how many dogs there are and how big they are. The challenge was separating genuine planetary signals from the star's own natural variability, which the team accomplished using sophisticated computer modeling that analyzed multiple types of data simultaneously.\n\n**Key Findings**\n\nThe team confirmed that GJ 3090 hosts at least two planets. The inner world, GJ 3090 b, is about twice Earth's size but 4.5 times more massive, giving it a density suggesting it's rich in water and other light materials—making it a prime \"water world\" candidate. It races around its star in just 2.85 days, much faster than Mercury orbits our Sun. The second planet, GJ 3090 c, is even more massive at 10 times Earth's weight and takes about 16 days to complete its orbit. Remarkably, this second planet was detected despite orbiting very close to the star's 18-day rotation period, which usually makes such discoveries nearly impossible.\n\n**Looking Forward**\n\nThis research showcases how advanced analysis techniques are revolutionizing exoplanet detection, allowing astronomers to find worlds that would have remained hidden using older methods. The potential water world GJ 3090 b joins a growing catalog of planets that might harbor conditions suitable for life as we know it. Future observations could reveal more about these worlds' atmospheres and compositions, bringing us closer to finding truly Earth-like planets in our cosmic neighborhood.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine discovering a world where vast oceans might stretch beneath thick, steamy atmospheres—a \"water world\" unlike anything in our solar system. That's exactly what astronomers may have found orbiting a nearby red dwarf star just 22 light-years away. This discovery matters because it adds another piece to the cosmic puzzle of planetary diversity and helps us understand how common Earth-like conditions might be throughout the galaxy. Every new world we characterize brings us closer to answering the profound question: are we alone?</p>\n<h4>What They Did</h4>\n<p>Astronomers used two powerful instruments—NIRPS and HARPS—to play cosmic detective with a star called GJ 3090. These tools work like incredibly sensitive speedometers, measuring tiny wobbles in the star's motion caused by orbiting planets tugging on it gravitationally. Think of it like watching a dog walker being pulled back and forth by invisible leashes—by studying the motion, you can figure out how many dogs there are and how big they are. The challenge was separating genuine planetary signals from the star's own natural variability, which the team accomplished using sophisticated computer modeling that analyzed multiple types of data simultaneously.</p>\n<h4>Key Findings</h4>\n<p>The team confirmed that GJ 3090 hosts at least two planets. The inner world, GJ 3090 b, is about twice Earth's size but 4.5 times more massive, giving it a density suggesting it's rich in water and other light materials—making it a prime \"water world\" candidate. It races around its star in just 2.85 days, much faster than Mercury orbits our Sun. The second planet, GJ 3090 c, is even more massive at 10 times Earth's weight and takes about 16 days to complete its orbit. Remarkably, this second planet was detected despite orbiting very close to the star's 18-day rotation period, which usually makes such discoveries nearly impossible.</p>\n<h4>Looking Forward</h4>\n<p>This research showcases how advanced analysis techniques are revolutionizing exoplanet detection, allowing astronomers to find worlds that would have remained hidden using older methods. The potential water world GJ 3090 b joins a growing catalog of planets that might harbor conditions suitable for life as we know it. Future observations could reveal more about these worlds' atmospheres and compositions, bringing us closer to finding truly Earth-like planets in our cosmic neighborhood.</p>"
    },
    {
      "id": "2601.09766v1",
      "title": "Habitable Worlds Observatory (HWO): Living Worlds Community Working Group: The Search for Life on Potentially Habitable Exoplanets",
      "abstract": "The discovery of a biosphere on another planet would transform how we view ourselves, and our planet Earth, in relation to the rest of the cosmos. We now know Earth is one planet among eight circling our sun; our sun is part of a swirling galaxy of over one hundred billion other suns; and our galaxy is one of untold billions in the universe. While we do not yet know how many, if any, other biospheres exist on the countless worlds orbiting countless other suns, we stand at the precipice of a new era of discovery, enabled by powerful new facilities able to peer across the light years into the atmospheres of planets similar to our own. This article is an adaptation of a science case document (SCDD) developed for the NASA Astrophysics Flagship mission the Habitable Worlds Observatory (HWO) Science, Technology, and Architecture Review Team (START) Living Worlds Community Working Group.",
      "authors": [
        "Giada Arney",
        "Niki Parenteau",
        "Natalie Hinkel",
        "Eric Mamajek",
        "Joshua Krissansen-Totton",
        "Stephanie Olson",
        "Edward Schwieterman",
        "Sara Walker",
        "Kevin Fogarty",
        "Ravi Kopparapu",
        "Jacob Lustig-Yaeger",
        "Mark Moussa",
        "Sukrit Ranjan",
        "Garima Singh",
        "Clara Sousa-Silva",
        "Ruslan Belikov",
        "Maxwell Frissell",
        "Samantha Gilbert-Janziek",
        "Vincent Kofman",
        "Natasha Latouf",
        "Mary Anne Limbach",
        "Rhonda Morgan",
        "Christopher Stark",
        "Armen Tokadjian",
        "Anna Grace Ulses",
        "Nicholas Wogan",
        "Mike Wong",
        "Amber Young"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-14T09:44:50Z",
      "updated": "2026-01-14T09:44:50Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09766v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09766v1",
      "summary": "**Why It Matters**\n\nImagine looking up at the night sky and knowing that among those countless points of light, life might be looking back. This research represents humanity's most ambitious quest yet: finding life on planets beyond our solar system. With over 100 billion stars in our galaxy alone, and billions of galaxies in the universe, the odds seem promising that Earth isn't unique. But until now, we've lacked the technology to peer into the atmospheres of distant worlds and search for the telltale signs of life. This work could fundamentally change how we see ourselves—not as alone in the cosmos, but as part of a vast community of living worlds.\n\n**What They Did**\n\nRather than conducting new observations, this research team developed a comprehensive scientific blueprint for NASA's upcoming Habitable Worlds Observatory—a revolutionary space telescope designed specifically to hunt for life on other planets. Think of it as creating a detailed roadmap for the ultimate cosmic detective mission. The team brought together experts from various fields to determine exactly what this observatory should look for and how it should operate. They focused on planets in the \"Goldilocks zone\"—that perfect distance from their stars where water could exist as a liquid, not too hot and not too cold, just like Earth orbits our Sun.\n\n**Key Findings**\n\nThis paper doesn't report discoveries of alien life, but rather establishes the scientific framework that could lead to such groundbreaking findings. The team identified key atmospheric signatures that would indicate life—like oxygen combined with water vapor, or methane alongside carbon dioxide. These chemical combinations are extremely difficult to produce without living organisms, making them reliable biosignatures that the Habitable Worlds Observatory will search for in the coming decades.\n\n**Looking Forward**\n\nThis research sets the stage for what could be the most important discovery in human history. The Habitable Worlds Observatory, guided by this scientific roadmap, will have the unprecedented ability to analyze the atmospheres of Earth-like planets and potentially detect signs of life. Even finding one living world beyond Earth would revolutionize our understanding of biology, evolution, and our place in the universe, opening entirely new fields of astrobiology and comparative planetary science.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine looking up at the night sky and knowing that among those countless points of light, life might be looking back. This research represents humanity's most ambitious quest yet: finding life on planets beyond our solar system. With over 100 billion stars in our galaxy alone, and billions of galaxies in the universe, the odds seem promising that Earth isn't unique. But until now, we've lacked the technology to peer into the atmospheres of distant worlds and search for the telltale signs of life. This work could fundamentally change how we see ourselves—not as alone in the cosmos, but as part of a vast community of living worlds.</p>\n<h4>What They Did</h4>\n<p>Rather than conducting new observations, this research team developed a comprehensive scientific blueprint for NASA's upcoming Habitable Worlds Observatory—a revolutionary space telescope designed specifically to hunt for life on other planets. Think of it as creating a detailed roadmap for the ultimate cosmic detective mission. The team brought together experts from various fields to determine exactly what this observatory should look for and how it should operate. They focused on planets in the \"Goldilocks zone\"—that perfect distance from their stars where water could exist as a liquid, not too hot and not too cold, just like Earth orbits our Sun.</p>\n<h4>Key Findings</h4>\n<p>This paper doesn't report discoveries of alien life, but rather establishes the scientific framework that could lead to such groundbreaking findings. The team identified key atmospheric signatures that would indicate life—like oxygen combined with water vapor, or methane alongside carbon dioxide. These chemical combinations are extremely difficult to produce without living organisms, making them reliable biosignatures that the Habitable Worlds Observatory will search for in the coming decades.</p>\n<h4>Looking Forward</h4>\n<p>This research sets the stage for what could be the most important discovery in human history. The Habitable Worlds Observatory, guided by this scientific roadmap, will have the unprecedented ability to analyze the atmospheres of Earth-like planets and potentially detect signs of life. Even finding one living world beyond Earth would revolutionize our understanding of biology, evolution, and our place in the universe, opening entirely new fields of astrobiology and comparative planetary science.</p>"
    },
    {
      "id": "2601.09070v1",
      "title": "Ring-Gap Structures in the Class I Circumstellar Disk of CrA IRS 2 Associated with Magnetic Flux-Driven Bubble",
      "abstract": "Recent ALMA observations with 0''.1 resolution reveal characteristic substructures in circumstellar disks around young Class I sources, providing clues to the early stages of morphological disk evolution. In this paper, we applied PRIISM imaging to ALMA archival Band 6 continuum data of the circumstellar disk around the Class I protostar CrA IRS 2, located in the Corona Australis molecular cloud, which is associated with an extended gas ring attributed to magnetic flux advection driven by interchange instability. The dust continuum image with 1.5 times higher spatial resolution than conventional imaging revealed, for the first time, the early-phase circumstellar disk with both inner central hole and outer ring-gap structures, making CrA IRS 2 the youngest system exhibiting such features based on the bolometric temperature of $T_{\\rm bol}$=235 K. To examine planet-disk interaction as one possible origin of the outer ring-gap structure, we found the measured depth and width to be consistent with planet-disk interaction models, suggesting the existence of a giant planet with a mass of 0.1-1.8 $M_{\\rm Jup}$. The additional mechanism required for rapid planet formation could be the magnetic flux dissipation driven by the interchange instability, which suppresses MRI-driven turbulence and extends the dead zone, allowing efficient dust growth and the early formation of planets. This system thus provides new insight into how substructures and planet formation can emerge during the early, accreting phase of disk evolution.",
      "authors": [
        "Ayumu Shoshi",
        "Masayuki Yamaguchi",
        "Mitsuki Omura",
        "Kazuki Tokuda",
        "Naofumi Fukaya",
        "Kengo Tachihara",
        "Masahiro. N. Machida"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T01:53:03Z",
      "updated": "2026-01-14T01:53:03Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09070v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09070v1",
      "summary": "**Why It Matters**\n\nHow do planets form around newborn stars? This fundamental question has captivated astronomers for decades, as understanding planet formation helps us grasp how our own solar system came to be—and whether Earth-like worlds might be common throughout the galaxy. Scientists have long theorized that planets begin forming while young stars are still actively growing, but catching this process in action has proven incredibly difficult. It's like trying to photograph a developing embryo in the womb from millions of miles away. This new research provides a rare glimpse into the cosmic nursery where planets are born, potentially revealing how giant planets like Jupiter can form much faster than previously thought possible.\n\n**What They Did**\n\nResearchers used the Atacama Large Millimeter Array (ALMA)—a powerful network of radio telescopes in Chile—to peer through the dusty cocoon surrounding a very young star called CrA IRS 2, located about 430 light-years away. This star is still in its infancy, actively pulling in material from its surroundings like a cosmic vacuum cleaner. Using advanced image processing techniques, the team achieved unprecedented clarity, essentially giving them a sharper view of the disk of gas and dust swirling around this baby star. Think of it like upgrading from standard definition to ultra-high definition TV—suddenly, details invisible before became crystal clear.\n\n**Key Findings**\n\nThe enhanced images revealed something remarkable: a disk with distinct ring and gap structures, resembling a cosmic record album with grooves carved into it. This makes CrA IRS 2 the youngest star system ever observed with such features. Most surprisingly, the gaps appear consistent with what scientists would expect if a giant planet—somewhere between one-tenth and nearly twice the mass of Jupiter—were already orbiting within the disk. The researchers also discovered evidence of magnetic processes that could accelerate planet formation by reducing turbulence in the disk, allowing dust particles to stick together more easily.\n\n**Looking Forward**\n\nThis discovery challenges our timeline for planet formation, suggesting giant planets can emerge much earlier than previously believed. It opens exciting questions about whether rapid planet formation might be more common than we thought, potentially meaning planetary systems could be abundant throughout the universe. Future observations of similar young systems could reveal whether CrA IRS 2 represents a rare exception or a common pathway to building planetary families like our own.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>How do planets form around newborn stars? This fundamental question has captivated astronomers for decades, as understanding planet formation helps us grasp how our own solar system came to be—and whether Earth-like worlds might be common throughout the galaxy. Scientists have long theorized that planets begin forming while young stars are still actively growing, but catching this process in action has proven incredibly difficult. It's like trying to photograph a developing embryo in the womb from millions of miles away. This new research provides a rare glimpse into the cosmic nursery where planets are born, potentially revealing how giant planets like Jupiter can form much faster than previously thought possible.</p>\n<h4>What They Did</h4>\n<p>Researchers used the Atacama Large Millimeter Array (ALMA)—a powerful network of radio telescopes in Chile—to peer through the dusty cocoon surrounding a very young star called CrA IRS 2, located about 430 light-years away. This star is still in its infancy, actively pulling in material from its surroundings like a cosmic vacuum cleaner. Using advanced image processing techniques, the team achieved unprecedented clarity, essentially giving them a sharper view of the disk of gas and dust swirling around this baby star. Think of it like upgrading from standard definition to ultra-high definition TV—suddenly, details invisible before became crystal clear.</p>\n<h4>Key Findings</h4>\n<p>The enhanced images revealed something remarkable: a disk with distinct ring and gap structures, resembling a cosmic record album with grooves carved into it. This makes CrA IRS 2 the youngest star system ever observed with such features. Most surprisingly, the gaps appear consistent with what scientists would expect if a giant planet—somewhere between one-tenth and nearly twice the mass of Jupiter—were already orbiting within the disk. The researchers also discovered evidence of magnetic processes that could accelerate planet formation by reducing turbulence in the disk, allowing dust particles to stick together more easily.</p>\n<h4>Looking Forward</h4>\n<p>This discovery challenges our timeline for planet formation, suggesting giant planets can emerge much earlier than previously believed. It opens exciting questions about whether rapid planet formation might be more common than we thought, potentially meaning planetary systems could be abundant throughout the universe. Future observations of similar young systems could reveal whether CrA IRS 2 represents a rare exception or a common pathway to building planetary families like our own.</p>"
    },
    {
      "id": "2601.08958v1",
      "title": "Depletion of moderately volatile elements by pebble accretion in Earth-like planets",
      "abstract": "Protoplanets growing by pebble accretion capture massive hydrogen-helium atmospheres from the surrounding nebula. Pebbles settling through such atmospheres continuously release gravitational potential energy, heating both the atmosphere and the pebbles. Under these conditions, atmosphere temperatures above large protoplanets are sufficiently high to melt silicate pebbles, support long-lived magma oceans, and drive evaporation of volatile species. Because these atmospheres are open to the nebula, some amount of volatile loss is inevitable. Here we analyze the depletion of moderately volatile elements from terrestrial protoplanets undergoing pebble accretion. We consider chondrule-size silicate pebbles enriched in Si, Na, K, and Zn relative to Earth, settling through a hydrogen-helium-rich atmosphere containing these same volatiles. We show that volatile depletion depends critically on protoplanet mass, the timescale of atmosphere exhaust, and the pebble composition. The protoplanetary mass effect is especially strong. For exhaust timescales of a few centuries, we find that substantial depletion of Zn begins around 0.4 Earth mass, and for Na and K around 0.6 Earth mass, with negligible depletion of these elements at smaller masses. Using a pebble composition that matches Earth's major element abundances, broad agreement with Earth's depletion trend for moderately volatile elements is found by merging a large (approximately 0.7 Earth mass) volatile-depleted target protoplanet with one or more smaller, less-depleted impactors.",
      "authors": [
        "Peter L. Olson",
        "Zachary D. Sharp",
        "Susmita Garai"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T19:51:51Z",
      "updated": "2026-01-13T19:51:51Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08958v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08958v1",
      "summary": "**Why It Matters**\n\nEarth is mysteriously missing certain elements that should be common on rocky planets. Elements like zinc, sodium, and potassium—what scientists call \"moderately volatile\" because they evaporate at relatively low temperatures—are surprisingly scarce in Earth's rocks compared to what we see elsewhere in the solar system. Understanding why could help us predict what other Earth-like planets might look like and whether they could support life. After all, some of these missing elements are crucial for biology. This research tackles one of the fundamental puzzles about how planets form and why each one turns out so different.\n\n**What They Did**\n\nThe researchers created computer simulations of baby planets forming in the early solar system, focusing on a process called \"pebble accretion\"—imagine cosmic snowballs the size of marbles raining down onto a growing planet. These forming planets would have captured thick atmospheres of hydrogen and helium gas, like puffy blankets thousands of times thicker than our current atmosphere. As pebbles fell through these hot, dense atmospheres, they would heat up and melt, creating vast oceans of molten rock. The team calculated how elements like zinc and sodium would evaporate from these magma oceans and escape to space, essentially getting cooked away during the planet's violent birth.\n\n**Key Findings**\n\nThe research revealed that planet size is absolutely critical for determining which elements get lost. Small developing planets (less than 40% of Earth's current mass) keep most of their volatile elements. But once a growing planet reaches about 60% of Earth's mass, it becomes hot enough to start losing significant amounts of sodium and potassium. The best match for Earth's current chemistry comes from a scenario where a large, element-depleted planet about 70% of Earth's size later collided with smaller, less-depleted planets—essentially mixing a \"cooked\" planet with \"fresh\" ingredients.\n\n**Looking Forward**\n\nThis research provides a new lens for understanding the thousands of exoplanets we're discovering. It suggests that the atmospheric chemistry of rocky planets depends heavily on their formation history—how big they grew and how quickly they formed. Future space telescopes that can analyze exoplanet atmospheres might be able to use these chemical fingerprints to reconstruct how distant worlds formed, helping us identify which ones might be truly Earth-like in their chemistry and potential habitability.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Earth is mysteriously missing certain elements that should be common on rocky planets. Elements like zinc, sodium, and potassium—what scientists call \"moderately volatile\" because they evaporate at relatively low temperatures—are surprisingly scarce in Earth's rocks compared to what we see elsewhere in the solar system. Understanding why could help us predict what other Earth-like planets might look like and whether they could support life. After all, some of these missing elements are crucial for biology. This research tackles one of the fundamental puzzles about how planets form and why each one turns out so different.</p>\n<h4>What They Did</h4>\n<p>The researchers created computer simulations of baby planets forming in the early solar system, focusing on a process called \"pebble accretion\"—imagine cosmic snowballs the size of marbles raining down onto a growing planet. These forming planets would have captured thick atmospheres of hydrogen and helium gas, like puffy blankets thousands of times thicker than our current atmosphere. As pebbles fell through these hot, dense atmospheres, they would heat up and melt, creating vast oceans of molten rock. The team calculated how elements like zinc and sodium would evaporate from these magma oceans and escape to space, essentially getting cooked away during the planet's violent birth.</p>\n<h4>Key Findings</h4>\n<p>The research revealed that planet size is absolutely critical for determining which elements get lost. Small developing planets (less than 40% of Earth's current mass) keep most of their volatile elements. But once a growing planet reaches about 60% of Earth's mass, it becomes hot enough to start losing significant amounts of sodium and potassium. The best match for Earth's current chemistry comes from a scenario where a large, element-depleted planet about 70% of Earth's size later collided with smaller, less-depleted planets—essentially mixing a \"cooked\" planet with \"fresh\" ingredients.</p>\n<h4>Looking Forward</h4>\n<p>This research provides a new lens for understanding the thousands of exoplanets we're discovering. It suggests that the atmospheric chemistry of rocky planets depends heavily on their formation history—how big they grew and how quickly they formed. Future space telescopes that can analyze exoplanet atmospheres might be able to use these chemical fingerprints to reconstruct how distant worlds formed, helping us identify which ones might be truly Earth-like in their chemistry and potential habitability.</p>"
    },
    {
      "id": "2601.08952v1",
      "title": "Formation and evolution of planetary systems",
      "abstract": "Various problems of the formation and evolution of planetary systems are studied. Most of the studies are devoted to the Solar System. The collapse of the presolar cloud and the accumulation of planets are studied. The author considers the formation of the Earth-Moon system, binary trans-Neptunian objects, and the axial rotations of planets. He discusses the formation of asteroid and trans-Neptunian belts, including the evolution of resonant asteroid orbits and the formation of the Kirkwood gaps in the asteroid belt. The book discusses the migration of bodies during the formation of the Solar System and at present, including a discussion of the delivery of icy bodies from beyond the ice line to the terrestrial planets and the formation of craters on the Moon. The Deep Impact mission is discussed; during this mission the impact module of the spacecraft collided with the comet Tempel 1. The book studies the migration of dust in the Solar System and the formation of the zodiacal belt, as well as the migration of bodies and dust particles ejected from the terrestrial planets and the Moon. The author considers the migration of bodies in some exoplanetary systems (Proxima Centauri, Trappist 1, and Gliese 581), the spectra of Earth-like exoplanets with different rotation periods, as well as the efficiency of exoplanet searches using microlensing observations with various telescopes. English text is only in the list of publications and in the contents. An English reader can look the contents to find an interesting section. In this section he can find the numbers for relative publications. Using these numbers and the list of publications, he can find the websites where he can upload free files with these publications, and then he can read relevant papers in English and can get more detailed information than in this book.",
      "authors": [
        "S. I. Ipatov"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T19:43:28Z",
      "updated": "2026-01-13T19:43:28Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08952v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08952v1",
      "summary": "**Why It Matters**\n\nHow do planets form from cosmic dust and gas? Why does Earth have such a large moon while Mars has only tiny rocks orbiting it? And most tantalizing of all—could the same processes that built our Solar System be creating habitable worlds around other stars? These fundamental questions drive our understanding of whether Earth-like planets are common or rare in the universe. By studying how planetary systems form and evolve, scientists can better predict where to find potentially habitable worlds and understand the cosmic processes that made life on Earth possible. This research connects the story of our own planet's violent birth to the search for life beyond our Solar System.\n\n**What They Did**\n\nThis comprehensive study tackled planetary formation like a cosmic detective story, piecing together evidence from multiple sources. The researchers examined how our Solar System formed from a collapsing cloud of gas and dust billions of years ago—imagine a slowly spinning cotton ball gradually flattening into a pancake with our Sun forming at the center. They studied the migration patterns of asteroids, comets, and planets, tracking how these bodies moved around over millions of years like a slow-motion cosmic billiards game. The team also analyzed data from NASA's Deep Impact mission, which deliberately crashed a probe into a comet to see what it was made of. Additionally, they investigated three nearby exoplanetary systems—Proxima Centauri, TRAPPIST-1, and Gliese 581—to compare how planet formation might work around different types of stars.\n\n**Key Findings**\n\nThe research revealed that planetary system formation is far more dynamic and chaotic than previously thought. Planets don't simply form in place and stay put—they migrate inward and outward, sometimes dramatically reshaping their entire systems. The study showed how icy comets from the outer Solar System delivered water to early Earth, essentially filling our oceans through cosmic delivery. They found that the gaps in our asteroid belt (called Kirkwood gaps) formed when Jupiter's gravity kicked asteroids into new orbits, like a gravitational broom sweeping space clean. For exoplanets, the research demonstrated that the rotation speed of Earth-like planets around other stars would create detectable signatures in their light spectra, potentially helping us identify truly Earth-like worlds.\n\n**Looking Forward**\n\nThis research opens exciting new avenues for finding potentially habitable exoplanets. By understanding the complex dance of planetary migration and formation, scientists can better predict which star systems are most likely to host stable, Earth-like worlds. The findings about planetary rotation signatures could help future space telescopes identify planets with conditions similar to Earth's. Most importantly, this work suggests that the processes that brought water to Earth and created our stable climate might be common throughout the galaxy, increasing the odds that life could emerge elsewhere in the universe.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>How do planets form from cosmic dust and gas? Why does Earth have such a large moon while Mars has only tiny rocks orbiting it? And most tantalizing of all—could the same processes that built our Solar System be creating habitable worlds around other stars? These fundamental questions drive our understanding of whether Earth-like planets are common or rare in the universe. By studying how planetary systems form and evolve, scientists can better predict where to find potentially habitable worlds and understand the cosmic processes that made life on Earth possible. This research connects the story of our own planet's violent birth to the search for life beyond our Solar System.</p>\n<h4>What They Did</h4>\n<p>This comprehensive study tackled planetary formation like a cosmic detective story, piecing together evidence from multiple sources. The researchers examined how our Solar System formed from a collapsing cloud of gas and dust billions of years ago—imagine a slowly spinning cotton ball gradually flattening into a pancake with our Sun forming at the center. They studied the migration patterns of asteroids, comets, and planets, tracking how these bodies moved around over millions of years like a slow-motion cosmic billiards game. The team also analyzed data from NASA's Deep Impact mission, which deliberately crashed a probe into a comet to see what it was made of. Additionally, they investigated three nearby exoplanetary systems—Proxima Centauri, TRAPPIST-1, and Gliese 581—to compare how planet formation might work around different types of stars.</p>\n<h4>Key Findings</h4>\n<p>The research revealed that planetary system formation is far more dynamic and chaotic than previously thought. Planets don't simply form in place and stay put—they migrate inward and outward, sometimes dramatically reshaping their entire systems. The study showed how icy comets from the outer Solar System delivered water to early Earth, essentially filling our oceans through cosmic delivery. They found that the gaps in our asteroid belt (called Kirkwood gaps) formed when Jupiter's gravity kicked asteroids into new orbits, like a gravitational broom sweeping space clean. For exoplanets, the research demonstrated that the rotation speed of Earth-like planets around other stars would create detectable signatures in their light spectra, potentially helping us identify truly Earth-like worlds.</p>\n<h4>Looking Forward</h4>\n<p>This research opens exciting new avenues for finding potentially habitable exoplanets. By understanding the complex dance of planetary migration and formation, scientists can better predict which star systems are most likely to host stable, Earth-like worlds. The findings about planetary rotation signatures could help future space telescopes identify planets with conditions similar to Earth's. Most importantly, this work suggests that the processes that brought water to Earth and created our stable climate might be common throughout the galaxy, increasing the odds that life could emerge elsewhere in the universe.</p>"
    },
    {
      "id": "2601.08938v1",
      "title": "Can photoevaporation open gaps in protoplanetary discs?",
      "abstract": "We investigate whether photoevaporation alone can open and sustain gaps in protoplanetary discs by coupling the evolving disc structure with the photoevaporative flow in two dimensional radiation hydrodynamical simulations. Our results show that once a density depression forms, the local mass-loss rate decreases sharply, suppressing further gap deepening. Viscous inflow and radial mass transport along the disc surface act to partially refill the depleted region, preventing complete clearing. The resulting configuration is a persistent, partially depleted zone whose evolution is largely insensitive to the initial disc morphology. This behaviour challenges the standard paradigm that photoevaporation efficiently carves clean inner cavities and directly produces transition discs. However, the pressure maximum at the outer edge of the depression may still trap dust grains, giving rise to transition disc like observational signatures. We also present a first-order prescription to approximate this behaviour in one dimensional disc evolution models, suitable for use in planet formation and population synthesis studies. Although the prescription improves upon static mass-loss treatments, it remains approximate, underscoring the need for further multidimensional simulations and parameter-space exploration to derive robust recipes for global disc and planet population models.",
      "authors": [
        "Michael L. Weber",
        "Barbara Ercolano",
        "Giovanni Picogna"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-13T19:19:06Z",
      "updated": "2026-01-13T19:19:06Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08938v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08938v1",
      "summary": "**Why It Matters**\n\nUnderstanding how planets form is one of astronomy's greatest puzzles, and it directly connects to the ultimate question of whether Earth-like worlds are common in our galaxy. Planets are born in spinning disks of gas and dust that surround young stars—think of them as cosmic construction sites where the building blocks of future worlds swirl around like ingredients in a stellar mixing bowl. Sometimes these disks develop mysterious gaps and cavities, creating what astronomers call \"transition disks.\" These gaps might be where planets are actively forming, making them crucial laboratories for understanding how solar systems like our own come to be.\n\n**What They Did**\n\nThe researchers used powerful computer simulations to test whether intense starlight alone could carve out gaps in these planet-forming disks. Young stars blast out high-energy radiation that can heat up and blow away the surrounding gas and dust—a process called photoevaporation, similar to how the Sun's heat evaporates water from Earth's oceans. Scientists have long wondered if this stellar \"wind\" could be responsible for creating the gaps we observe in transition disks. The team created detailed two-dimensional models that tracked both how the disk material moves and responds to the star's radiation over time, like watching a slow-motion movie of cosmic erosion.\n\n**Key Findings**\n\nThe results were surprising: photoevaporation alone cannot create the clean, empty gaps that astronomers often observe. When the stellar radiation started carving out a depression in the disk, the process became self-limiting. As material was blown away, less gas remained to absorb the star's energy, causing the erosion to slow down dramatically. Meanwhile, the disk's natural tendency to flow inward began refilling the gap, like water flowing back into a hole dug in wet sand. Instead of creating empty cavities, photoevaporation produced only shallow, partially depleted zones that persisted over time.\n\n**Looking Forward**\n\nThis research fundamentally challenges how scientists think transition disks form, suggesting that planets themselves—rather than stellar radiation—might be the primary architects of these gaps. The findings will help astronomers better interpret observations from powerful telescopes and refine models of how planetary systems evolve, bringing us closer to understanding the cosmic processes that created our own solar system.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Understanding how planets form is one of astronomy's greatest puzzles, and it directly connects to the ultimate question of whether Earth-like worlds are common in our galaxy. Planets are born in spinning disks of gas and dust that surround young stars—think of them as cosmic construction sites where the building blocks of future worlds swirl around like ingredients in a stellar mixing bowl. Sometimes these disks develop mysterious gaps and cavities, creating what astronomers call \"transition disks.\" These gaps might be where planets are actively forming, making them crucial laboratories for understanding how solar systems like our own come to be.</p>\n<h4>What They Did</h4>\n<p>The researchers used powerful computer simulations to test whether intense starlight alone could carve out gaps in these planet-forming disks. Young stars blast out high-energy radiation that can heat up and blow away the surrounding gas and dust—a process called photoevaporation, similar to how the Sun's heat evaporates water from Earth's oceans. Scientists have long wondered if this stellar \"wind\" could be responsible for creating the gaps we observe in transition disks. The team created detailed two-dimensional models that tracked both how the disk material moves and responds to the star's radiation over time, like watching a slow-motion movie of cosmic erosion.</p>\n<h4>Key Findings</h4>\n<p>The results were surprising: photoevaporation alone cannot create the clean, empty gaps that astronomers often observe. When the stellar radiation started carving out a depression in the disk, the process became self-limiting. As material was blown away, less gas remained to absorb the star's energy, causing the erosion to slow down dramatically. Meanwhile, the disk's natural tendency to flow inward began refilling the gap, like water flowing back into a hole dug in wet sand. Instead of creating empty cavities, photoevaporation produced only shallow, partially depleted zones that persisted over time.</p>\n<h4>Looking Forward</h4>\n<p>This research fundamentally challenges how scientists think transition disks form, suggesting that planets themselves—rather than stellar radiation—might be the primary architects of these gaps. The findings will help astronomers better interpret observations from powerful telescopes and refine models of how planetary systems evolve, bringing us closer to understanding the cosmic processes that created our own solar system.</p>"
    },
    {
      "id": "2601.08591v1",
      "title": "Dust Properties of the Interstellar Object 3I/ATLAS Revealed by Optical and Near-Infrared Polarimetry",
      "abstract": "We present independent polarimetric observations of the interstellar object 3I/ATLAS, including the first near-infrared polarimetric measurements. Using imaging polarimeters, we measured the degree of linear polarization from the visible RC band (0.64 μm) to the near-infrared KS band (2.25 μm), and investigated its dependence on solar phase angle (polarization phase curve; PPC) and wavelength (polarization color curve; PCC). We confirm that the PPC of 3I/ATLAS differs significantly from those of typical Solar System comets, showing an unusually large polarization amplitude. This PPC shows no significant change in the RC band across perihelion passage, despite the perihelion lying within the water snow line. This indicates that the unusual polarimetric behavior of 3I/ATLAS is unlikely to be driven by transient volatile activity, but instead reflects intrinsic optical properties of refractory dust particles. The PCC increases with wavelength over 0.6-1.2 μm and peaks at 1.5-2.0 μm, suggesting that the dominant scattering units are dust aggregates composed of submicron-sized monomers, broadly consistent with interstellar dust and solar-system cometary aggregates. Taken together, our results indicate that 3I/ATLAS preserves polarimetric properties characteristic of a primitive cometary planetesimal formed in another planetary system, with a refractory dust composition that differs from that typically observed among Solar System comets, despite sharing a similar size scale of the aggregate building blocks.",
      "authors": [
        "Seungwon Choi",
        "Masateru Ishiguro",
        "Jun Takahashi",
        "Tomoki Saito",
        "Yoonsoo P. Bach",
        "Bumhoo Lim",
        "Hiroyuki Naito",
        "Jooyeon Geem",
        "Sunho Jin",
        "Jinguk Seo",
        "Hyeonwoo Ju",
        "Hiroshi Akitakya",
        "Koji S. Kawabata",
        "Mahito Sasada",
        "Kazuya Doi",
        "Hisayuki Kubota",
        "Seiko Takagi",
        "Makoto Watanabe",
        "Tomohiko Sekiguchi",
        "Myungshin Im"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.GA"
      ],
      "published": "2026-01-13T14:20:18Z",
      "updated": "2026-01-13T14:20:18Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08591v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08591v1",
      "summary": "**Why It Matters**\n\nImagine a visitor from another star system passing through our cosmic neighborhood—that's exactly what happened with 3I/ATLAS, only the second confirmed interstellar object ever detected. These rare celestial wanderers offer us a precious opportunity to study materials from alien solar systems without leaving home. By analyzing how light bounces off this mysterious object, scientists can decode clues about how planets and comets form around other stars. This research helps us understand whether the building blocks of planetary systems—and potentially life itself—are similar throughout our galaxy, or if each star system develops its own unique recipe for world-building.\n\n**What They Did**\n\nThe research team used specialized telescopes equipped with polarimeters—instruments that can detect how light waves are oriented after bouncing off an object's surface. Think of it like wearing polarized sunglasses that reveal details invisible to the naked eye. They observed 3I/ATLAS across multiple wavelengths of light, from visible red light to near-infrared (heat radiation our eyes can't see), as it journeyed past our Sun. By measuring how the light's polarization changed at different angles and wavelengths, they could determine the size, shape, and composition of dust particles on the object's surface—like a cosmic forensics investigation analyzing evidence from another star system.\n\n**Key Findings**\n\n3I/ATLAS behaves very differently from typical comets in our solar system. Its polarization signature was unusually strong and didn't change even when it passed close to the Sun—within the distance where water ice would normally vaporize and create the classic comet tail. This suggests the object is covered in rocky, non-icy dust particles that are fundamentally different from our local comets. The dust appears to be made of tiny building blocks smaller than a thousandth of a millimeter, clumped together into larger aggregates—similar to how snowflakes form from individual ice crystals.\n\n**Looking Forward**\n\nThis discovery suggests that planetary systems around other stars may produce comets with compositions quite different from our own, giving us our first direct sample of \"alien\" solar system material. As more interstellar visitors are discovered, scientists can begin mapping the diversity of planetary formation processes across the galaxy, potentially revealing whether Earth-like worlds and the organic compounds necessary for life are common cosmic phenomena or rare exceptions.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine a visitor from another star system passing through our cosmic neighborhood—that's exactly what happened with 3I/ATLAS, only the second confirmed interstellar object ever detected. These rare celestial wanderers offer us a precious opportunity to study materials from alien solar systems without leaving home. By analyzing how light bounces off this mysterious object, scientists can decode clues about how planets and comets form around other stars. This research helps us understand whether the building blocks of planetary systems—and potentially life itself—are similar throughout our galaxy, or if each star system develops its own unique recipe for world-building.</p>\n<h4>What They Did</h4>\n<p>The research team used specialized telescopes equipped with polarimeters—instruments that can detect how light waves are oriented after bouncing off an object's surface. Think of it like wearing polarized sunglasses that reveal details invisible to the naked eye. They observed 3I/ATLAS across multiple wavelengths of light, from visible red light to near-infrared (heat radiation our eyes can't see), as it journeyed past our Sun. By measuring how the light's polarization changed at different angles and wavelengths, they could determine the size, shape, and composition of dust particles on the object's surface—like a cosmic forensics investigation analyzing evidence from another star system.</p>\n<h4>Key Findings</h4>\n<p>3I/ATLAS behaves very differently from typical comets in our solar system. Its polarization signature was unusually strong and didn't change even when it passed close to the Sun—within the distance where water ice would normally vaporize and create the classic comet tail. This suggests the object is covered in rocky, non-icy dust particles that are fundamentally different from our local comets. The dust appears to be made of tiny building blocks smaller than a thousandth of a millimeter, clumped together into larger aggregates—similar to how snowflakes form from individual ice crystals.</p>\n<h4>Looking Forward</h4>\n<p>This discovery suggests that planetary systems around other stars may produce comets with compositions quite different from our own, giving us our first direct sample of \"alien\" solar system material. As more interstellar visitors are discovered, scientists can begin mapping the diversity of planetary formation processes across the galaxy, potentially revealing whether Earth-like worlds and the organic compounds necessary for life are common cosmic phenomena or rare exceptions.</p>"
    }
  ]
}