{
<<<<<<< HEAD
  "updated_at": "2026-01-17T12:42:19.140182+00:00",
=======
  "updated_at": "2026-01-17T12:13:14.814656+00:00",
>>>>>>> c418b25166398bf4b18b5c133b41dd4ab0642728
  "category": "astro-ph.EP",
  "paper_count": 25,
  "papers": [
    {
      "id": "2601.08883v1",
      "title": "Habitable Worlds Observatory Living Worlds Working Group: Surface Biosignatures on Potentially Habitable Exoplanets",
      "abstract": "The Habitable Worlds Observatory (HWO) is the first NASA Astrophysics flagship mission with a key science goal of searching for signs of life on rocky habitable exoplanets beyond our solar system. The Living Worlds Community Working Group was charged with investigating how HWO could characterize planets orbiting stars in the solar neighborhood, search for signs of life, and interpret potential biosignatures within a false positive and false negative framework. The Surface Biosignatures Task assessed the measurement requirements and instrument needs to detect these biosignatures under an 'Earth through time' scenario. Surface biosignatures are planetary-scale spectral features resulting from absorption and/or scattering of radiation by organisms containing photosynthetic and non-photosynthetic pigments. This secondary class of biosignature can be used to corroborate atmospheric biosignatures by providing multiple lines of evidence to aid in assessing their biogenicity. Furthermore, surface biopigments are the only way to detect more primitive forms of anoxygenic photosynthesis if oxygenic photosynthesis never evolved. Key Findings: To detect biopigments on the surface of planets under Archean, Proterozoic, and Modern atmospheric compositions (15 percent coverage, 50 percent cloud cover), an SNR of 20-40 would be needed over 500-1100 nm. However, there may be some cases in which lower SNR is required; studies are ongoing. Coronagraph requirements: (1) The detection of surface biosignatures would be greatly enhanced by having as many parallel coronagraph channels as possible across the entire wavelength range with no or minimal gaps between channels. (2) Retrieval studies revealed that restricted wavelength ranges (e.g., 0.4 - 0.7 microns), such as may be used during initial survey strategies, are not sufficient to deconvolve the biopigment features from the abiotic background.",
      "authors": [
        "Niki Parenteau",
        "Anna Grace Ulses",
        "Connor Metz",
        "Nancy Y. Kiang",
        "Ligia F. Coelho",
        "Edward Schwieterman",
        "Jonathan Grone",
        "Giulia Roccetti",
        "Svetlana Berdyugina",
        "Eleonora Alei",
        "Lucas Patty",
        "Emilie Lafleche",
        "Taro Matsuo",
        "Dawn Cardace",
        "Schuyler Borges",
        "Avi Mandel",
        "Kenneth Gordon",
        "Joshua Krissansen-Totton",
        "Giada Arney"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-12T20:34:11Z",
      "updated": "2026-01-12T20:34:11Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08883v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08883v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 18,
      "summary": "**Why It Matters**\n\nImagine looking at Earth from space and being able to tell that it's alive—not just from the oxygen in our atmosphere, but from the green glow of plants covering our continents. That's essentially what scientists are preparing to do with distant planets orbiting other stars. NASA's upcoming Habitable Worlds Observatory will be humanity's most ambitious attempt to answer one of our biggest questions: Are we alone? This research focuses on a clever new way to spot life on faraway worlds by looking for the colorful signatures of living organisms on planetary surfaces—like detecting vast forests, algae blooms, or even alien photosynthesis from trillions of miles away.\n\n**What They Did**\n\nThe research team investigated how future space telescopes could detect what they call \"surface biosignatures\"—basically, the colors and light patterns created when sunlight bounces off living things on a planet's surface. Think of how Earth looks different colors from space depending on whether you're looking at green forests, blue oceans, or red deserts. The scientists studied how these biological colors would appear across different time periods in Earth's history, from when our planet had very little oxygen (billions of years ago) to today's oxygen-rich atmosphere. They ran computer simulations to figure out exactly how sensitive our instruments would need to be to spot these faint biological fingerprints on planets many light-years away.\n\n**Key Findings**\n\nThe team discovered that detecting life this way would require incredibly precise measurements—specifically, instruments that can achieve a signal-to-noise ratio of 20-40 across wavelengths from 500 to 1,100 nanometers (spanning from green to near-infrared light). They found that telescopes need to observe across this entire range simultaneously, with no gaps in coverage, because biological signals can easily be confused with non-living planetary features when you only look at narrow wavelengths. Importantly, this technique could detect primitive forms of photosynthesis that don't produce oxygen—potentially revealing life even on planets that never developed oxygen-rich atmospheres like Earth's.\n\n**Looking Forward**\n\nThis research provides a crucial blueprint for building humanity's next generation of life-detecting telescopes. By combining surface biosignatures with atmospheric signals, scientists will have multiple independent ways to confirm whether a distant planet truly harbors life, reducing the chances of false alarms. This approach could revolutionize how we search for life, potentially revealing biological activity on worlds that might otherwise seem lifeless and opening up entirely new categories of potentially habitable planets to explore.",
      "summary_html": "<h4>Why It Matters</h4>\n<p>Imagine looking at Earth from space and being able to tell that it's alive—not just from the oxygen in our atmosphere, but from the green glow of plants covering our continents. That's essentially what scientists are preparing to do with distant planets orbiting other stars. NASA's upcoming Habitable Worlds Observatory will be humanity's most ambitious attempt to answer one of our biggest questions: Are we alone? This research focuses on a clever new way to spot life on faraway worlds by looking for the colorful signatures of living organisms on planetary surfaces—like detecting vast forests, algae blooms, or even alien photosynthesis from trillions of miles away.</p>\n<h4>What They Did</h4>\n<p>The research team investigated how future space telescopes could detect what they call \"surface biosignatures\"—basically, the colors and light patterns created when sunlight bounces off living things on a planet's surface. Think of how Earth looks different colors from space depending on whether you're looking at green forests, blue oceans, or red deserts. The scientists studied how these biological colors would appear across different time periods in Earth's history, from when our planet had very little oxygen (billions of years ago) to today's oxygen-rich atmosphere. They ran computer simulations to figure out exactly how sensitive our instruments would need to be to spot these faint biological fingerprints on planets many light-years away.</p>\n<h4>Key Findings</h4>\n<p>The team discovered that detecting life this way would require incredibly precise measurements—specifically, instruments that can achieve a signal-to-noise ratio of 20-40 across wavelengths from 500 to 1,100 nanometers (spanning from green to near-infrared light). They found that telescopes need to observe across this entire range simultaneously, with no gaps in coverage, because biological signals can easily be confused with non-living planetary features when you only look at narrow wavelengths. Importantly, this technique could detect primitive forms of photosynthesis that don't produce oxygen—potentially revealing life even on planets that never developed oxygen-rich atmospheres like Earth's.</p>\n<h4>Looking Forward</h4>\n<p>This research provides a crucial blueprint for building humanity's next generation of life-detecting telescopes. By combining surface biosignatures with atmospheric signals, scientists will have multiple independent ways to confirm whether a distant planet truly harbors life, reducing the chances of false alarms. This approach could revolutionize how we search for life, potentially revealing biological activity on worlds that might otherwise seem lifeless and opening up entirely new categories of potentially habitable planets to explore.</p>",
      "tweet_hook": {
        "hook": "NASA's next flagship telescope could spot alien photosynthesis by detecting colored pigments on distant planet surfaces",
        "claim": "HWO will search for surface biosignatures to confirm atmospheric signs of life on exoplanets",
        "evidence": "SNR of 20-40 needed across 500-1100nm to detect biopigments covering 15% of planet surface",
        "question": "Could surface biosignatures reveal alien life that atmospheric observations miss?"
      }
    },
    {
      "id": "2601.07414v1",
      "title": "Characterization of two new transiting sub-Neptunes and a terrestrial planet around M-dwarf hosts",
      "abstract": "We report the confirmation of three transiting exoplanets orbiting TOI-1243 (LSPM~J0902+7138), TOI-4529 (G~2--21), and TOI-5388 (Wolf~346) that were initially detected by TESS through ground-based photometry and radial velocity follow-up measurements with CARMENES. The planets present short orbital periods of $4.65$, $5.88$, and $2.59$ days, and they orbit early-M dwarfs (M2.0V, M1.5V, and M3.0V, respectively). We were able to precisely determine the radius of all three planets with a precision of $< 7\\, \\%$, the mass of TOI-1243 b with a precision of $19\\, \\%$, and upper mass limits for TOI-4529 b and TOI-5388 b. The radius of TOI-1243 b is $2.33\\pm0.12\\, {R_{\\oplus}}$, its mass is $7.7 \\pm 1.5\\,{M_{\\oplus}}$, and the mean density is $0.61 \\pm 0.15 \\, {ρ_\\oplus}$. The radius of TOI-4529 b is $1.77 ^{+0.09}_{-0.08} \\, {R_{\\oplus}}$, the $3 σ$ upper mass limit is $4.9 \\, {M_{\\oplus}}$, and the $3 σ$ upper density limit is $0.88\\, {ρ_\\oplus}$. The third planet, TOI-5388 b, is Earth-sized with a radius of $0.99 ^{+0.07}_{-0.06} \\, {R_{\\oplus}}$, a $3 σ$ upper mass limit of $2.2 \\, {M_{\\oplus}}$, and a $3 σ$ upper density limit of $2.2\\, {ρ_\\oplus}$. While TOI-5388 b is most probably rocky, given its Earth-like radius, TOI-1243 b and TOI-4529 b are located in a highly degenerate region in the mass-radius space. TOI-4529 b appears to lean toward a water-world composition. TOI-1243 b has enough mass to host a significant H-He envelope, although a water-world and pure rocky compositions are also consistent with the data. Our analysis indicates that future atmospheric observations using JWST can aid in determining their real composition. The sample of small planets around M dwarfs is widely used to understand planet formation and composition theories, and our study adds three planets to this sample.",
      "authors": [
        "E. Poultourtzidis",
        "G. Lacedelli",
        "E. Pallé",
        "I. Carleo",
        "C. Magliano",
        "S. Geraldía-González",
        "J. A. Caballero",
        "G. Morello",
        "J. Orell-Miquel",
        "H. M. Tabernero",
        "F. Murgas",
        "G. Covone",
        "F. J. Pozuelos",
        "P. J. Amado",
        "V. J. S. Béjar",
        "S. Chairetas",
        "C. Cifuentes",
        "D. R. Ciardi",
        "K. A. Collins",
        "I. J. M. Crossfield",
        "E. Esparza-Borges",
        "G. Fernández-Rodríguez",
        "A. Fukui",
        "Y. Hayashi",
        "A. P. Hatzes",
        "Th. Henning",
        "E. Herrero",
        "K. Horne",
        "S. B. Howell",
        "K. Isogai",
        "J. M. Jenkins",
        "Y. Kawai",
        "F. Libotte",
        "E. Matthews",
        "P. Meni-Gallardo",
        "I. Mireles",
        "J. C. Morales",
        "N. Narita",
        "B. B. Ogunwale",
        "H. Parviainen",
        "A. Quirrenbach",
        "A. Reiners",
        "I. Ribas",
        "R. Sefako",
        "A. Shporer",
        "R. P. Schwarz",
        "G. Srdoc",
        "L. Tal-Or",
        "S. Vanaverbeke",
        "N. Watanabe",
        "C. N. Watkins",
        "F. Zong Lang"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-12T10:56:09Z",
      "updated": "2026-01-12T10:56:09Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07414v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07414v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 18
    },
    {
      "id": "2601.06386v1",
      "title": "NASA Decadal Astrobiology Research and Exploration Strategy (NASA-DARES 2025) White Paper -- Habitable Worlds Observatory Living Worlds Science Cases: Research Gaps and Needs",
      "abstract": "Executive Summary: The Habitable Worlds Observatory (HWO) is the first astrophysics flagship mission with a key cross-divisional astrobiology science goal of searching for signs of life on rocky planets beyond our solar system. The Living Worlds Working Group under the Science, Technology, and Architecture Review Team (START) was charged with investigating how HWO could characterize potentially habitable exoplanets orbiting stars in the solar neighborhood, search for signs of life, and interpret potential biosignatures within a false positive and false negative framework. In particular, we focused on (1) identifying biosignatures that have spectral features in the UV-Vis-NIR wavelength range and defining their measurement requirements, (2) determining additional information needed from the planet and planet system to interpret biosignatures and assess the likelihood of false positives, and (3) assembling current knowledge of likely HWO target stars and identify which properties of host stars and systems are most critical to know in advance of HWO. The Living Worlds atmospheric biosignatures science case is considered one of the key drivers in the design of the observatory. An additional 10 astrobiology science cases were developed that collectively revealed key research gaps and needs required to fully explore the observatory parameter space and perform science return analyses. Investment in these research gaps will require coordination across the Science Mission Directorate and fall under the purview of the new Division-spanning astrobiology strategy.",
      "authors": [
        "Niki Parenteau",
        "Giada Arney",
        "Eleanora Alei",
        "Ruslan Belikov",
        " Svetlana",
        " Berdyugina",
        "Dawn Cardace",
        "Ligia F. Coelho",
        "Kevin Fogarty",
        "Kenneth Gordon",
        "Jonathan Grone",
        "Natalie Hinkel",
        "Nancy Kiang",
        "Ravi Kopparapu",
        "Joshua Krissansen-Totton",
        "Emilie LaFleche",
        "Jacob Lustig-Yaeger",
        "Eric Mamajek",
        "Avi Mandell",
        "Taro Matsuo",
        "Connor Metz",
        "Mark Moussa",
        "Stephanie Olson",
        "Lucas Patty",
        "Bill Philpot",
        "Sukrit Ranjan",
        "Edward Schwieterman",
        "Clara Sousa-Silva",
        "Anna Grace Ulses",
        "Sara Walker",
        "Daniel Whitt"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-10T02:14:07Z",
      "updated": "2026-01-10T02:14:07Z",
      "pdf_link": "https://arxiv.org/pdf/2601.06386v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.06386v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 16
    },
    {
      "id": "2601.08390v1",
      "title": "Direct detection of hydrogen reveals a new macroscopic crustal water reservoir on early Mars",
      "abstract": "The next great leap in Martian exploration will be the return of samples to Earth. To ensure the maximum scientific return from studying these samples, the development and utilisation of nondestructive analytical techniques are essential to enable early three-dimensional characterisation of their interiors. Neutron computed tomography is a powerful method in this context: it is highly sensitive to hydrogen and complements the more conventional X-ray computed tomography. Because the distribution and nature of hydrous phases are central to understanding the habitability, the climatic and geological evolution, and potential biosignatures of Mars, identifying hydrogenbearing phases in Martian crustal rocks is of particular importance. Using the only Martian crustal material available on Earth, the NWA 7034 meteorite and its pairs, we show that combined neutron and X-ray computed tomography enables non-destructive sample-wide mapping of hydrogen and reveals the distribution and petrographic contexts of hydrous phases. We identify hydrogen-rich iron oxyhydroxides within ancient igneous clasts, forming a macroscopic mineralogical water reservoir within the meteorite. These alteration assemblages closely resemble those observed in samples collected by the Perseverance rover in Jezero crater, where hydrated iron oxyhydroxides are also present. This similarity suggests that such phases may represent a widespread near-surface water reservoir on early Mars.",
      "authors": [
        "Estrid Buhl Naver",
        "Katrine Wulff Nikolajsen",
        "Martin Sæbye Carøe",
        "Domenico Battaglia",
        "Jens Frydenvang",
        "Martin Bizzarro",
        "Jakob Sauer Jørgensen",
        "Kim Lefmann",
        "Anders Kaestner",
        "David Christian Mannes",
        "Phil Cook",
        "Henrik Birkedal",
        "Thorbjørn Erik Køppen Christensen",
        "Innokenty Kantor",
        "Henning Friis Poulsen",
        "Luise Theil Kuhn"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T09:58:02Z",
      "updated": "2026-01-13T09:58:02Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08390v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08390v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 15
    },
    {
      "id": "2601.07465v1",
      "title": "Exoplanet transit search at the detection limit: detection and false alarm vetting pipeline",
      "abstract": "One of the primary mission goals of the Kepler space telescope was to detect Earth-like terrestrial planets in the habitable zone around Sun-like stars. These planets are at the detection limit, where the Kepler detection and vetting pipeline produced unreliable planet candidates. We present a novel pipeline that improves the removal of localized defects prior to the planet search, improves vetting at the level of individual transits and introduces a Bayes factor test statistic and an algorithm for extracting multiple candidates from a single detection run. We show with injections in the Kepler data that the introduced novelties improve pipeline's completeness at a fixed false alarm rate. We apply the pipeline to the stars with previously identified planet candidates and show that our pipeline successfully recovers the previously confirmed candidates, but flags a considerable portion of unconfirmed candidates as likely false alarms, especially in the long period, low signal-to-noise ratio regime. In particular, several known Earth-like candidates in the habitable zone, such as KOI 8063.01, 8107.01 and 8242.01, are identified as false alarms, which could have a significant impact on the estimates of $η_{\\oplus}$, i.e., the occurrence of Earth-like planets in the habitable zone.",
      "authors": [
        "Jakob Robnik",
        "Uroš Seljak",
        "Jon M. Jenkins",
        "Steve Bryson"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-12T12:21:18Z",
      "updated": "2026-01-12T12:21:18Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07465v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07465v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 13
    },
    {
      "id": "2601.08227v1",
      "title": "Jupiter-like uniform metal enrichment in a system of multiple giant exoplanets",
      "abstract": "The accretion of icy and rocky solids during the formation of a gas giant planet is poorly constrained and challenging to model. Refractory species, like sulfur, are only present in solids in the protoplanetary disk where planets form. Measuring their abundance in planetary atmospheres is one of the most direct ways of constraining the extent and mechanism of solid accretion. Using the unprecedented sensitivity of NASA's James Webb Space Telescope (JWST), we measure a detailed chemical make-up of three massive gas giants orbiting the star HR~8799 including direct detections of H$_2$O, CO, CH$_4$, CO$_2$, H$_2$S, $^{13}$CO, and C$^{18}$O. We find these planets are uniformly and highly enriched in heavy elements compared to the star irrespective of their volatile (carbon and oxygen) or refractory (sulfur) nature, which strongly suggests efficient accretion of solids during their formation. This composition closely resembles that of Jupiter and Saturn and demonstrates that this enrichment also occurs in systems of multiple gas giant planets orbiting stars beyond the Solar System. This discovery hints at a shared origin for the heavy element enrichment of giant planets across a wider range of planet masses and orbital separations than previously anticipated.",
      "authors": [
        "Jean-Baptiste Ruffio",
        "Jerry W. Xuan",
        "Yayaati Chachan",
        "Aurora Kesseli",
        "Eve J. Lee",
        "Charles Beichman",
        "Klaus Hodapp",
        "William O. Balmer",
        "Quinn Konopacky",
        "Marshall D. Perrin",
        "Dimitri Mawet",
        "Heather A. Knutson",
        "Geoffrey Bryden",
        "Thomas P. Greene",
        "Doug Johnstone",
        "Jarron Leisenring",
        "Michael Meyer",
        "Marie Ygouf"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T05:16:12Z",
      "updated": "2026-01-13T05:16:12Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08227v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08227v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 12
    },
    {
      "id": "2601.09766v1",
      "title": "Habitable Worlds Observatory (HWO): Living Worlds Community Working Group: The Search for Life on Potentially Habitable Exoplanets",
      "abstract": "The discovery of a biosphere on another planet would transform how we view ourselves, and our planet Earth, in relation to the rest of the cosmos. We now know Earth is one planet among eight circling our sun; our sun is part of a swirling galaxy of over one hundred billion other suns; and our galaxy is one of untold billions in the universe. While we do not yet know how many, if any, other biospheres exist on the countless worlds orbiting countless other suns, we stand at the precipice of a new era of discovery, enabled by powerful new facilities able to peer across the light years into the atmospheres of planets similar to our own. This article is an adaptation of a science case document (SCDD) developed for the NASA Astrophysics Flagship mission the Habitable Worlds Observatory (HWO) Science, Technology, and Architecture Review Team (START) Living Worlds Community Working Group.",
      "authors": [
        "Giada Arney",
        "Niki Parenteau",
        "Natalie Hinkel",
        "Eric Mamajek",
        "Joshua Krissansen-Totton",
        "Stephanie Olson",
        "Edward Schwieterman",
        "Sara Walker",
        "Kevin Fogarty",
        "Ravi Kopparapu",
        "Jacob Lustig-Yaeger",
        "Mark Moussa",
        "Sukrit Ranjan",
        "Garima Singh",
        "Clara Sousa-Silva",
        "Ruslan Belikov",
        "Maxwell Frissell",
        "Samantha Gilbert-Janziek",
        "Vincent Kofman",
        "Natasha Latouf",
        "Mary Anne Limbach",
        "Rhonda Morgan",
        "Christopher Stark",
        "Armen Tokadjian",
        "Anna Grace Ulses",
        "Nicholas Wogan",
        "Mike Wong",
        "Amber Young"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP"
      ],
      "published": "2026-01-14T09:44:50Z",
      "updated": "2026-01-14T09:44:50Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09766v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09766v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 10
    },
    {
      "id": "2601.08397v1",
      "title": "Anatomy of Empirical Transit Spectra of Mars based on TGO/NOMAD",
      "abstract": "Transit spectroscopy is a powerful tool for probing atmospheric structures of exoplanets. Accurately accounting for the effects of aerosols is key to reconstructing atmospheric properties from transit spectra, yet this remains a significant challenge. To advance this effort, it is invaluable to examine the spectral features of well-characterized planetary atmospheres. Here, we synthesize empirical transit spectra of Mars across different seasons based on data from the NOMAD's Solar Occultation channel onboard ExoMars/TGO, which operates at wavelengths of 0.2-0.65 and 2-4 micron. In the generated empirical transit spectra, the atmosphere below 25 km is found to be largely opaque due to the presence of micron-sized dust and water ice clouds, both of which substantially weaken spectral features. The spectra exhibit CO2 absorption features at 2.7-2.8 micron and signatures of sub-micron-sized mesospheric water ice clouds around 3.1 micron, accompanied by a continuum slope. The amplitudes of these spectral features are found to vary with the Martian seasons, where the dust storms weaken the CO2 signatures and strengthen the water ice features, which serve as potential indicators of a dusty planet like Mars. If TRAPPIST-1f possessed a Mars-like atmospheric structure, both CO2 and water ice features would be detectable at a noise level of 3 ppm, a level likely beyond current observational capabilities. Nevertheless, the 3.1 micron feature produced by sub-micron-sized mesospheric water ice clouds offers a novel avenue for characterizing the atmospheres of habitable-zone exoplanets.",
      "authors": [
        "Shohei Aoki",
        "Yuka Fujii",
        "Hideo Sagawa",
        "Geronimo L. Villanueva",
        "Ian Thomas",
        "Bojan Ristic",
        "Frank Daerden",
        "Miguel Angel López-Valverde",
        "Manish R. Patel",
        "Jonathon Mason",
        "Yannick Willame",
        "Giancarlo Bellucci",
        "Ann Carine Vandaele"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "published": "2026-01-13T10:05:41Z",
      "updated": "2026-01-13T10:05:41Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08397v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08397v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 10
    },
    {
      "id": "2601.10508v1",
      "title": "sponchpop II: Population Synthesis to Investigate Volatile Sulfur as a Fingerprint of Gas Giant Formation Histories",
      "abstract": "Planet population synthesis is an integral tool for linking exoplanets to their formation environments. Most planet population synthesis studies have focused on the carbon-to-oxygen ratio (C/O) in gas or solids, yet more insight into planet formation may be afforded by considering a wider suite of elements. Sulfur is one such key element. It has been assumed to be entirely refractory in population synthesis models, restricting it to being a tracer of accreted rocky solids. However, sulfur also has a volatile reservoir dominant at the onset of star and planet formation. We investigate sulfur's wider potential as a formation history tracer by implementing the first multi-phase treatment of S in a planet population synthesis model. We present the planet formation module of \\textsc{sponchpop} and its first predicted planet growth tracks and populations. We explore the diversity of planet compositions in terms of their sulfur budget, including both refractory and volatile components, and apply a novel gas-grain conversion of sulfur to study how formation trajectories of giant planets relate to final core and envelope compositions. We show that planets inherit a wide range of core and envelope sulfur content related to accretion history while considering late-stage planetesimal infall, providing a new diagnostic tool for planet formation. The diverse sulfur content of planet cores suggests some rocky planets may be born sulfur-poor, with implications for their geochemistry and habitability. Enhanced sulfur abundances in gas-giant atmospheres can be attributed to formation beyond the H2S iceline, such as the giants in our Solar System.",
      "authors": [
        "Anna Sommerville-Thomas",
        "Mihkel Kama",
        "Oliver Shottle",
        "Jason Ran"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T15:34:21Z",
      "updated": "2026-01-15T15:34:21Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10508v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10508v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 9
    },
    {
      "id": "2601.09330v1",
      "title": "NIRPS tightens the mass estimate of GJ 3090 b and detects a planet near the stellar rotation period",
      "abstract": "We present an updated characterization of the planetary system orbiting the nearby M2 dwarf GJ 3090 (TOI-177; $d = 22$ pc), based on new high-precision radial velocity (RV) observations from NIRPS and HARPS. With an orbital period of 2.85 d, the transiting sub-Neptune GJ 3090 b has a mass we refine to $4.52 \\pm 0.47 M_{\\oplus}$, which, combined with our derived radius of $2.18 \\pm 0.06 R_{\\oplus}$, yields a density of $2.40^{+0.33}_{-0.30}$ g cm$^{-3}$. The combined interior structure and atmospheric constraints indicate that GJ 3090 b is a compelling water-world candidate, with a volatile-rich envelope in which water likely represents a significant fraction. We also confirm the presence of a second planet, GJ 3090 c, a sub-Neptune with a 15.9 d orbit and a minimum mass of $10.0 \\pm 1.3 M_{\\oplus}$, which does not transit. Despite its proximity to the star's 18 d rotation period, our joint analysis using a multidimensional Gaussian process (GP) model that incorporates TESS photometry and differential stellar temperature measurements distinguishes this planetary signal from activity-induced variability. In addition, we place new constraints on a non-transiting planet candidate with a period of 12.7 d, suggested in earlier RV analyses. This candidate remains a compelling target for future monitoring. These results highlight the crucial role of multidimensional GP modelling in disentangling planetary signals from stellar activity, enabling the detection of a planet near the stellar rotation period that could have remained undetected with traditional approaches.",
      "authors": [
        "Pierrot Lamontagne",
        "Drew Weisserman",
        "Charles Cadieux",
        "David Lafrenière",
        "Alexandrine L'Heureux",
        "Mykhaylo Plotnykov",
        "Léna Parc",
        "Atanas K. Stefanov",
        "Leslie Moranta",
        "René Doyon",
        "François Bouchy",
        "Jean-Baptiste Delisle",
        "Louise D. Nielsen",
        "Gaspare Lo Curto",
        "Frédérique Baron",
        "Susana C. C. Barros",
        "Björn Benneke",
        "Xavier Bonfils",
        "Marta Bryan",
        "Bruno L. Canto Martins",
        "Ryan Cloutier",
        "Nicolas B. Cowan",
        "Daniel Brito de Freitas",
        "Jose Renan De Medeiros",
        "Xavier Delfosse",
        "Elisa Delgado-Mena",
        "Xavier Dumusque",
        "David Ehrenreich",
        "Pedro Figueira",
        "Jonay I. González Hernández",
        "Izan de Castro Leão",
        "Christophe Lovis",
        "Lison Malo",
        "Claudio Melo",
        "Lucile Mignon",
        "Christoph Mordasini",
        "Francesco Pepe",
        "Rafael Rebolo",
        "Jason Rowe",
        "Nuno C. Santos",
        "Damien Ségransan",
        "Alejandro Suárez Mascareño",
        "Stéphane Udry",
        "Diana Valencia",
        "Gregg Wade",
        "Manuel Abreu",
        "José Luan A. Aguiar",
        "Khaled Al Moulla",
        "Guillaume Allain",
        "Romain Allart",
        "Jose Manuel Almenara",
        "Tomy Arial",
        "Hugues Auger",
        "Luc Bazinet",
        "Nicolas Blind",
        "David Bohlender",
        "Étienne Artigau",
        "Isabelle Boisse",
        "Anne Boucher",
        "Vincent Bourrier",
        "Sébastien Bovay",
        "Pedro Branco",
        "Christopher Broeg",
        "Denis Brousseau",
        "Alexandre Cabral",
        "Andres Carmona",
        "Yann Carteret",
        "Zalpha Challita",
        "David Charbonneau",
        "Bruno Chazelas",
        "Catherine A. Clark",
        "João Coelho",
        "Marion Cointepas",
        "Karen A. Collins",
        "Kevin I. Collins",
        "Uriel Conod",
        "Eduardo Cristo",
        "Ana Rita Costa Silva",
        "Antoine Darveau-Bernier",
        "Laurie Dauplaise",
        "Roseane de Lima Gomes",
        "João Faria",
        "Dasaev O. Fontinele",
        "Thierry Forveille",
        "Yolanda G. C. Frensch",
        "Jonathan Gagné",
        "Frédéric Genest",
        "Ludovic Genolet",
        "João Gomes da Silva",
        "Félix Gracia Témich",
        "Nicole Gromek",
        "Nolan Grieves",
        "Olivier Hernandez",
        "Melissa J. Hobson",
        "H. Jens Hoeijmakers",
        "Norbert Hubin",
        "Neil J. Cook",
        "Marziye Jafariyazani",
        "Farbod Jahandar",
        "Ray Jayawardhana",
        "Hans-Ulrich Käufl",
        "Dan Kerley",
        "Johann Kolb",
        "Vigneshwaran Krishnamurthy",
        "Benjamin Kung",
        "Pierre Larue",
        "Henry Leath",
        "Olivia Lim",
        "Allan M. Martins",
        "Elisabeth C. Matthews",
        "Jaymie Matthews",
        "Jean-Sébastien Mayer",
        "Stan Metchev",
        "Lina Messamah",
        "Yuri S. Messias",
        "Dany Mounzer",
        "Nicola Nari",
        "Ares Osborn",
        "Mathieu Ouellet",
        "Jon Otegi",
        "Luca Pasquini",
        "Vera M. Passegger",
        "Stefan Pelletier",
        "Céline Peroux",
        "Caroline Piaulet-Ghorayeb",
        "Emanuela Pompei",
        "Anne-Sophie Poulin-Girard",
        "José Luis Rasilla",
        "Vladimir Reshetov",
        "Jonathan Saint-Antoine",
        "Mirsad Sarajlic",
        "Ivo Saviane",
        "Robin Schnell",
        "Alex Segovia",
        "Julia Seidel",
        "Armin Silber",
        "Peter Sinclair",
        "Michael Sordet",
        "Danuta Sosnowska",
        "Avidaan Srivastava",
        "Márcio A. Teixeira",
        "Simon Thibault",
        "Philippe Vallée",
        "Thomas Vandal",
        "Valentina Vaulato",
        "Joost P. Wardenier",
        "Bachar Wehbe",
        "Ivan Wevers",
        "François Wildi",
        "Vincent Yariv",
        "Gérard Zins"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T10:04:56Z",
      "updated": "2026-01-14T10:04:56Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09330v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09330v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 9
    },
    {
      "id": "2601.08952v1",
      "title": "Formation and evolution of planetary systems",
      "abstract": "Various problems of the formation and evolution of planetary systems are studied. Most of the studies are devoted to the Solar System. The collapse of the presolar cloud and the accumulation of planets are studied. The author considers the formation of the Earth-Moon system, binary trans-Neptunian objects, and the axial rotations of planets. He discusses the formation of asteroid and trans-Neptunian belts, including the evolution of resonant asteroid orbits and the formation of the Kirkwood gaps in the asteroid belt. The book discusses the migration of bodies during the formation of the Solar System and at present, including a discussion of the delivery of icy bodies from beyond the ice line to the terrestrial planets and the formation of craters on the Moon. The Deep Impact mission is discussed; during this mission the impact module of the spacecraft collided with the comet Tempel 1. The book studies the migration of dust in the Solar System and the formation of the zodiacal belt, as well as the migration of bodies and dust particles ejected from the terrestrial planets and the Moon. The author considers the migration of bodies in some exoplanetary systems (Proxima Centauri, Trappist 1, and Gliese 581), the spectra of Earth-like exoplanets with different rotation periods, as well as the efficiency of exoplanet searches using microlensing observations with various telescopes. English text is only in the list of publications and in the contents. An English reader can look the contents to find an interesting section. In this section he can find the numbers for relative publications. Using these numbers and the list of publications, he can find the websites where he can upload free files with these publications, and then he can read relevant papers in English and can get more detailed information than in this book.",
      "authors": [
        "S. I. Ipatov"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T19:43:28Z",
      "updated": "2026-01-13T19:43:28Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08952v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08952v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 9
    },
    {
      "id": "2601.08890v1",
      "title": "Planet-Host Stars Across the Galaxy in the 2040s",
      "abstract": "By the 2040s, the exoplanet field will have moved from the discovery of a few thousand planets to hundreds of thousands, thanks to Gaia DR5, TESS, PLATO, Roman, and their successors. At that stage, the key bottleneck will no longer be planet detection, but our ability to understand how planetary systems form, evolve, and diversify across different stellar and Galactic environments. To address this, we need a large-scale, high-resolution spectroscopic survey of planet-host stars, spanning a broad range of Galactic environments (thin and thick disks, bulge, halo, clusters, associations), and including a well-defined control sample of non-hosts. Such a survey must deliver homogeneous stellar parameters, detailed abundance determinations, ages, and kinematics for tens of thousands of hosts, extending to the faint magnitudes probed by future missions but are beyond the reach of existing and currently planned spectroscopic facilities.",
      "authors": [
        "M. Tsantaki",
        "K. Biazzo",
        "F. Zahra Majidi",
        "G. Tautvaisiene",
        "I. Busa"
      ],
      "categories": [
        "astro-ph.IM",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.SR"
      ],
      "published": "2026-01-13T10:20:31Z",
      "updated": "2026-01-13T10:20:31Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08890v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08890v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 8
    },
    {
      "id": "2601.09492v1",
      "title": "Demographics of Close-In TESS Exoplanets Orbiting FGK Main-sequence Stars",
      "abstract": "Understanding the demographics of close-in planets is crucial for insights into exoplanet formation and evolution. We present a detailed analysis of occurrence rates for close-in (0.5-16 day) planets with radii between 2 and 20$\\,R_{\\oplus}$ around FGK main-sequence stars. Our study uses a comprehensive sample from four years of TESS Science Processing Operations Center full-frame image data cross-matched with Gaia, analysed through our rigorous detection, vetting, and validation pipeline. Using high-confidence planet candidates, we apply a hierarchical Bayesian model to determine occurrence rates in the two-dimensional orbital period-radius plane. Our results are presented using 10-by-10 bins across the period-radius parameter space, offering unprecedented resolution and statistical precision. We find an overall occurrence rate of $9.4^{+0.7}_{-0.6}\\%$. When using identical binning, our occurrence rate posteriors distributions align with Kepler's but have a magnitude smaller uncertainties on average. For hot Jupiters, we estimate the overall occurrence rate of $0.39^{+0.03}_{-0.02}\\%$. This value is consistent with the previous Kepler FGK-type result within $1σ$. We find an overall occurrence rate of Neptunian desert planets of $0.08\\pm0.01\\%$, to our knowledge the first such determination. Additionally, in a volume-limited Gaia subsample within 100 pc in the same parameter region, we measure an overall planet occurrence rate of $15.4^{+1.6}_{-1.5}\\%$ and a hot Jupiter occurrence rate of $0.42^{+0.16}_{-0.12}\\%$. Our results establishes an improved foundation for constraining theoretical models of exoplanet populations.",
      "authors": [
        "Kaiming Cui",
        "David J. Armstrong",
        "Andreas Hadjigeorghiou",
        "Marina Lafarga",
        "Vedad Kunovac",
        "Lauren Doyle",
        "Luis Agustín Nieto",
        "Rodrigo F. Díaz"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T13:59:49Z",
      "updated": "2026-01-14T13:59:49Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09492v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09492v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 7
    },
    {
      "id": "2601.09438v1",
      "title": "Mass estimates of the young TOI-451 transiting planets: Multidimensional Gaussian Process on stellar spectroscopic and photometric signals",
      "abstract": "The young TOI-451 planetary system, aged 125 Myr, provides a unique opportunity to test theories of planetary internal structures and atmospheric mass loss through examination of its three transiting planets. We present an exhaustive photometric and spectroscopic follow-up to determine the orbital and physical properties of the system. We perform multidimensional Gaussian Process regression with the code pyaneti on spectroscopic time-series and NGTS/LCO light curves to disentangle the stellar and planetary signal in ESPRESSO radial velocities. We show how contemporaneous photometry serves as an activity indicator to inform RV modelling within a multidimensional Gaussian Processes framework. We argue that this can be exploited when spectroscopic observations are adversely affected by low signal-to-noise and/or poor sampling. We estimate the Doppler semi-amplitudes of Kb = 2.6(+1.1,-1.2) m/s, Kc = 1.2(+1.0,-0.8) m/s and Kd = 2.7 +/- 1.2 m/s. This translates into 2-sigma mass estimates for TOI-451 b and d of Mb = 4.7(+2.1,-2.2) Earth masses and Md = 10.2(+4.6,-4.5) Earth masses, as well as a mass upper limit for TOI-451 c of Mc < 11.5 Earth masses. The derived planetary properties suggest that planets c and d contain significant hydrogen-rich envelopes. The inferred parameters of TOI-451 b are consistent with either a rocky world that still retains a small hydrogen envelope or a water world. These insights make the TOI-451 system an ideal laboratory for future follow-up studies aimed at measuring atmospheric compositions, detecting atmospheric mass-loss signatures, and further exploring planetary formation and evolution processes.",
      "authors": [
        "Oscar Barragán",
        "Manuel Mallorquín",
        "Jorge Fernández-Fernández",
        "Faith Hawthorn",
        "Alix V. Freckelton",
        "Marina Lafarga",
        "Michael Cretignier",
        "Yoshi N. E. Eschen",
        "Samuel Gill",
        "Víctor J. S. Béjar",
        "Nicolas Lodieu",
        "Haochuan Yu",
        "Thomas G. Wilson",
        "David Anderson",
        "Ioannis Apergis",
        "Matthew Battley",
        "Edward M. Bryant",
        "Pía Cortés-Zuleta",
        "Edward Gillen",
        "James S. Jenkins",
        "Baptiste Klein",
        "James McCormac",
        "Annabella Meech",
        "Erik Meier-Valdés",
        "Maximiliano Moyano",
        "Annelies Mortier",
        "Felipe Murgas",
        "Louise D. Nielsen",
        "Suman Saha",
        "José I. Vines",
        "Richard West",
        "Peter J. Wheatley",
        "Suzanne Aigrain"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T12:39:48Z",
      "updated": "2026-01-14T12:39:48Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09438v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09438v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 5
    },
    {
      "id": "2601.10450v1",
      "title": "TOI-3862 b: A dense super-Neptune deep in the hot Neptune desert",
      "abstract": "The structure and evolution of close-in exoplanets are shaped by atmospheric loss and migration processes, which give rise to key population features such as the hot Neptune desert, ridge, and savanna - regions of the period-radius space whose boundaries offer critical insights into planetary formation and survival. As part of the KESPRINT collaboration, we selected the TESS transiting planet candidate TOI-3862.01 for radial velocity follow-up to confirm its planetary nature and characterize its mass and bulk properties. This planet candidate is of particular interest due to its position in the middle of the hot Neptune desert, making it a valuable probe for testing theories of planet migration and atmospheric loss. We confirmed the planetary nature and determined the mass of TOI-3862.01 (hereinafter TOI-3862b) by performing a joint fit with both transit and radial velocity data, precisely characterizing the bulk properties of this planet. TOI-3862b is a super-Neptune on a 1.56-day orbit around a Sun-like star with an effective temperature of 5300$\\pm$50K. It has a mass of 53.7$_{-2.9}^{+2.8}$ M$_{\\oplus}$ and a radius of 5.53$\\pm$0.18 R$_{\\oplus}$, corresponding to a density of 1.7$\\pm$0.2 g/cm^3. This places it among the rare population of hot and dense super-Neptune desert planets. TOI-3862b, residing deep in the hot Neptune desert, represents a rare occurrence in an otherwise sparsely populated region, offering a valuable opportunity to probe the processes that may allow planets to survive in such environments.",
      "authors": [
        "Ilaria Carleo",
        "Amadeo Castro-González",
        "Enric Pallé",
        "Felipe Murgas",
        "Grzegorz Nowak",
        "Gaia Lacedelli",
        "Thomas Masseron",
        "Emily W. Wong",
        "Patrick Eggenberger",
        "Vincent Bourrier",
        "Dawid Jankowski",
        "Krzysztof Goździewski",
        "Douglas R. Alves",
        "James S. Jenkins",
        "Sergio Messina",
        "Keivan G. Stassun",
        "Jose I. Vines",
        "Matteo Brogi",
        "David R. Ciardi",
        "Catherine A. Clark",
        "William Cochran",
        "Karen A. Collins",
        "Hans J. Deeg",
        "Elise Furlan",
        "Davide Gandolfi",
        "Samuel Geraldía González",
        "Artie P. Hatzes",
        "Coel Hellier",
        "Steve B. Howell",
        "Judith Korth",
        "Jorge Lillo-Box",
        "John H. Livingston",
        "Jaume Orell-Miquel",
        "Carina M. Persson",
        "Seth Redfield",
        "Boris Safonov",
        "David Baker",
        "Rafael Delfin Barrena Delgado",
        "Allyson Bieryla",
        "Andrew Boyle",
        "Pau Bosch-Cabot",
        "Núria Casasayas Barris",
        "Stavros Chairetas",
        "Jerome P. de Leon",
        "Izuru Fukuda",
        "Akihiko Fukui",
        "Pere Guerra",
        "Kai Ikuta",
        "Kiyoe Kawauchi",
        "Emil Knudstrup",
        "Florence Libotte",
        "Michael B. Lund",
        "Rafael Luque",
        "Eduardo Lorenzo Martín Guerrero de Escalante",
        "Bob Massey",
        "Edward J. Michaels",
        "Giuseppe Morello",
        "Norio Narita",
        "Hannu Parvianien",
        "Richard P. Schwarz",
        "Avi Shporer",
        "Monika Stangret",
        "Noriharu Watanabe",
        "Cristilyn N. Watkins"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T14:39:32Z",
      "updated": "2026-01-15T14:39:32Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10450v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10450v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 3
    },
    {
      "id": "2601.10598v1",
      "title": "A young progenitor for the most common planetary systems in the Galaxy",
      "abstract": "The Galaxy's most common known planetary systems have several Earth-to-Neptune-size planets in compact orbits. At small orbital separations, larger planets are less common than their smaller counterparts by an order of magnitude. The young star V1298 Tau hosts one such compact planetary system, albeit with four planets that are uncommonly large (5 to 10 Earth radii). The planets form a chain of near-resonances that result in transit-timing variations of several hours. Here we present a multi-year campaign to characterize this system with transit-timing variations, a method insensitive to the intense magnetic activity of the star. Through targeted observations, we first resolved the previously unknown orbital period of the outermost planet. The full 9-year baseline from these and archival data then enabled robust determination of the masses and orbital parameters for all four planets. We find the planets have low, sub-Neptune masses and nearly circular orbits, implying a dynamically tranquil history. Their low masses and large radii indicate that the inner planets underwent a period of rapid cooling immediately after dispersal of the protoplanetary disk. Still, they are much less dense than mature planets of comparable size. We predict the planets will contract to 1.5-4.0 Earth radii and join the population of super-Earths and sub-Neptunes that nature produces in abundance.",
      "authors": [
        "John H. Livingston",
        "Erik A. Petigura",
        "Trevor J. David",
        "Kento Masuda",
        "James Owen",
        "David Nesvorný",
        "Konstantin Batygin",
        "Jerome de Leon",
        "Mayuko Mori",
        "Kai Ikuta",
        "Akihiko Fukui",
        "Noriharu Watanabe",
        "Jaume Orell Miquel",
        "Felipe Murgas",
        "Hannu Parviainen",
        "Judith Korth",
        "Florence Libotte",
        "Néstor Abreu García",
        "Pedro Pablo Meni Gallardo",
        "Norio Narita",
        "Enric Pallé",
        "Motohide Tamura",
        "Atsunori Yonehara",
        "Andrew Ridden-Harper",
        "Allyson Bieryla",
        "Alessandro A. Trani",
        "Eric E. Mamajek",
        "David R. Ciardi",
        "Varoujan Gorjian",
        "Lynne A. Hillenbrand",
        "Luisa M. Rebull",
        "Elisabeth R. Newton",
        "Andrew W. Mann",
        "Andrew Vanderburg",
        "Guðmundur Stefánsson",
        "Suvrath Mahadevan",
        "Caleb Cañas",
        "Joe Ninan",
        "Jesus Higuera",
        "Kamen Todorov",
        "Jean-Michel Désert",
        "Lorenzo Pino"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T17:07:23Z",
      "updated": "2026-01-15T17:07:23Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10598v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10598v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 2
    },
    {
      "id": "2601.10285v1",
      "title": "How disc initial conditions sculpt the atmospheric composition of giant planets",
      "abstract": "Past studies have revealed the dependency of the disc parameters (mass, radius, viscosity, grain fragmentation velocity, dust-to-gas ratio) on the formation of giant planets, where more massive discs seem beneficial for giant planet formation. It is unclear how the different disc properties influence the composition of forming giant planets. The idea that the atmospheric abundances can trace directly the formation location of planets is put into question, due to the chemical evolution of the disc, caused by inward drifting and evaporating pebbles. This complicates the idea of a relation between atmospheric abundances and planet formation locations. We use planet formation simulations that include the effects of pebble drift and evaporation and investigate how the different disc parameters influence the atmospheric composition of giant planets. We focus on the atmospheric C/O, C/H, O/H and S/H ratios allowing us to probe tracers for volatiles and refractories and thus different accretion pathways of giant planets. We find that most of the disc parameters have only a limited influence on the atmospheric abundances of gas giants, except for the dust-to-gas ratio, where a larger value results in higher atmospheric abundances. However the atmospheric abundances are determined by the planetary formation location, even in the pebble drift and evaporation scenario. Our study suggests that volatile-rich giant exoplanets predominantly form in the inner disc regions, where they can accrete large fractions of vapour-enhanced gas. Our study shows that simulations that try to trace the origin of giant planets via their atmospheric abundances do not have to probe all disc parameters, as long as the disc parameters allow the formation of giant planets. Our study thus suggests that the diversity of observed planetary compositions is a direct consequence of their formation location and migration history.",
      "authors": [
        "Angie Daniela Guzmán Franco",
        "Sofia Savvidou",
        "Bertram Bitsch"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-15T11:01:08Z",
      "updated": "2026-01-15T11:01:08Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10285v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10285v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0
    },
    {
      "id": "2601.09835v1",
      "title": "A Robust Launching Mechanism for Freely-Floating Planets from Host Stars with Close-in Planets",
      "abstract": "Secular perturbations from binary stars and distant massive planets can drive cold planets onto nearly parabolic orbits with pericenter passages extremely close to their host stars. Meanwhile, short-period super-Earths are frequently observed around nearby stars. Gravitational scattering between these two distinct populations can lead to substantial orbital energy exchange, liberating some intruders from the gravitational confinement of their host systems. This process offers a robust formation channel for a subset of the abundant freely floating planet population. It may also significantly perturb the original orbits of close-in planets, induce collisional trajectories between close-in planets and their host stars, and disrupt the dynamical evolution of cold planets toward close stellar encounters.",
      "authors": [
        "Xiaochen Zheng",
        "Zhuoya Cao",
        "Shigeru Ida",
        "Douglas N. C. Lin",
        "Shude Mao"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-14T19:49:45Z",
      "updated": "2026-01-14T19:49:45Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09835v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09835v1",
      "is_exoplanet_focused": true,
      "tweetability_score": 0
    },
    {
      "id": "2601.07088v1",
      "title": "On the 3D time evolution of the dust size distribution in protostellar envelopes",
      "abstract": "Dust plays a fundamental role during protostellar collapse, disk and planet formation. Recent observations suggest that efficient dust growth may begin early, in the protostellar envelopes, potentially even before the formation of the disk. Three-dimensional models of protostellar evolution, addressing multi-size dust growth, gas and dust dynamics and magnetohydrodynamics, are required to characterize the dust evolution in the embedded stages of star formation. We aim to establish a new framework for dust evolution models, following in 3D the dust size distribution both in time and space, in MHD models describing the formation and evolution of star-disk systems, at low numerical cost. We present our work coupling the COALA dust evolution module into the code RAMSES, performing the first 3D MHD simulation of protostellar collapse including simultaneously polydisperse dust growth modeled by the Smoluchowski equation as well as dust dynamics in the terminal velocity approximation. Ice-coated micron-sized grains can rapidly grow in the envelope and survive by not entering the fragmentation regime. The evolution of the dust size distribution is highly anisotropic due to the turbulent nature of the collapse and the development of favorable locations such as outflow cavity walls, which enhance locally the dust-to-gas ratio. We analyzed the first 3D non-ideal MHD simulations that self-consistently account for the dust dynamics and growth during the protostellar stage. Very early in the lifetime of a young embedded protostar, micron-sized grains can grow, and locally the dust size distribution deviates significantly from the MRN initial shape. This new numerical method opens the perspective to treat simultaneously gas/dust dynamics and dust growth in 3D simulations at a low numerical cost for several astrophysical environments.",
      "authors": [
        "Maxime Lombart",
        "Ugo Lebreuilly",
        "Anaëlle Maury"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP",
        "astro-ph.GA",
        "astro-ph.IM"
      ],
      "published": "2026-01-11T22:50:21Z",
      "updated": "2026-01-11T22:50:21Z",
      "pdf_link": "https://arxiv.org/pdf/2601.07088v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.07088v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 10
    },
    {
      "id": "2601.06420v1",
      "title": "Simulations of Electron Beam Interactions in Brown Dwarf Atmospheres",
      "abstract": "Over two decades ago, the first detection of electron cyclotron maser instability (ECMI) radio emission from a brown dwarf confirmed the presence of aurorally precipitating electrons on these objects. This detection established that brown dwarfs can exhibit magnetic activity that is planetary and auroral, rather than stellar in nature. This discovery motivated ongoing observational searches for the corresponding optical, ultraviolet (UV), and infrared (IR) auroral emission expected based on solar system analogs. The continuing nondetection of such auroral emission indicates important differences exist between auroral processes on brown dwarfs and solar system planets. In this work, we implement a Monte Carlo simulation of monoenergetic electron beams interacting with brown dwarf atmospheres, as a step towards understanding the physics of brown dwarf auroral emission. We detail the algorithm and underlying assumptions, and validate against previously published Jovian results (Hiraki et al. 2008). Our results agree well with literature, with some discrepancy from our updated interaction cross sections. We demonstrate the applicability of our simulation across the range of surface gravities and effective temperatures of radio-emitting brown dwarfs. We present an analytic parameterization of interaction rates based on our finding that atmospheric column density governs the interaction profiles. We apply this parameterization to calculate the total volumetric interaction rates and energy deposition rate for representative electron beam energy spectra enabling future predictions for spectra of aurorally emitting brown dwarfs. Simulations of high energy electron interactions with substellar hydrogen-dominated atmospheres will guide observational searches for multi-wavelength auroral features beyond the solar system.",
      "authors": [
        "Anna Zuckerman",
        "J. Sebastian Pineda",
        "David Brain",
        "James Mang",
        "Caroline Morley"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-10T04:01:51Z",
      "updated": "2026-01-10T04:01:51Z",
      "pdf_link": "https://arxiv.org/pdf/2601.06420v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.06420v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 10
    },
    {
      "id": "2601.08923v1",
      "title": "Origin of asteroid (469219) Kamo`oalewa: the main asteroid belt or the Giordano Bruno crater on the Moon?",
      "abstract": "Asteroid Kamo`oalewa is the target of the Tianwen-2 sample-return mission by CNSA. Because of its orbit and its spectral properties, it was proposed that Kamo`oalewa originated from the Moon as impact ejecta, possibly from the Giordano Bruno crater. We aim at estimating the relative contribution of Kamo`oalewa-like objects originating from the general near-Earth asteroid (NEA) population which originated in the main asteroid belt, and compare it with the relative contribution of Giordano Bruno ejecta. We first estimate the average fraction of quasi-satellite orbits at any given time. By using recently developed NEA population models, we extract the expected number of Earth co-orbitals of the same size of Kamo`oalewa, and then get an estimate of the average number of Kamo`oalewa-like objects using the fraction computed before. Similarly, we obtain an estimate for the number of Kamo`oalewa-like objects that may originate as ejecta from the Giordano Bruno impact. We also performed survey simulations to estimate their efficiency in the detection of Kamo`oalewa-like objects. We found that the main belt accounts for 1.23 \\pm 0.13 Kamo`oalewa-like objects on average. The expected number of Kamo`oalewa-like objects originated as Giordano Bruno ejecta is 0.042, which is more than order of magnitude smaller. We found a discovery efficiency of Earth quasi-satellites between 95% and 70% for absolute magnitude between 22 and 25 for the Pan-STARRS survey, and population models show that this is in agreement with the known population. The Vera Rubin Observatory should reach an efficiency of 92% down to absolute magnitude 25. These estimates show that population models of NEAs are capable to account for Kamo`oalewa-like objects, thus supporting the hypothesis that that Kamo'oalewa originated from the main belt. This will be further investigated by the in-situ exploration of the Tianwen-2 mission.",
      "authors": [
        "M. Fenucci",
        "B. Novaković",
        "M. Granvik",
        "P. Zhang"
      ],
      "categories": [
        "astro-ph.EP"
      ],
      "published": "2026-01-13T19:02:05Z",
      "updated": "2026-01-13T19:02:05Z",
      "pdf_link": "https://arxiv.org/pdf/2601.08923v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.08923v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 8
    },
    {
      "id": "2601.09671v1",
      "title": "Parallaxes, Proper Motions, and Near-Infrared Photometry for 173 L and T Dwarfs From The US Naval Observatory Infrared Astrometry Program",
      "abstract": "We present near-infrared parallax and proper motion astrometry for 74 L-dwarfs and 99 T-dwarfs, as single objects or in binary systems, obtained with the ASTROCAM astrometric imager on the USNO, Flagstaff Station 1.55-m telescope over two observing periods. For all 173 objects the median number of observational epochs was 62 with a median time frame of 5.25 years, resulting in median uncertainties of $σ$($π_{abs}$) = 1.51 mas, $σ$($μ_{abs}$) = 1.02 mas yr$^{-1}$, and $σ$($V_{\\rm tan}$) = 1.01 km s$^{-1}$. Our observations provide the first parallax/proper motion results for 16 objects and the highest precision parallaxes/proper motions for an additional 116 objects. A serendipitous overlap of 40 objects with Gaia DR3 astrometry allows direct comparison and confirmation of our results, along with an investigation on the effects of resolved binarity on astrometric results. We also provide a uniform set of $J$-, $H$-, $K_{S}$-band photometry in the UKIRT/MKO system, most of it being from new observations. We use these results to examine objects included in this study of special-interest populations, consisting of binaries, wide companions, young objects, subdwarfs, and brown dwarf spectral standards.",
      "authors": [
        "Frederick J. Vrba",
        "Adam C. Schneider",
        "Jeffrey A. Munn",
        "Arne A. Henden",
        "Christain B. Luginbuhl",
        "Conard C. Dahn",
        "Harry H. Guetter",
        "Blaise J. Canzian",
        "Trudy M. Tilleman",
        "Scott E. Dahm",
        "Stephen J. Williams",
        "Justice E. Bruursema",
        "J. Davy Kirkpatrick",
        "Adam J. Burgasser"
      ],
      "categories": [
        "astro-ph.SR",
        "astro-ph.EP"
      ],
      "published": "2026-01-14T18:12:18Z",
      "updated": "2026-01-14T18:12:18Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09671v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09671v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 7
    },
    {
      "id": "2601.09639v1",
      "title": "Constraining the size, shape, and albedo of the large Trans-Neptunian Object (28978) Ixion with multi-chord stellar occultations",
      "abstract": "Trans-Neptunian objects (TNOs) are among the most primitive remnants of the early Solar System, and constraining their sizes, shapes, albedos, and surface properties is essential for understanding their origin and evolution. Stellar occultations provide highly accurate size and shape measurements for TNOs, while photometry constrains their albedo and surface colours. (28978) Ixion is one of the largest TNOs and a prominent Plutino, making it a key target for comparative studies. We aim to constrain Ixion's projected size, shape, absolute magnitude, geometric albedo, and surface colours, and to search for evidence of an atmosphere or circum-object material. We analysed stellar occultation campaigns by Ixion conducted between 2020 and 2023 within the Lucky Star collaboration, comprising 51 observations from eight events, including 30 positive detections. Five multi-chord events enabled a global limb fit and an accurate reconstruction of Ixion's projected shape. The occultations reveal a slightly elongated limb well represented by a single projected ellipse, yielding an area-equivalent diameter of $D_{\\mathrm{equiv}} = 696.78^{+10.75}_{-8.87}$ km and an apparent oblateness $ε' = 0.081^{+0.004}_{-0.010}$. Typical radial residuals of order $\\sim$10 km indicate a largely stable shape across epochs, with modest epoch-dependent variations. Calibrated photometric data yield an absolute magnitude of $H_V = 3.845 \\pm 0.006$, a phase-curve slope of $β= 0.1301 \\pm 0.0078$ mag deg$^{-1}$, and a visible geometric albedo of $p_V = 0.106^{+0.003}_{-0.003}$, with colours consistent with moderately red TNO surfaces. No atmosphere or circum-object material is detected down to our sensitivity limits. The best-sampled event also allows a precise measurement of the angular diameter of the occulted star Gaia DR3 4056440205544338944, $θ_\\star = 0.670 \\pm 0.010$ mas.",
      "authors": [
        "Y. Kilic",
        "F. Braga-Ribas",
        "C. L. Pereira",
        "J. L. Ortiz",
        "B. Sicardy",
        "P. Santos-Sanz",
        "O. Erece",
        "J. L. Rizos",
        "J. M. Gómez-Limón",
        "G. Margoti",
        "D. Souami",
        "B. Morgado",
        "A. Gomes-Junior",
        "L. M. Catani",
        "J. Desmars",
        "M. Kretlow",
        "F. Rommel",
        "R. Duffard",
        "A. Alvarez-Candal",
        "J. I. B. Camargo",
        "M. Kaplan",
        "N. Morales",
        "D. Herald",
        "M. Assafin",
        "G. Benedetti-Rossi",
        "R. Sfair",
        "R. Savalle",
        "J. Arcas-Silva",
        "L. Bernasconi",
        "T. Blank",
        "M. Bonavita",
        "N. Carlson",
        "B. Christophe",
        "C. A. Colesanti",
        "M. Collins",
        "G. Columba",
        "R. Dunford",
        "D. W. Dunham",
        "J. Dunham",
        "M. Emilio",
        "W. G. Ferrante",
        "T. George",
        "W. Hanna",
        "G. Isopi",
        "R. Jones",
        "D. A. Kenyon",
        "S. Kerr",
        "V. Kouprianov",
        "P. D. Maley",
        "F. Mallia",
        "J. Mattei",
        "M. Meunier",
        "T. Napoleao",
        "V. F. Peixoto",
        "J. Pollock",
        "C. Snodgrass",
        "A. Stechina",
        "W. Thomas",
        "R. Venable",
        "G. R. Viscome",
        "A. Zapparata",
        "J. Bardecker",
        "N. Castro",
        "C. Cebral",
        "A. Chapman",
        "C. Gao",
        "K. Green",
        "A. Guimaraes",
        "C. Jacques",
        "E. Jehin",
        "M. Konishi",
        "R. Leiva",
        "L. Liberato",
        "C. Magliano",
        "L. A. Mammana",
        "M. Melita",
        "V. Moura",
        "Y. Olivera-Cuello",
        "L. Peiro",
        "J. Spagnotto",
        "P. C. Stuart",
        "L. Vanzi",
        "A. Wilberger",
        "M. Malacarne"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T17:20:09Z",
      "updated": "2026-01-14T17:20:09Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09639v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09639v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 7
    },
    {
      "id": "2601.09401v1",
      "title": "True Masses using RV data with Hipparcos and Gaia Astrometry",
      "abstract": "Long-period companions are detected and characterized thanks to long-baseline radial velocity surveys. Combining Doppler time-series with astrometry, and in particular with proper motion anomalies technique, it is possible to put strong constraints on their orbital inclination and true mass. This work aims to present a model that combines Hipparcos and Gaia astrometric data with radial velocity measurements to constrain the orbital inclinations and true masses of long-period companions. Additionally, we re-analyse a small sample of targets that have not yet been studied using this combined approach. This research leverages the simultaneous modelling of proper motion anomalies and radial velocities, in conjunction with an analysis of the sensitivity curve. This approach serves not only as a verification of the parameters but also as a means to acquire valuable insights into planetary systems. The new analyses reveal that some of the targets classified as brown dwarfs or small-mass stars have a planetary nature. HD 5388 b and HD 6718 b are likely planets. HD 141937 b is likely a planet, but the current dataset does not allow us to firmly constrain its true mass. HD 16760 b belongs to the brown dwarf regime and it has a probable second companion. 30 Ari B b falls within the stellar regime, but the presence of an additional stellar companion could compromise the reliability of the final results. For HD 148427 b, HD 96127 b and HIP 65891 b we determined a range for the orbital inclinations.",
      "authors": [
        "G. Piccinini",
        "A. Petralia",
        "A. Sozzetti",
        "S. Benatti",
        "D. Gandolfi",
        "G. Micela"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.IM",
        "astro-ph.SR"
      ],
      "published": "2026-01-14T11:44:26Z",
      "updated": "2026-01-14T11:44:26Z",
      "pdf_link": "https://arxiv.org/pdf/2601.09401v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.09401v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 7
    },
    {
      "id": "2601.10631v1",
      "title": "Circumplanetary Disk Candidate in the Disk of HD 163296 Traced by Localized Emission from Simple Organics",
      "abstract": "Atacama Large Millimeter/submillimeter Array observations suggest that the disc of HD 163296 is being actively shaped by embedded, yet unseen protoplanets, as indicated by numerous gas and dust substructures consistent with planet-disc interaction models. We report the first detection of simple organic molecules, HCN and C2H, tracing a candidate circumplanetary disc (CPD) in the HD 163296 system, located at an orbital radius of $R=88\\pm7$ au and azimuth $φ=46\\pm3^\\circ$ (or $R=0.75''$, $\\rm{PA}=350^\\circ$ in projected sky coordinates), and originating near the midplane of the circumstellar disc. The signature is localised but spectrally resolved, and it overlaps with a previously reported planet candidate, P94, identified through kinematic perturbations traced by CO lines. We propose a scenario in which the observed chemical anomalies arise from increased heating driven by the forming planet and ongoing accretion through its CPD, facilitating the thermal desorption of species that would otherwise remain frozen out in the disc midplane, and potentially triggering the activation barriers of chemical reactions that lead to enhanced molecular production. Based on a first-order dynamical analysis of the HCN spectrum from the CPD--isolated with a 7$σ$ significance--we infer an upper limit on the planet mass of 1.8 $M_{\\rm Jup}$, consistent with predictions from CO kinematics and constraints from direct imaging studies. By comparing the CPD sizes derived from our models with theoretical expectations where the CPD radius corresponds to roughly one-third of the planet's Hill radius, we favor CPD gas temperatures $T > 150$ K, planet masses $M_{\\rm p} < 1.0$ $M_{\\rm Jup}$, and CPD radii $R_{\\rm CPD} < 2$ au.",
      "authors": [
        "Andres F. Izquierdo",
        "Jaehan Bae",
        "Maria Galloway-Sprietsma",
        "Ewine F. van Dishoeck",
        "Stefano Facchini",
        "Giovanni Rosotti",
        "Jochen Stadler",
        "Myriam Benisty",
        "Leonardo Testi"
      ],
      "categories": [
        "astro-ph.EP",
        "astro-ph.SR"
      ],
      "published": "2026-01-15T17:50:13Z",
      "updated": "2026-01-15T17:50:13Z",
      "pdf_link": "https://arxiv.org/pdf/2601.10631v1.pdf",
      "abs_link": "https://arxiv.org/abs/2601.10631v1",
      "is_exoplanet_focused": false,
      "tweetability_score": 6
    }
  ]
}